<?xml version="1.0" encoding="utf-8"?>
<feed xmlns="http://www.w3.org/2005/Atom">
  <title>CLD的博客</title>
  
  <subtitle>好好学习，天天向上</subtitle>
  <link href="/atom.xml" rel="self"/>
  
  <link href="https://cenleiding.github.io/"/>
  <updated>2018-10-25T14:53:38.098Z</updated>
  <id>https://cenleiding.github.io/</id>
  
  <author>
    <name>CLD</name>
    
  </author>
  
  <generator uri="http://hexo.io/">Hexo</generator>
  
  <entry>
    <title>神经网络ANN</title>
    <link href="https://cenleiding.github.io/%E7%A5%9E%E7%BB%8F%E7%BD%91%E7%BB%9CANN.html"/>
    <id>https://cenleiding.github.io/神经网络ANN.html</id>
    <published>2018-10-19T12:31:59.000Z</published>
    <updated>2018-10-25T14:53:38.098Z</updated>
    
    <content type="html"><![CDATA[<p><img src="/&#x795E;&#x7ECF;&#x7F51;&#x7EDC;ANN/ANN_1.jpg" alt="img"></p><h2 id="&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;"><a href="#&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;" class="headerlink" title="&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;"></a>&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;</h2><p>&#x8FD9;&#x91CC;&#x6211;&#x4E5F;&#x4E0D;&#x60F3;&#x641E;&#x54EA;&#x4E9B;&#x9EBB;&#x70E6;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x53EA;&#x60F3;&#x7B80;&#x5355;&#x7684;&#x4ECE;&#x76F4;&#x89C9;&#x4E0A;&#x53BB;&#x7406;&#x89E3;&#x4EC0;&#x4E48;&#x662F;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x3002;</p><p>&#x9996;&#x5148;&#x6765;&#x770B;&#x4E00;&#x4E0B;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x6D41;&#x7A0B;&#xFF1A;&#x6570;&#x636E;&#x4ECE;&#x8F93;&#x5165;&#x5C42;&#x8F93;&#x5165;&#xFF0C;&#x7136;&#x540E;&#x7ECF;&#x8FC7;&#x4E2D;&#x95F4;&#x7684;&#x9690;&#x85CF;&#x5C42;&#x7684;&#x6FC0;&#x52B1;&#x51FD;&#x6570;&#xFF0C;&#x6700;&#x540E;&#x5728;&#x8F93;&#x51FA;&#x5C42;&#x8F93;&#x51FA;&#x76F8;&#x5E94;&#x5927;&#x5C0F;&#x7684;&#x7ED3;&#x679C;&#x3002;</p><h3 id="&#x65B9;&#x5411;&#x4E00;&#xFF1A;&#x4ECE;&#x8FC7;&#x7A0B;&#x770B;"><a href="#&#x65B9;&#x5411;&#x4E00;&#xFF1A;&#x4ECE;&#x8FC7;&#x7A0B;&#x770B;" class="headerlink" title="&#x65B9;&#x5411;&#x4E00;&#xFF1A;&#x4ECE;&#x8FC7;&#x7A0B;&#x770B;"></a>&#x65B9;&#x5411;&#x4E00;&#xFF1A;&#x4ECE;&#x8FC7;&#x7A0B;&#x770B;</h3><p>&#x8BE5;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x53C2;&#x8003;<a href="http://colah.github.io/posts/2014-03-NN-Manifolds-Topology/" target="_blank" rel="noopener">colah&#x7684;&#x535A;&#x5BA2;&#x3002;</a></p><p>&#x6BCF;&#x4E00;&#x5C42;&#x7684;&#x9690;&#x85CF;&#x5C42;&#x90FD;&#x53EF;&#x4EE5;&#x770B;&#x6210;&#x4E00;&#x4E2A;&#x53D8;&#x6362;&#x51FD;&#x6570;&#xFF0C;&#x8F93;&#x5165;&#x6570;&#x636E;&#x7ECF;&#x8FC7;&#x4E00;&#x5C42;&#x9690;&#x85CF;&#x5C42;&#x5C31;&#x76F8;&#x5F53;&#x4E8E;&#x8FDB;&#x884C;&#x4E86;&#x4E00;&#x6B21;&#x53D8;&#x6362;&#x3002;&#x4E8E;&#x662F;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x53D8;&#x6362;&#x5C06;&#x4E0D;&#x540C;&#x5E73;&#x9762;&#x7684;&#x8F93;&#x5165;&#x6570;&#x636E;&#x62C9;&#x4F38;&#x53D8;&#x6362;&#x5230;&#x4E00;&#x4E2A;&#x5E73;&#x9762;&#x5E76;&#x8FDB;&#x884C;&#x5206;&#x79BB;&#xFF0C;&#x8FD9;&#x6837;&#x5BF9;&#x4E8E;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x6211;&#x4EEC;&#x53EA;&#x8981;&#x8FDB;&#x884C;&#x7B80;&#x5355;&#x7684;&#x7EBF;&#x6027;&#x5206;&#x5272;&#x5C31;&#x80FD;&#x5206;&#x7C7B;&#x6570;&#x636E;&#x4E86;&#x3002;</p><p>&#x6BD4;&#x5982;&#x6211;&#x4EEC;&#x73B0;&#x5728;&#x8981;&#x5BF9;&#x4EE5;&#x4E0B;&#x7684;&#x4E24;&#x4E2A;&#x66F2;&#x7EBF;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#xFF1A;</p><p><img src="/&#x795E;&#x7ECF;&#x7F51;&#x7EDC;ANN/ANN_2.png" alt="img"></p><p>&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#x65E0;&#x6CD5;&#x4F7F;&#x7528;&#x7EBF;&#x6027;&#x5206;&#x5272;&#x7684;&#x65B9;&#x5F0F;&#x5206;&#x7C7B;&#x66F2;&#x7EBF;&#xFF0C;&#x800C;&#x83B7;&#x5F97;&#x4E00;&#x4E2A;&#x201C;&#x626D;&#x66F2;&#x201D;&#x7684;&#x8FB9;&#x754C;&#x51FD;&#x6570;&#x5E76;&#x4E0D;&#x5BB9;&#x6613;&#x3002;&#x4E8E;&#x662F;&#x901A;&#x8FC7;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x6211;&#x4EEC;&#x5C06;&#x66F2;&#x7EBF;&#x53D8;&#x6362;&#x4E3A;&#x5982;&#x4E0B;&#x6837;&#x5B50;&#xFF1A;</p><p><img src="/&#x795E;&#x7ECF;&#x7F51;&#x7EDC;ANN/ANN_3.png" alt="img"></p><p>&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x5BF9;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x8F93;&#x51FA;&#x7ED3;&#x679C;&#x8FDB;&#x884C;&#x7EBF;&#x6027;&#x7684;&#x5206;&#x5272;&#xFF0C;&#x95EE;&#x9898;&#x5C31;&#x53D8;&#x7684;&#x5F88;&#x7B80;&#x5355;&#x3002;&#x5F53;&#x7136;&#x8FD9;&#x53EA;&#x662F;&#x6700;&#x7B80;&#x5355;&#x60C5;&#x51B5;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x5BF9;&#x4E8E;&#x8F83;&#x590D;&#x6742;&#x7684;&#x60C5;&#x51B5;&#x4E5F;&#x4E00;&#x6837;&#xFF1A;</p><iframe height="600" width="800" src="https://github.com/cenleiding/cenleiding.github.io/blob/master/&#x795E;&#x7ECF;&#x7F51;&#x7EDC;ANN/ANN_4.gif"></iframe><p>&#x6211;&#x4EEC;&#x53EA;&#x8981;&#x589E;&#x52A0;&#x7F51;&#x7EDC;&#x7684;&#x9690;&#x85CF;&#x5C42;&#x6570;&#x91CF;&#x548C;&#x6BCF;&#x5C42;&#x7684;&#x6FC0;&#x52B1;&#x5355;&#x5143;&#x6570;&#x91CF;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5C06;&#x4E00;&#x4E9B;&#x66F4;&#x4E3A;&#x590D;&#x6742;&#x7684;&#x51FD;&#x6570;&#x5206;&#x79BB;&#x5F00;&#x6765;&#x3002;</p><p>&#x4F46;&#x662F;&#x8FD9;&#x53EA;&#x662F;&#x7406;&#x60F3;&#x72B6;&#x6001;&#xFF0C;&#x5F80;&#x5F80;&#x6211;&#x4EEC;&#x5E76;&#x4E0D;&#x80FD;&#x505A;&#x5230;&#x968F;&#x4FBF;&#x589E;&#x52A0;&#x7F51;&#x7EDC;&#x8282;&#x70B9;&#x548C;&#x5C42;&#x6570;&#x56E0;&#x4E3A;&#x8BA1;&#x7B97;&#x91CF;&#x5B9E;&#x5728;&#x592A;&#x590D;&#x6742;&#xFF0C;&#x800C;&#x5B9E;&#x9645;&#x95EE;&#x9898;&#x7684;&#x6570;&#x636E;&#x53C8;&#x5F80;&#x5F80;&#x6709;&#x7740;&#x590D;&#x6742;&#x7684;&#x7ED3;&#x6784;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#xFF1A;</p><p><img src="/&#x795E;&#x7ECF;&#x7F51;&#x7EDC;ANN/ANN_5.png" alt="img"></p><p>&#x73B0;&#x5B9E;&#x6570;&#x636E;&#x5F80;&#x5F80;&#x662F;&#x7F20;&#x7ED5;&#x5728;&#x4E00;&#x8D77;&#x7684;&#xFF0C;&#x8981;&#x5B8C;&#x5168;&#x5206;&#x79BB;&#x8FD9;&#x6837;&#x7684;&#x6570;&#x636E;&#x9700;&#x8981;&#x5341;&#x5206;&#x590D;&#x6742;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x3002;&#x597D;&#x5728;&#x6211;&#x4EEC;&#x5728;&#x5B9E;&#x9645;&#x5E94;&#x7528;&#x65F6;&#x5E76;&#x4E0D;&#x8981;&#x6C42;&#x4E00;&#x5B9A;&#x8981;&#x5F97;&#x5230;&#x5B8C;&#x7F8E;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x4E8E;&#x662F;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5C06;&#x6570;&#x636E;&#x53D8;&#x6362;&#x4E3A;&#x4EE5;&#x4E0B;&#x6837;&#x5F0F;&#xFF1A;</p><p><img src="/&#x795E;&#x7ECF;&#x7F51;&#x7EDC;ANN/ANN_6.png" alt="img"></p><p>&#x6211;&#x4EEC;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x8BA9;&#x6570;&#x636E;&#x91CD;&#x53E0;&#x7684;&#x90E8;&#x5206;&#x53D8;&#x5C11;&#xFF0C;&#x7136;&#x540E;&#x5206;&#x79BB;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x6837;&#x4F1A;&#x4EA7;&#x751F;&#x8BEF;&#x5DEE;&#xFF0C;&#x4F46;&#x662F;&#x80FD;&#x8F83;&#x5FEB;&#x7684;&#x5F97;&#x5230;&#x53EF;&#x7528;&#x7ED3;&#x679C;&#x3002;</p><h3 id="&#x65B9;&#x5411;&#x4E8C;&#xFF1A;&#x4ECE;&#x7ED3;&#x679C;&#x770B;"><a href="#&#x65B9;&#x5411;&#x4E8C;&#xFF1A;&#x4ECE;&#x7ED3;&#x679C;&#x770B;" class="headerlink" title="&#x65B9;&#x5411;&#x4E8C;&#xFF1A;&#x4ECE;&#x7ED3;&#x679C;&#x770B;"></a>&#x65B9;&#x5411;&#x4E8C;&#xFF1A;&#x4ECE;&#x7ED3;&#x679C;&#x770B;</h3><p>&#x4E0A;&#x9762;&#x8BB2;&#x7684;&#x4ECE;&#x8FC7;&#x7A0B;&#x770B;&#x867D;&#x7136;&#x5341;&#x5206;&#x5F62;&#x8C61;&#xFF0C;&#x4F46;&#x662F;&#x5E76;&#x4E0D;&#x80FD;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x5B9E;&#x73B0;&#x5F97;&#x5230;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;~&#x6BD5;&#x7ADF;&#x6211;&#x4EEC;&#x5E76;&#x4E0D;&#x77E5;&#x9053;&#x5E94;&#x8BE5;&#x600E;&#x4E48;&#x53D8;&#x5316;<del>&#x81F3;&#x5C11;&#x73B0;&#x5728;&#x4E0D;&#x80FD;</del>&#x3002;&#x4F46;&#x662F;&#x4ECE;&#x7ED3;&#x679C;&#x51FA;&#x53D1;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6570;&#x5B66;&#x8BAD;&#x7EC3;&#x5F97;&#x5230;&#x60F3;&#x8981;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF01;</p><p>&#x5BF9;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x53D8;&#x5F62;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#x5BF9;&#x8F93;&#x5165;&#x6570;&#x636E;&#x77E9;&#x9635;&#x8FDB;&#x884C;&#x53D8;&#x6362;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x7F51;&#x7EDC;&#x8282;&#x70B9;&#x90FD;&#x662F;&#x4E00;&#x6B21;&#x53D8;&#x6362;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x76EE;&#x6807;&#x662F;&#x5F3A;&#x884C;&#x5C06;&#x8F93;&#x5165;&#x77E9;&#x9635;&#x53D8;&#x7684;&#x548C;&#x76EE;&#x6807;&#x7ED3;&#x679C;&#x77E9;&#x9635;&#x76F8;&#x4F3C;&#x3002;</p><p>&#x800C;&#x6BCF;&#x4E00;&#x6B21;&#x53D8;&#x6362;&#x90FD;&#x662F;&#x4E00;&#x6B21;&#x77E9;&#x9635;&#x7684;&#x76F8;&#x4E58;&#xFF0C;&#x4E8E;&#x662F;&#x53EF;&#x4EE5;&#x770B;&#x6210;&#x3010;&#x8F93;&#x5165;&#x77E9;&#x9635;*&#x7F51;&#x7EDC;&#x77E9;&#x9635;&#x3011;=&gt;&#x3010;&#x8F93;&#x51FA;&#x77E9;&#x9635;&#x3011;&#xFF0C;&#x5173;&#x952E;&#x662F;&#x786E;&#x5B9A;&#x7F51;&#x7EDC;&#x77E9;&#x9635;&#x4E2D;&#x832B;&#x832B;&#x591A;&#x7684;&#x53C2;&#x6570;&#x3002;</p><p>&#x800C;&#x8F93;&#x51FA;&#x77E9;&#x9635;&#x548C;&#x76EE;&#x6807;&#x77E9;&#x9635;&#x7684;&#x76F8;&#x4F3C;&#x5EA6;&#x5219;&#x53EF;&#x4EE5;&#x7528;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#xFF08;cost -function&#xFF09;&#x6765;&#x8868;&#x793A;&#xFF0C;&#x5177;&#x4F53;&#x600E;&#x4E48;&#x8BBE;&#x8BA1;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x770B;&#x60C5;&#x51B5;&#x6765;&#x5B9A;&#x3002;&#x8FD9;&#x65F6;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;&#x6574;&#x4F53;&#x770B;&#x6210;&#x3010;&#x8F93;&#x5165;&#x77E9;&#x9635; <em>&#x8F93;&#x51FA;&#x77E9;&#x9635; </em>&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x3011;=&gt;&#x3010;&#x4EE3;&#x4EF7;&#x503C;&#x3011;&#x3002;</p><p>&#x6BEB;&#x65E0;&#x7591;&#x95EE;&#x8FD9;&#x4E2A;&#x4EE3;&#x4EF7;&#x503C;&#x8D8A;&#x5C0F;&#x8D8A;&#x597D;&#x3002;&#x800C;&#x8FD9;&#x4E2A;&#x5E26;&#x4EF7;&#x503C;&#x662F;&#x4E00;&#x4E2A;&#x591A;&#x5143;&#x591A;&#x6B21;&#x65B9;&#x7A0B;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p><p><img src="/&#x795E;&#x7ECF;&#x7F51;&#x7EDC;ANN/ANN_7.jpg" alt="img"></p><p>&#x6211;&#x4EEC;&#x7684;&#x76EE;&#x6807;&#x5C31;&#x662F;&#x4ECE;&#x4E2D;&#x627E;&#x5230;&#x6700;&#x4F4E;&#x7684;&#x90A3;&#x4E2A;&#x70B9;&#x3002;</p><p>&#x8981;&#x6C42;&#x4E00;&#x4E2A;&#x65B9;&#x7A0B;&#x7684;&#x6700;&#x4F4E;&#x70B9;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x5BF9;&#x6BCF;&#x4E2A;&#x53C2;&#x6570;&#x6C42;&#x504F;&#x5BFC;&#xFF0C;&#x7136;&#x540E;&#x6CBF;&#x7740;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7684;&#x65B9;&#x5411;&#x53D8;&#x6362;&#x53C2;&#x6570;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;<strong>&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7B97;&#x6CD5; &#xFF08;Gradient Descent algorithm&#xFF09;GD&#x3002;</strong>&#x800C;&#x5177;&#x4F53;&#x5982;&#x4F55;&#x786E;&#x5B9A;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x53C2;&#x6570;&#x7684;&#x53D8;&#x5316;&#xFF0C;&#x8FD9;&#x5C31;&#x9700;&#x8981;&#x7528;&#x5230;<strong>&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x7B97;&#x6CD5; &#xFF08;Back Propagation algorithm&#xFF09;BP&#x3002;</strong> </p><blockquote><p>&#x6240;&#x4EE5;&#x4ECE;&#x7ED3;&#x679C;&#x6765;&#x770B;&#xFF1A;<strong>&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x642D;&#x5EFA;&#x5C31;&#x662F;&#x5047;&#x8BBE;&#x4E00;&#x4E2A;&#x9AD8;&#x6B21;&#x7684;&#x53D8;&#x5316;&#x65B9;&#x7A0B;&#xFF1B;&#x8BAD;&#x7EC3;&#x5C31;&#x662F;&#x51D1;&#x53D8;&#x6362;&#x51FD;&#x6570;&#x53C2;&#x6570;&#x3002;</strong> &#x8FD9;&#x6837;&#x770B;&#x6765;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x539F;&#x7406;&#x4E5F;&#x5C31;&#x6CA1;&#x4EC0;&#x4E48;&#xFF0C;&#x5C31;&#x662F;&#x9760;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x7B97;&#x529B;&#x5F3A;&#x884C;&#x51D1;&#x51FD;&#x6570;&#x3002;&#x3002;&#x3002; </p></blockquote><h2 id="&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x548C;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;"><a href="#&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x548C;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;" class="headerlink" title="&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x548C;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;"></a>&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x548C;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;</h2><p>&#x8FD9;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x8FD8;&#x662F;&#x4E3B;&#x8981;&#x53C2;&#x8003;<a href="http://colah.github.io/posts/2014-03-NN-Manifolds-Topology/" target="_blank" rel="noopener">colah&#x7684;&#x535A;&#x5BA2;&#x3002;</a> &#x548C; <a href="http://galaxy.agh.edu.pl/~vlsi/AI/backp_t_en/backprop.html" target="_blank" rel="noopener">AGH</a></p><blockquote><p> <strong>&#x68AF;&#x5EA6;&#x4E0B;&#x964D;</strong>:</p></blockquote><p>&#x4E0A;&#x9762;&#x4E5F;&#x8BB2;&#x5230;&#x4E86;&#xFF0C;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7B97;&#x6CD5;&#x7684;&#x76EE;&#x7684;&#x5C31;&#x662F;&#x83B7;&#x5F97;&#x76EE;&#x6807;&#x65B9;&#x7A0B;&#x7684;&#x6700;&#x4F4E;&#x70B9;&#x3002;&#x800C;&#x6700;&#x4F4E;&#x70B9;&#x7684;&#x201C;&#x659C;&#x7387;&#x201D;&#x662F;&#x4E3A;0&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x53EA;&#x8981;&#x5BF9;&#x65B9;&#x7A0B;&#x6C42;&#x504F;&#x5BFC;&#xFF0C;&#x5C31;&#x80FD;&#x77E5;&#x9053;&#x5F53;&#x524D;&#x70B9;&#x7684;&#x201C;&#x659C;&#x7387;&#x201D;&#xFF0C;&#x7136;&#x540E;&#x53EA;&#x8981;&#x6CBF;&#x7740;&#x8FD9;&#x4E2A;&#x659C;&#x7387;&#x7684;&#x53CD;&#x65B9;&#x5411;&#x79FB;&#x52A8;&#x5C31;&#x80FD;&#x7406;&#x8BBA;&#x4E0A;&#x5230;&#x8FBE;&#x6700;&#x4F4E;&#x70B9;&#x4E86;&#x3002;</p><p>&#x8FC7;&#x7A0B;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#xFF1A;</p><p><img src="/&#x795E;&#x7ECF;&#x7F51;&#x7EDC;ANN/ANN_8.jpg" alt="img"></p><p><strong>&#x5C40;&#x90E8;&#x6700;&#x4F4E;&#x70B9;&#x95EE;&#x9898;&#xFF1A;</strong> &#x4ECE;&#x4E0A;&#x56FE;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x6CBF;&#x7740;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7684;&#x65B9;&#x5411;&#x79FB;&#x52A8;&#x5E76;&#x4E0D;&#x4E00;&#x5B9A;&#x80FD;&#x83B7;&#x5F97;&#x5168;&#x5C40;&#x7684;&#x6700;&#x4F4E;&#x70B9;&#x3002;&#x56E0;&#x4E3A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x521B;&#x5EFA;&#x7684;&#x65B9;&#x7A0B;&#x5F80;&#x5F80;&#x662F;&#x5F88;&#x590D;&#x6742;&#x7684;&#xFF0C;&#x6709;&#x7740;&#x5927;&#x91CF;&#x7684;&#x201C;&#x8C37;&#x5E95;&#x201D;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x8D77;&#x70B9;&#x6700;&#x540E;&#x6389;&#x843D;&#x7684;&#x201C;&#x8C37;&#x5E95;&#x201D;&#x4E0D;&#x4E00;&#x5B9A;&#x76F8;&#x540C;&#x3002;&#x800C;&#x8FD9;&#x4E2A;&#x8D77;&#x70B9;&#x53D6;&#x51B3;&#x4E8E;&#x6211;&#x4EEC;&#x5BF9;&#x53C2;&#x6570;&#x7684;&#x521D;&#x59CB;&#x503C;&#x8BBE;&#x5B9A;&#x3002;&#x56E0;&#x6B64;&#x5728;&#x5B9E;&#x9645;&#x8BAD;&#x7EC3;&#x7F51;&#x7EDC;&#x65F6;&#xFF0C;&#x6709;&#x65F6;&#x5BF9;&#x521D;&#x59CB;&#x503C;&#x8BBE;&#x5B9A;&#x8FDB;&#x884C;&#x4E00;&#x4E9B;&#x201C;&#x5C0F;&#x64CD;&#x4F5C;&#x201D;&#x4F1A;&#x6709;&#x52A9;&#x4E8E;&#x63D0;&#x9AD8;&#x6700;&#x540E;&#x7ED3;&#x679C;&#x7684;&#x51C6;&#x786E;&#x5EA6;&#x3002;&#x3002;&#x3002;&#x55EF;&#xFF0C;&#x6240;&#x4EE5;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x5F88;&#x7384;&#x5B66;&#xFF01;</p><p><img src="/&#x795E;&#x7ECF;&#x7F51;&#x7EDC;ANN/ANN_9.png" alt="img"></p><p><strong>&#x5B66;&#x4E60;&#x901F;&#x7387;&#x95EE;&#x9898;&#xFF1A;</strong> &#x524D;&#x9762;&#x8BB2;&#x4E86;&#x8981;&#x6CBF;&#x7740;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x7684;&#x65B9;&#x5411;&#x79FB;&#x52A8;&#xFF0C;&#x4F46;&#x662F;&#x5177;&#x4F53;&#x79FB;&#x52A8;&#x591A;&#x5C11;&#x5462;&#xFF1F;&#x9996;&#x5148;&#x5F88;&#x660E;&#x663E;&#x8DDF;&#x9884;&#x6D4B;&#x503C;&#x4E0E;&#x76EE;&#x6807;&#x503C;&#x7684;&#x5DEE;&#x8DDD;&#x6709;&#x5173;&#xFF0C;&#x4E24;&#x8005;&#x5DEE;&#x8DDD;&#x8D8A;&#x5927;&#x90A3;&#x5C31;&#x8981;&#x79FB;&#x52A8;&#x7684;&#x8D8A;&#x591A;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;<strong>&#x68AF;&#x5EA6;&#x8BEF;&#x5DEE;&#xFF08;error gradient&#xFF09;</strong>&#x3002;&#x4F46;&#x662F;&#x5982;&#x679C;&#x76F4;&#x63A5;&#x6839;&#x636E;&#x8FD9;&#x4E2A;&#x8BEF;&#x5DEE;&#x6765;&#x8C03;&#x6574;&#x53C2;&#x6570;&#xFF0C;&#x53D1;&#x73B0;&#x53C2;&#x6570;&#x53D8;&#x5316;&#x5E45;&#x5EA6;&#x592A;&#x5927;&#x4E86;&#xFF0C;&#x4F1A;&#x5BFC;&#x81F4;&#x7ED3;&#x679C;&#x4E00;&#x76F4;&#x5728;&#x9707;&#x8361;&#xFF08;&#x5982;&#x53F3;&#x56FE;&#x6240;&#x793A;&#xFF09;&#xFF0C;&#x751A;&#x81F3;&#x76F4;&#x63A5;&#x5C31;&#x98DE;&#x51FA;&#x8FD9;&#x4E2A;&#x201C;&#x5C71;&#x8C37;&#x201D;&#x3002;&#x3002;&#x3002;&#x56E0;&#x6B64;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x503C;&#x6765;&#x7F29;&#x5C0F;&#x8FD9;&#x4E2A;&#x53D8;&#x5316;&#x5E45;&#x5EA6;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;<strong>&#x5B66;&#x4E60;&#x901F;&#x7387;&#xFF08;learning rate&#xFF09;</strong> &#xFF0C;&#x5B66;&#x4E60;&#x901F;&#x7387;&#x5F80;&#x5F80;&#x662F;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x5C0F;&#x7684;&#x503C;&#x5982;0.01&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x80FD;&#x4F7F;&#x5F97;&#x65B9;&#x7A0B;&#x6162;&#x6162;&#x7684;&#x5411;&#x8C37;&#x5E95;&#x79FB;&#x52A8;&#x3002;&#x5B66;&#x4E60;&#x901F;&#x7387;&#x7684;&#x9009;&#x53D6;&#x662F;&#x4E2A;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x70B9;&#xFF0C;&#x592A;&#x5C0F;&#x4F1A;&#x5BFC;&#x81F4;&#x4E0B;&#x964D;&#x7684;&#x5341;&#x5206;&#x7F13;&#x6162;&#xFF0C;&#x8BAD;&#x7EC3;&#x7F51;&#x7EDC;&#x9700;&#x8981;&#x5F88;&#x957F;&#x65F6;&#x95F4;&#xFF0C;&#x800C;&#x592A;&#x5927;&#x53C8;&#x4F1A;&#x5F15;&#x8D77;&#x201C;&#x9707;&#x8361;&#x201D;&#xFF0C;&#x5B66;&#x4E0D;&#x5230;&#x597D;&#x7684;&#x7ED3;&#x679C;&#x3002;</p><blockquote><p><strong>&#x53CD;&#x5411;&#x4F20;&#x64AD;&#xFF1A;</strong></p></blockquote><p>&#x77E5;&#x9053;&#x4E86;&#x8981;&#x8FDB;&#x884C;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#xFF0C;&#x4F46;&#x600E;&#x4E48;&#x5177;&#x4F53;&#x64CD;&#x4F5C;&#x662F;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x6BD5;&#x7ADF;&#x53C2;&#x6570;&#x8FD9;&#x4E48;&#x591A;&#xFF0C;&#x4E00;&#x4E2A;&#x4E2A;&#x6C42;&#x8FC7;&#x6765;&#x8FD9;&#x4E2A;&#x8BA1;&#x7B97;&#x91CF;&#x4E0D;&#x6562;&#x60F3;~</p><p>&#x4E8E;&#x662F;&#x5C31;&#x6709;&#x4E86;<strong>&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x7B97;&#x6CD5;</strong></p><p>&#x8FD9;&#x4E2A;&#x90E8;&#x5206;&#x4E00;&#x5F00;&#x59CB;&#x770B;&#x516C;&#x5F0F;&#x4E00;&#x76F4;&#x5F88;&#x7591;&#x60D1;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x8FD9;&#x4E48;&#x505A;&#xFF1F;&#x4E0D;&#x5C31;&#x662F;&#x4E2A;&#x94FE;&#x5F0F;&#x6CD5;&#x5219;&#xFF1F;&#x8FD9;&#x548C;&#x76F4;&#x63A5;&#x6C42;&#x6BCF;&#x4E2A;&#x53C2;&#x6570;&#x7684;&#x504F;&#x5BFC;&#xFF08;&#x6B63;&#x5411;&#x4F20;&#x64AD;&#xFF09;&#x5230;&#x5E95;&#x5FEB;&#x5728;&#x54EA;&#x91CC;&#xFF1F;&#x76F4;&#x5230;&#x770B;&#x4E86;colah&#x7684;&#x8BB2;&#x89E3;&#x624D;&#x604D;&#x7136;&#x5927;&#x609F;&#xFF0C;&#x4EC0;&#x4E48;&#x94FE;&#x5F0F;&#x6CD5;&#x5219;&#x90FD;&#x4E0D;&#x662F;&#x91CD;&#x70B9;&#xFF0C;<strong>&#x907F;&#x514D;&#x91CD;&#x590D;&#x8BA1;&#x7B97;&#x624D;&#x662F;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x7B97;&#x6CD5;&#x7684;&#x7CBE;&#x9AD3;&#xFF01;</strong></p><p>&#x63A5;&#x4E0B;&#x6765;&#x819C;&#x62DC;colah&#x5927;&#x4F6C;==&gt;</p><p>&#x9996;&#x5148;&#x770B;&#x4E00;&#x4E0B;&#x6B63;&#x5E38;&#x7684;&#x6C42;&#x504F;&#x5BFC;&#x662F;&#x600E;&#x4E48;&#x6C42;&#x7684;&#xFF1A;</p><p><img src="/&#x795E;&#x7ECF;&#x7F51;&#x7EDC;ANN/ANN_10.png" alt="img"></p><p>&#x6BD4;&#x5982;&#x8981;&#x6C42;b&#x5BF9;e&#x7684;&#x5F71;&#x54CD;&#x80FD;&#x529B;&#xFF0C;&#x6211;&#x4EEC;&#x7528;&#x94FE;&#x5F0F;&#x6CD5;&#x5219;&#x5C31;&#x80FD;&#x5F88;&#x7B80;&#x5355;&#x7684;&#x7B97;&#x51FA;e&#x5BF9;b&#x7684;&#x504F;&#x5BFC;&#x503C;&#x3002;</p><p>&#x7136;&#x540E;&#x62BD;&#x8C61;&#x4E00;&#x70B9;&#xFF0C;&#x6BD4;&#x5982;&#x73B0;&#x5728;&#x6709;&#x5982;&#x4E0B;&#x7F51;&#x7EDC;&#xFF0C;&#x5206;&#x522B;&#x6B63;&#x5411;&#x548C;&#x53CD;&#x5411;&#x7684;&#x6C42;&#x4E00;&#x6B21;&#x504F;&#x5BFC;&#xFF1A;</p><p><img src="/&#x795E;&#x7ECF;&#x7F51;&#x7EDC;ANN/ANN_11.png" alt="img"></p><p>&#x6B63;&#x5411;&#xFF08;Forward-Mode&#xFF09;:&#x4EE5;x&#x4E3A;&#x4E3B;&#xFF0C;&#x53CA;&#x8868;&#x793A;&#x4E86;x<strong>&#x53C2;&#x6570;&#x5BF9;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x7684;&#x5F71;&#x54CD;&#x80FD;&#x529B;</strong> &#x3002;</p><p>&#x53CD;&#x5411;&#xFF08;Reverse-Mode&#xFF09;:&#x4EE5;Z&#x4E3A;&#x4E3B;&#xFF0C;&#x53CA;&#x8868;&#x793A;&#x4E86;Z<strong>&#x7ED3;&#x679C;&#x5BF9;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x7684;&#x5F71;&#x54CD;&#x80FD;&#x529B;</strong>&#x3002;</p><p>&#x55EF;&#x3002;&#x3002;&#x3002;&#x3002;&#x3002;&#x770B;&#x8D77;&#x6765;&#x5F88;&#x6709;&#x9053;&#x7406;&#x7684;&#x6837;&#x5B50;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x6709;&#x4EC0;&#x4E48;&#x7528;&#x5462;&#xFF1F;</p><p>&#x90A3;&#x4E48;&#x5C31;&#x9700;&#x8981;&#x7528;&#x4F8B;&#x5B50;&#x4F53;&#x9A8C;&#x4E00;&#x4E0B;&#x4E24;&#x8005;&#x7684;&#x4E0D;&#x540C;&#x4E86;&#xFF01;</p><p><img src="/&#x795E;&#x7ECF;&#x7F51;&#x7EDC;ANN/ANN_12.png" alt="img"></p><p>&#x9996;&#x5148;&#xFF0C;&#x4E24;&#x8005;&#x90FD;&#x662F;&#x8981;&#x5C06;&#x5404;&#x4E2A;&#x8DEF;&#x5F84;&#x7684;&#x504F;&#x5FAE;&#x5206;&#x503C;&#x8BA1;&#x7B97;&#x51FA;&#x6765;&#x7684; &#xFF0C;&#x6BD5;&#x7ADF;&#x8FD9;&#x662F;&#x57FA;&#x7840;&#xFF0C;&#x5728;&#x7F51;&#x7EDC;&#x4E2D;&#x5C31;&#x662F;<strong>&#x8DEF;&#x5F84;&#x6743;&#x91CD;&#x503C;</strong> &#x3002;&#x3002;&#x3002;</p><p><em>&#x5411;&#x524D;&#x4F20;&#x64AD;</em>&#xFF1A;&#x662F;&#x4E00;&#x4E2A;<strong>&#x8DEF;&#x5F84;&#x904D;&#x5386;&#x6C42;&#x548C;</strong>&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x8981;&#x6C42;b&#x7684;&#x5F71;&#x54CD;&#x8981;&#x904D;&#x5386;&#x4E00;&#x6B21;&#xFF0C;&#x8981;&#x6C42;a&#x7684;&#x5F71;&#x54CD;&#x53C8;&#x8981;&#x904D;&#x5386;&#x4E00;&#x6B21;&#xFF0C;<strong>&#x540C;&#x4E00;&#x8DEF;&#x5F84;&#x4F1A;&#x88AB;&#x591A;&#x6B21;&#x8BA1;&#x7B97;</strong>&#x3002;&#x800C;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#x7684;&#x53C2;&#x6570;&#x548C;&#x8DEF;&#x5F84;&#x5982;&#x6B64;&#x4E4B;&#x591A;&#xFF0C;&#x8981;&#x662F;&#x6BCF;&#x8FDB;&#x884C;&#x4E00;&#x6B21;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x5C31;&#x8981;&#x5BF9;&#x6BCF;&#x4E2A;&#x53C2;&#x6570;&#x8FDB;&#x884C;&#x4E00;&#x6B21;&#x8DEF;&#x5F84;&#x904D;&#x5386;&#xFF0C;&#x8FD9;&#x4E2A;&#x8BA1;&#x7B97;&#x4E86;&#x5C31;&#x7206;&#x70B8;&#x4E86;&#xFF01;&#xFF01;&#xFF01;</p><p><em>&#x53CD;&#x5411;&#x4F20;&#x64AD;&#xFF1A;</em>&#x662F;&#x4E00;&#x4E2A;<strong>&#x4E00;&#x6B21;&#x6027;&#x6269;&#x6563;</strong>&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x5411;&#x540E;&#x4F20;&#x64AD;&#x76F4;&#x63A5;&#x786E;&#x5B9A;&#x4E86;&#x7ED3;&#x679C;&#x5BF9;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x7684;&#x5F71;&#x54CD;&#x80FD;&#x529B;&#xFF0C;<strong>&#x4E00;&#x6761;&#x8DEF;&#x5F84;&#x53EA;&#x4F1A;&#x88AB;&#x8BA1;&#x7B97;&#x4E00;&#x6B21;</strong>&#xFF0C;&#x8FD9;&#x4E2A;&#x51E0;&#x4E4E;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x8BA1;&#x7B97;&#x91CF;&#x3002;</p><p>&#x770B;&#x5B8C;&#x4E0D;&#x7ECF;&#x611F;&#x53F9;&#xFF0C;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x539F;&#x6765;&#x8FD9;&#x4E48;&#x7B80;&#x5355;&#xFF0C;&#x53C8;&#x8FD9;&#x4E48;&#x6709;&#x7528;&#x3002;&#x3002;&#x3002;</p><p>&#x6700;&#x540E;&#x8DDF;&#x7740;<a href="http://galaxy.agh.edu.pl/~vlsi/AI/backp_t_en/backprop.html" target="_blank" rel="noopener">AGH</a>&#x4E0A;&#x7684;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x56FE;&#x7406;&#x4E00;&#x904D;&#x6574;&#x4E2A;&#x8FC7;&#x7A0B;&#x3002;</p><p>&#x9996;&#x5148;&#x6211;&#x4EEC;&#x6709;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;&#xFF1A;</p><p><img src="/&#x795E;&#x7ECF;&#x7F51;&#x7EDC;ANN/ANN_13.png" alt="img"></p><p>&#x7136;&#x540E;&#x8F93;&#x5165;x1,x2&#x83B7;&#x5F97;&#x8F93;&#x51FA;y&#xFF0C;&#x5E76;&#x8BA1;&#x7B97;&#x5F97;&#x51FA;&#x8BEF;&#x5DEE;&#x3B4;&#xFF1A;</p><p><img src="/&#x795E;&#x7ECF;&#x7F51;&#x7EDC;ANN/ANN_14.png" alt="img"></p><p>&#x6709;&#x4E86;&#x6574;&#x4F53;&#x8BEF;&#x5DEE;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x8981;&#x5F00;&#x59CB;&#x53CD;&#x5411;&#x4F20;&#x64AD;&#x4E86;&#xFF0C;&#x8FDB;&#x800C;&#x83B7;&#x5F97;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x7684;&#x8F93;&#x51FA;&#x8BEF;&#x5DEE;&#xFF1A;</p><p><img src="/&#x795E;&#x7ECF;&#x7F51;&#x7EDC;ANN/ANN_15.png" alt="img"></p><p>&#x6700;&#x540E;&#x5C31;&#x662F;&#x5BF9;&#x6743;&#x91CD;&#x7684;&#x8C03;&#x6574;&#xFF0C;&#x3B7;&#x5C31;&#x662F;&#x5B66;&#x4E60;&#x901F;&#x7387;&#xFF1A;</p><p><img src="/&#x795E;&#x7ECF;&#x7F51;&#x7EDC;ANN/ANN_16.png" alt="img"></p><p>&#x8FD9;&#x91CC;&#x8981;&#x6CE8;&#x610F;&#x4E00;&#x4E0B;&#xFF0C;&#x4F20;&#x9012;&#x8BEF;&#x5DEE;&#x3B4;&#x53EA;&#x662F;&#x4EE3;&#x8868;&#x8282;&#x70B9;&#x8F93;&#x51FA;&#x503C;&#x7684;&#x504F;&#x5BFC;&#xFF0C;&#x800C;&#x6211;&#x4EEC;&#x7684;&#x76EE;&#x6807;&#x662F;&#x8DEF;&#x5F84;&#x6743;&#x91CD;w&#x7684;&#x504F;&#x5BFC;&#xFF0C;&#x4E2D;&#x95F4;&#x8FD8;&#x9700;&#x8981;&#x8FC7;&#x5EA6;&#x4E00;&#x4E0B;&#x3002;</p><script>        document.querySelectorAll('.github-emoji')          .forEach(el => {            if (!el.dataset.src) { return; }            const img = document.createElement('img');            img.style = 'display:none !important;';            img.src = el.dataset.src;            img.addEventListener('error', () => {              img.remove();              el.style.color = 'inherit';              el.style.backgroundImage = 'none';              el.style.background = 'none';            });            img.addEventListener('load', () => {              img.remove();            });            document.body.appendChild(img);          });      </script>]]></content>
    
    <summary type="html">
    
      什么是神经网络？对于神经网络的简单理解。
    
    </summary>
    
      <category term="机器学习" scheme="https://cenleiding.github.io/categories/%E6%9C%BA%E5%99%A8%E5%AD%A6%E4%B9%A0/"/>
    
    
      <category term="机器学习，神经网络" scheme="https://cenleiding.github.io/tags/%E6%9C%BA%E5%99%A8%E5%AD%A6%E4%B9%A0%EF%BC%8C%E7%A5%9E%E7%BB%8F%E7%BD%91%E7%BB%9C/"/>
    
  </entry>
  
  <entry>
    <title>TensorFlow 常用函数整理</title>
    <link href="https://cenleiding.github.io/TensorFlow-%E5%B8%B8%E7%94%A8%E5%87%BD%E6%95%B0.html"/>
    <id>https://cenleiding.github.io/TensorFlow-常用函数.html</id>
    <published>2018-10-10T13:15:00.000Z</published>
    <updated>2018-10-25T05:32:42.902Z</updated>
    
    <content type="html"><![CDATA[<p>&#x521A;&#x5F00;&#x59CB;&#x5B66;&#x4E60;TensorFlow&#xFF0C;&#x867D;&#x7136;&#x6709;<a href="https://www.tensorflow.org/versions/r1.12/api_docs/python/tf" target="_blank" rel="noopener">&#x5B98;&#x65B9;API</a>&#xFF0C;&#x4F46;&#x662F;&#x5206;&#x7C7B;&#x5B9E;&#x5728;&#x5BF9;&#x65B0;&#x624B;&#x4E0D;&#x53CB;&#x597D;&#x3002;&#x3002;&#x3002;</p><p>&#x6240;&#x4EE5;&#x6253;&#x7B97;&#x6574;&#x7406;&#x4E00;&#x4E0B;&#x7ECF;&#x5E38;&#x4F7F;&#x7528;&#x7684;API&#xFF0C;&#x65B9;&#x4FBF;&#x67E5;&#x627E;~&#x4F46;&#x7531;&#x4E8E;&#x7BC7;&#x5E45;&#x6709;&#x9650;&#xFF0C;&#x66F4;&#x8BE6;&#x7EC6;&#x7684;&#x4F7F;&#x7528;&#x4ECB;&#x7ECD;&#x8BF7;&#x67E5;&#x770B;&#x5B98;&#x7F51;&#x3002;</p><p>&#x5728;&#x8FD9;&#x5148;&#x611F;&#x8C22;&#x4E00;&#x4E0B;<a href="https://blog.csdn.net/lenbow" target="_blank" rel="noopener">&#x6797;&#x6D77;&#x5C71;&#x6CE2;</a> &#x7684;&#x6574;&#x7406;~</p><h2 id="&#x8FD0;&#x7B97;&#x64CD;&#x4F5C;"><a href="#&#x8FD0;&#x7B97;&#x64CD;&#x4F5C;" class="headerlink" title="&#x8FD0;&#x7B97;&#x64CD;&#x4F5C;"></a>&#x8FD0;&#x7B97;&#x64CD;&#x4F5C;</h2><p>###&#x57FA;&#x7840;&#x8FD0;&#x7B97;</p><table><thead><tr><th>&#x51FD;&#x6570;</th><th>&#x529F;&#x80FD;</th></tr></thead><tbody><tr><td><strong>tf.matmul(a,b,transpose_a=False, transpose_b=False, a_is_sparse=False, b_is_sparse=False, name=None)</strong></td><td>&#x77E9;&#x9635;&#x4E58;&#x6CD5;  a*b</td></tr><tr><td>tf.matrix_inverse(input, adjoint=None, name=None)</td><td>&#x77E9;&#x9635;&#x6C42;&#x9006;</td></tr><tr><td>tf.add(x, y, name=None)</td><td>&#x6C42;&#x548C;</td></tr><tr><td>tf.sub(x, y, name=None)</td><td>&#x51CF;&#x6CD5;</td></tr><tr><td><strong>tf.multiply(x, y, name=None)</strong></td><td>&#x4E58;&#x6CD5; a&#xB7;b</td></tr><tr><td>tf.div(x, y, name=None)</td><td>&#x9664;&#x6CD5;</td></tr><tr><td>tf.mod(x, y, name=None)</td><td>&#x53D6;&#x6A21;</td></tr><tr><td>tf.abs(x, name=None)</td><td>&#x6C42;&#x7EDD;&#x5BF9;&#x503C;</td></tr><tr><td>tf.neg(x, name=None)</td><td>&#x53D6;&#x8D1F; (y = -x)</td></tr><tr><td>tf.sign(x, name=None)</td><td>&#x8FD4;&#x56DE;&#x7B26;&#x53F7; y = sign(x) = -1 if x &lt; 0; 0 if x == 0; 1 if x &gt; 0.</td></tr><tr><td>tf.inv(x, name=None)</td><td>&#x53D6;&#x53CD;</td></tr><tr><td><strong>tf.square(x, name=None)</strong></td><td>&#x8BA1;&#x7B97;&#x5E73;&#x65B9; (y = x * x = x^2)</td></tr><tr><td>tf.round(x, name=None)</td><td>&#x820D;&#x5165;&#x6700;&#x63A5;&#x8FD1;&#x7684;&#x6574;&#x6570; <br> #&#x2018;a&#x2019; is [0.9, 2.5, 2.3, -4.4]<br> tf.round(a) ==&gt; [ 1.0, 3.0, 2.0, -4.0 ]</td></tr><tr><td>tf.sqrt(x, name=None)</td><td>&#x5F00;&#x6839;&#x53F7;</td></tr><tr><td>tf.pow(x, y, name=None)</td><td>&#x5E42;&#x6B21;&#x65B9;<br>tensor &#x2018;x&#x2019; is [[2, 2], [3, 3]]<br>tensor &#x2018;y&#x2019; is [[8, 16], [2, 3]]<br> tf.pow(x, y) ==&gt; [[256, 65536], [9, 27]]</td></tr><tr><td>tf.exp(x, name=None)</td><td>&#x8BA1;&#x7B97;e&#x7684;&#x6B21;&#x65B9;</td></tr><tr><td>tf.log(x, name=None)</td><td>&#x8BA1;&#x7B97;log&#xFF0C;&#x4E00;&#x4E2A;&#x8F93;&#x5165;&#x8BA1;&#x7B97;e&#x7684;ln&#xFF0C;&#x4E24;&#x8F93;&#x5165;&#x4EE5;&#x7B2C;&#x4E8C;&#x8F93;&#x5165;&#x4E3A;&#x5E95;</td></tr><tr><td>tf.maximum(x, y, name=None)</td><td>&#x8FD4;&#x56DE;&#x6700;&#x5927;&#x503C; (x &gt; y ? x : y)</td></tr><tr><td>tf.minimum(x, y, name=None)</td><td>&#x8FD4;&#x56DE;&#x6700;&#x5C0F;&#x503C; (x &lt; y ? x : y)</td></tr><tr><td>tf.cos(x, name=None)</td><td>&#x4E09;&#x89D2;&#x51FD;&#x6570;cos</td></tr><tr><td>tf.sin(x, name=None)</td><td>&#x4E09;&#x89D2;&#x51FD;&#x6570;sin</td></tr><tr><td>tf.tan(x, name=None)</td><td>&#x4E09;&#x89D2;&#x51FD;&#x6570;tan</td></tr><tr><td>tf.atan(x, name=None)</td><td>&#x4E09;&#x89D2;&#x51FD;&#x6570;ctan</td></tr></tbody></table><p>###reduce &#x8FD0;&#x7B97;</p><table><thead><tr><th>&#x51FD;&#x6570;</th><th>&#x529F;&#x80FD;</th></tr></thead><tbody><tr><td>tf.reduce_sum (input_tensor,axis=None,keepdims=None,name=None,     reduction_indices=None,keep_dims=None)</td><td>&#x6C42;&#x548C;</td></tr><tr><td>tf.reduce_mean (input_tensor,axis=None,keepdims=None,name=None,     reduction_indices=None,keep_dims=None)</td><td>&#x6C42;&#x5E73;&#x5747;</td></tr><tr><td>tf.reduce_min (input_tensor,axis=None,keepdims=None,name=None,     reduction_indices=None,keep_dims=None)</td><td>&#x6700;&#x5C0F;&#x503C;</td></tr><tr><td>tf.reduce_max (input_tensor,axis=None,keepdims=None,name=None,  reduction_indices=None,keep_dims=None)</td><td>&#x6700;&#x5927;&#x503C;</td></tr><tr><td>tf.reduce_join (inputs,axis=None,keep_dims=False,separator=&#x2019;&#x2019;,name=None,     reduction_indices=None)</td><td>&#x8FDE;&#x63A5;</td></tr><tr><td>tf.reduce_all (input_tensor,axis=None,keepdims=None,name=None,     reduction_indices=None,keep_dims=None)</td><td>&#x4E0E;&#x64CD;&#x4F5C;</td></tr><tr><td>tf.reduce_any (input_tensor,axis=None,keepdims=None,name=None,     reduction_indices=None,keep_dims=None )</td><td>&#x6216;&#x64CD;&#x4F5C;</td></tr><tr><td>tf.reduce_logsumexp(input_tensor,axis=None,keepdims=None,name=None,     reduction_indices=None,keep_dims=None )</td><td>log(sum(exp))</td></tr></tbody></table><figure class="highlight"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br></pre></td><td class="code"><pre><span class="line">x = tf.constant([[<span class="number">1</span>, <span class="number">1</span>, <span class="number">1</span>], [<span class="number">1</span>, <span class="number">1</span>, <span class="number">1</span>]])</span><br><span class="line">tf.reduce_sum(x)  <span class="comment"># 6</span></span><br><span class="line">tf.reduce_sum(x, <span class="number">0</span>)  <span class="comment"># [2, 2, 2]</span></span><br><span class="line">tf.reduce_sum(x, <span class="number">1</span>)  <span class="comment"># [3, 3]</span></span><br><span class="line">tf.reduce_sum(x, <span class="number">1</span>, keepdims=<span class="keyword">True</span>)  <span class="comment"># [[3], [3]]</span></span><br><span class="line">tf.reduce_sum(x, [<span class="number">0</span>, <span class="number">1</span>])  <span class="comment"># 6</span></span><br><span class="line"></span><br><span class="line">x = tf.constant([[<span class="number">1.</span>, <span class="number">1.</span>], [<span class="number">2.</span>, <span class="number">2.</span>]])</span><br><span class="line">tf.reduce_mean(x)  <span class="comment"># 1.5</span></span><br><span class="line">tf.reduce_mean(x, <span class="number">0</span>)  <span class="comment"># [1.5, 1.5]</span></span><br><span class="line">tf.reduce_mean(x, <span class="number">1</span>)  <span class="comment"># [1.,  2.]</span></span><br><span class="line"></span><br><span class="line"><span class="comment"># tensor `a` is [[&quot;a&quot;, &quot;b&quot;], [&quot;c&quot;, &quot;d&quot;]]</span></span><br><span class="line">tf.reduce_join(a, 0) ==&gt; [&quot;ac&quot;, &quot;bd&quot;]</span><br><span class="line">tf.reduce_join(a, 1) ==&gt; [&quot;ab&quot;, &quot;cd&quot;]</span><br><span class="line">tf.reduce_join(a, -2) = tf.reduce_join(a, 0) ==&gt; [&quot;ac&quot;, &quot;bd&quot;]</span><br><span class="line">tf.reduce_join(a, -1) = tf.reduce_join(a, 1) ==&gt; [&quot;ab&quot;, &quot;cd&quot;]</span><br><span class="line">tf.reduce_join(a, 0, keep_dims=True) ==&gt; [[&quot;ac&quot;, &quot;bd&quot;]]</span><br><span class="line">tf.reduce_join(a, 1, keep_dims=True) ==&gt; [[&quot;ab&quot;], [&quot;cd&quot;]]</span><br><span class="line">tf.reduce_join(a, 0, separator=&quot;.&quot;) ==&gt; [&quot;a.c&quot;, &quot;b.d&quot;]</span><br><span class="line">tf.reduce_join(a, [0, 1]) ==&gt; &quot;acbd&quot;</span><br><span class="line">tf.reduce_join(a, [1, 0]) ==&gt; &quot;abcd&quot;</span><br><span class="line">tf.reduce_join(a, []) ==&gt; [[&quot;a&quot;, &quot;b&quot;], [&quot;c&quot;, &quot;d&quot;]]</span><br><span class="line">tf.reduce_join(a) = tf.reduce_join(a, [1, 0]) ==&gt; &quot;abcd&quot;</span><br></pre></td></tr></tbody></table></figure><h2 id="&#x5F20;&#x91CF;&#x64CD;&#x4F5C;"><a href="#&#x5F20;&#x91CF;&#x64CD;&#x4F5C;" class="headerlink" title="&#x5F20;&#x91CF;&#x64CD;&#x4F5C;"></a>&#x5F20;&#x91CF;&#x64CD;&#x4F5C;</h2><h3 id="&#x6570;&#x636E;&#x7C7B;&#x578B;&#x8F6C;&#x6362;"><a href="#&#x6570;&#x636E;&#x7C7B;&#x578B;&#x8F6C;&#x6362;" class="headerlink" title="&#x6570;&#x636E;&#x7C7B;&#x578B;&#x8F6C;&#x6362;"></a>&#x6570;&#x636E;&#x7C7B;&#x578B;&#x8F6C;&#x6362;</h3><table><thead><tr><th>&#x51FD;&#x6570;</th><th>&#x529F;&#x80FD;</th></tr></thead><tbody><tr><td>tf.string_to_number(string_tensor, out_type=None, name=None)</td><td>&#x5B57;&#x7B26;&#x4E32;&#x8F6C;&#x4E3A;&#x6570;&#x5B57;</td></tr><tr><td>tf.to_double(x, name=&#x2019;ToDouble&#x2019;)<br> tf.to_float(x, name=&#x2019;ToFloat&#x2019;)<br> tf.to_int32(x, name=&#x2019;ToInt32&#x2019;)<br> tf.to_int64(x, name=&#x2019;ToInt64&#x2019;)</td><td>&#x8F6C;&#x4E3A;&#x76F8;&#x5E94;&#x6570;&#x5B57;&#x7C7B;&#x578B;</td></tr><tr><td><strong>tf.cast(x, dtype, name=None)</strong></td><td>&#x5C06;x&#x6216;&#x8005;x.values&#x8F6C;&#x6362;&#x4E3A;dtype</td></tr></tbody></table><figure class="highlight python"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br></pre></td><td class="code"><pre><span class="line">x = tf.constant([<span class="number">1.8</span>, <span class="number">2.2</span>], dtype=tf.float32)</span><br><span class="line">tf.cast(x, tf.int32)  <span class="comment"># [1, 2], dtype=tf.int32</span></span><br></pre></td></tr></tbody></table></figure><h3 id="&#x5F62;&#x72B6;&#x64CD;&#x4F5C;"><a href="#&#x5F62;&#x72B6;&#x64CD;&#x4F5C;" class="headerlink" title="&#x5F62;&#x72B6;&#x64CD;&#x4F5C;"></a>&#x5F62;&#x72B6;&#x64CD;&#x4F5C;</h3><table><thead><tr><th>&#x51FD;&#x6570;</th><th>&#x529F;&#x80FD;</th></tr></thead><tbody><tr><td>tf.shape(input, name=None)</td><td>&#x8FD4;&#x56DE;&#x6570;&#x636E;&#x7684;shape</td></tr><tr><td>tf.size(input, name=None)</td><td>&#x8FD4;&#x56DE;&#x6570;&#x636E;&#x7684;&#x5143;&#x7D20;&#x6570;&#x91CF;</td></tr><tr><td>tf.rank(input, name=None)</td><td>&#x8FD4;&#x56DE;&#x5F20;&#x91CF;&#x7684;&#x79E9;&#x3002;<br> &#x6CE8;&#x610F;&#xFF1A;&#x5F20;&#x91CF;&#x7684;&#x79E9;&#x4E0E;&#x77E9;&#x9635;&#x7684;&#x79E9;&#x4E0D;&#x4E00;&#x6837;&#x3002;<br>&#x6307;&#x80FD;&#x591F;&#x552F;&#x4E00;&#x786E;&#x5B9A;&#x5F20;&#x91CF;&#x5143;&#x7D20;&#x7684;&#x6700;&#x5C0F;&#x7D22;&#x5F15;&#x6570;<br>&#x79E9;&#x4E5F;&#x88AB;&#x79F0;&#x4E3A; &#x201C;order&#x201D;&#xFF0C;&#x201C;degree&#x201D; &#x6216; &#x201C;ndims&#x201D;&#x3002;</td></tr><tr><td><strong>tf.reshape(tensor, shape, name=None)</strong></td><td>&#x53D8;&#x5F62;<br>&#x5982;&#x679C;shape&#x7684;&#x4E00;&#x4E2A;&#x5206;&#x91CF;&#x662F;&#x7279;&#x6B8A;&#x503C;-1&#xFF0C;<br>&#x5219;&#x8BA1;&#x7B97;&#x8BE5;&#x7EF4;&#x5EA6;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x4EE5;&#x4F7F;&#x603B;&#x5927;&#x5C0F;&#x4FDD;&#x6301;&#x4E0D;&#x53D8;&#x3002;<br>&#x81F3;&#x591A;&#x80FD;&#x6709;&#x4E00;&#x4E2A;shape&#x7684;&#x5206;&#x91CF;&#x53EF;&#x4EE5;&#x662F;-1&#x3002;</td></tr></tbody></table><figure class="highlight python"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br></pre></td><td class="code"><pre><span class="line">t = tf.constant([[[<span class="number">1</span>, <span class="number">1</span>, <span class="number">1</span>], [<span class="number">2</span>, <span class="number">2</span>, <span class="number">2</span>]], [[<span class="number">3</span>, <span class="number">3</span>, <span class="number">3</span>], [<span class="number">4</span>, <span class="number">4</span>, <span class="number">4</span>]]])</span><br><span class="line">tf.shape(t)  <span class="comment"># [2, 2, 3]</span></span><br><span class="line"></span><br><span class="line">t = tf.constant([[[<span class="number">1</span>, <span class="number">1</span>, <span class="number">1</span>], [<span class="number">2</span>, <span class="number">2</span>, <span class="number">2</span>]], [[<span class="number">3</span>, <span class="number">3</span>, <span class="number">3</span>], [<span class="number">4</span>, <span class="number">4</span>, <span class="number">4</span>]]])</span><br><span class="line">tf.size(t)  <span class="comment"># 12</span></span><br><span class="line"></span><br><span class="line"><span class="comment"># shape of tensor &apos;t&apos; is [2, 2, 3]</span></span><br><span class="line">t = tf.constant([[[<span class="number">1</span>, <span class="number">1</span>, <span class="number">1</span>], [<span class="number">2</span>, <span class="number">2</span>, <span class="number">2</span>]], [[<span class="number">3</span>, <span class="number">3</span>, <span class="number">3</span>], [<span class="number">4</span>, <span class="number">4</span>, <span class="number">4</span>]]])</span><br><span class="line">tf.rank(t)  <span class="comment"># 3</span></span><br><span class="line"></span><br><span class="line"><span class="comment"># tensor &apos;t&apos; is [[[1, 1, 1],</span></span><br><span class="line"><span class="comment">#                 [2, 2, 2]],</span></span><br><span class="line"><span class="comment">#                [[3, 3, 3],</span></span><br><span class="line"><span class="comment">#                 [4, 4, 4]],</span></span><br><span class="line"><span class="comment">#                [[5, 5, 5],</span></span><br><span class="line"><span class="comment">#                 [6, 6, 6]]]</span></span><br><span class="line"><span class="comment"># tensor &apos;t&apos; has shape [3, 2, 3]</span></span><br><span class="line"><span class="comment"># pass &apos;[-1]&apos; to flatten &apos;t&apos;</span></span><br><span class="line">tf.reshape(t, [-1]) ==&gt; [1, 1, 1, 2, 2, 2, 3, 3, 3, 4, 4, 4, 5, 5, 5, 6, 6, 6]</span><br><span class="line">tf.reshape(t, [2, -1]) ==&gt; [[1, 1, 1, 2, 2, 2, 3, 3, 3],</span><br><span class="line">                         [<span class="number">4</span>, <span class="number">4</span>, <span class="number">4</span>, <span class="number">5</span>, <span class="number">5</span>, <span class="number">5</span>, <span class="number">6</span>, <span class="number">6</span>, <span class="number">6</span>]]</span><br></pre></td></tr></tbody></table></figure><h3 id="&#x5207;&#x7247;&#x4E0E;&#x5408;&#x5E76;"><a href="#&#x5207;&#x7247;&#x4E0E;&#x5408;&#x5E76;" class="headerlink" title="&#x5207;&#x7247;&#x4E0E;&#x5408;&#x5E76;"></a>&#x5207;&#x7247;&#x4E0E;&#x5408;&#x5E76;</h3><table><thead><tr><th>&#x51FD;&#x6570;</th><th>&#x529F;&#x80FD;</th></tr></thead><tbody><tr><td>tf.slice(input_, begin, size, name=None)</td><td>&#x5BF9;tensor&#x8FDB;&#x884C;&#x5207;&#x7247;&#x64CD;&#x4F5C;</td></tr><tr><td><strong>tf.split(value,num_or_size_splits,axis=0,num=None,name=&#x2019;split&#x2019; )</strong></td><td>&#x5BF9;tensor&#x8FDB;&#x884C;&#x5206;&#x89E3;&#x64CD;&#x4F5C;</td></tr><tr><td><strong>tf.concat(values,axis,name=&#x2019;concat&#x2019;)</strong></td><td>&#x5BF9;tensor&#x8FDB;&#x884C;&#x62FC;&#x63A5;&#x64CD;&#x4F5C;</td></tr><tr><td>tf.transpose(a,perm=None,name=&#x2019;transpose&#x2019;,conjugate=False)</td><td>&#x5BF9;tensor&#x8FDB;&#x884C;&#x8F6C;&#x7F6E;&#x64CD;&#x4F5C;</td></tr><tr><td>tf.gather(params,indices,validate_indices=None,name=None,axis=0 )</td><td>&#x5C06;&#x6307;&#x5B9A;&#x7D22;&#x5F15;&#x5207;&#x7247;&#x5408;&#x5E76;&#x6210;&#x65B0;&#x7684;&#x5F20;&#x91CF;</td></tr><tr><td>tf.one_hot(indices,depth,on_value=None,off_value=None,axis=None,     dtype=None, name=None )</td><td>&#x8FD4;&#x56DE;&#x4E00;&#x4E2A; one-hot &#x5F20;&#x91CF;</td></tr></tbody></table><figure class="highlight python"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br><span class="line">43</span><br><span class="line">44</span><br><span class="line">45</span><br><span class="line">46</span><br><span class="line">47</span><br><span class="line">48</span><br></pre></td><td class="code"><pre><span class="line">t = tf.constant([[[<span class="number">1</span>, <span class="number">1</span>, <span class="number">1</span>], [<span class="number">2</span>, <span class="number">2</span>, <span class="number">2</span>]],</span><br><span class="line">                 [[<span class="number">3</span>, <span class="number">3</span>, <span class="number">3</span>], [<span class="number">4</span>, <span class="number">4</span>, <span class="number">4</span>]],</span><br><span class="line">                 [[<span class="number">5</span>, <span class="number">5</span>, <span class="number">5</span>], [<span class="number">6</span>, <span class="number">6</span>, <span class="number">6</span>]]])</span><br><span class="line">tf.slice(t, [<span class="number">1</span>, <span class="number">0</span>, <span class="number">0</span>], [<span class="number">1</span>, <span class="number">1</span>, <span class="number">3</span>])  <span class="comment"># [[[3, 3, 3]]]</span></span><br><span class="line">tf.slice(t, [<span class="number">1</span>, <span class="number">0</span>, <span class="number">0</span>], [<span class="number">1</span>, <span class="number">2</span>, <span class="number">3</span>])  <span class="comment"># [[[3, 3, 3],</span></span><br><span class="line">                                   <span class="comment">#   [4, 4, 4]]]</span></span><br><span class="line">tf.slice(t, [<span class="number">1</span>, <span class="number">0</span>, <span class="number">0</span>], [<span class="number">2</span>, <span class="number">1</span>, <span class="number">3</span>])  <span class="comment"># [[[3, 3, 3]],</span></span><br><span class="line">                                   <span class="comment">#  [[5, 5, 5]]]</span></span><br><span class="line"></span><br><span class="line"><span class="comment"># &apos;value&apos; is a tensor with shape [5, 30]</span></span><br><span class="line"><span class="comment"># Split &apos;value&apos; into 3 tensors with sizes [4, 15, 11] along dimension 1</span></span><br><span class="line">split0, split1, split2 = tf.split(value, [<span class="number">4</span>, <span class="number">15</span>, <span class="number">11</span>], <span class="number">1</span>)</span><br><span class="line">tf.shape(split0)  <span class="comment"># [5, 4]</span></span><br><span class="line">tf.shape(split1)  <span class="comment"># [5, 15]</span></span><br><span class="line">tf.shape(split2)  <span class="comment"># [5, 11]</span></span><br><span class="line"><span class="comment"># Split &apos;value&apos; into 3 tensors along dimension 1</span></span><br><span class="line">split0, split1, split2 = tf.split(value, num_or_size_splits=<span class="number">3</span>, axis=<span class="number">1</span>)</span><br><span class="line">tf.shape(split0)  <span class="comment"># [5, 10]</span></span><br><span class="line"></span><br><span class="line">t1 = [[<span class="number">1</span>, <span class="number">2</span>, <span class="number">3</span>], [<span class="number">4</span>, <span class="number">5</span>, <span class="number">6</span>]]</span><br><span class="line">t2 = [[<span class="number">7</span>, <span class="number">8</span>, <span class="number">9</span>], [<span class="number">10</span>, <span class="number">11</span>, <span class="number">12</span>]]</span><br><span class="line">tf.concat([t1, t2], <span class="number">0</span>)  <span class="comment"># [[1, 2, 3], [4, 5, 6], [7, 8, 9], [10, 11, 12]]</span></span><br><span class="line">tf.concat([t1, t2], <span class="number">1</span>)  <span class="comment"># [[1, 2, 3, 7, 8, 9], [4, 5, 6, 10, 11, 12]]</span></span><br><span class="line"><span class="comment"># tensor t3 with shape [2, 3]</span></span><br><span class="line"><span class="comment"># tensor t4 with shape [2, 3]</span></span><br><span class="line">tf.shape(tf.concat([t3, t4], <span class="number">0</span>))  <span class="comment"># [4, 3]</span></span><br><span class="line">tf.shape(tf.concat([t3, t4], <span class="number">1</span>))  <span class="comment"># [2, 6]</span></span><br><span class="line"></span><br><span class="line">x = tf.constant([[<span class="number">1</span>, <span class="number">2</span>, <span class="number">3</span>], [<span class="number">4</span>, <span class="number">5</span>, <span class="number">6</span>]])</span><br><span class="line">tf.transpose(x)  <span class="comment"># [[1, 4]</span></span><br><span class="line">                 <span class="comment">#  [2, 5]</span></span><br><span class="line">                 <span class="comment">#  [3, 6]]</span></span><br><span class="line">    </span><br><span class="line">indices = [<span class="number">0</span>, <span class="number">1</span>, <span class="number">2</span>]</span><br><span class="line">depth = <span class="number">3</span></span><br><span class="line">tf.one_hot(indices, depth)  <span class="comment"># output: [3 x 3]</span></span><br><span class="line"><span class="comment"># [[1., 0., 0.],</span></span><br><span class="line"><span class="comment">#  [0., 1., 0.],</span></span><br><span class="line"><span class="comment">#  [0., 0., 1.]]</span></span><br><span class="line">indices = [<span class="number">0</span>, <span class="number">2</span>, <span class="number">-1</span>, <span class="number">1</span>]</span><br><span class="line">depth = <span class="number">3</span></span><br><span class="line">tf.one_hot(indices, depth,</span><br><span class="line">           on_value=<span class="number">5.0</span>, off_value=<span class="number">0.0</span>,</span><br><span class="line">           axis=<span class="number">-1</span>)  <span class="comment"># output: [4 x 3]</span></span><br><span class="line"><span class="comment"># [[5.0, 0.0, 0.0],  # one_hot(0)</span></span><br><span class="line"><span class="comment">#  [0.0, 0.0, 5.0],  # one_hot(2)</span></span><br><span class="line"><span class="comment">#  [0.0, 0.0, 0.0],  # one_hot(-1)</span></span><br><span class="line"><span class="comment">#  [0.0, 5.0, 0.0]]  # one_hot(1)</span></span><br></pre></td></tr></tbody></table></figure><h3 id="&#x7D22;&#x5F15;&#x63D0;&#x53D6;"><a href="#&#x7D22;&#x5F15;&#x63D0;&#x53D6;" class="headerlink" title="&#x7D22;&#x5F15;&#x63D0;&#x53D6;"></a>&#x7D22;&#x5F15;&#x63D0;&#x53D6;</h3><table><thead><tr><th>&#x51FD;&#x6570;</th><th>&#x529F;&#x80FD;</th></tr></thead><tbody><tr><td><strong>tf.argmin(input,axis=None,name=None,dimension=None,output_type=tf.int64)</strong></td><td>&#x6700;&#x5C0F;&#x503C;&#x7D22;&#x5F15;</td></tr><tr><td><strong>tf.argmax(input,axis=None,name=None,dimension=None,output_type=tf.int64)</strong></td><td>&#x6700;&#x5927;&#x503C;&#x7D22;&#x5F15;</td></tr><tr><td>tf.unique(x,out_idx=tf.int32,name=None )</td><td>1-D&#x5F20;&#x91CF;&#x4E0D;&#x540C;&#x503C;</td></tr></tbody></table><figure class="highlight"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br></pre></td><td class="code"><pre><span class="line"><span class="comment"># tensor &apos;x&apos; is [1, 1, 2, 4, 4, 4, 7, 8, 8]</span></span><br><span class="line">y, idx = unique(x)</span><br><span class="line">y ==&gt; [1, 2, 4, 7, 8]</span><br><span class="line">idx ==&gt; [0, 0, 1, 2, 2, 2, 3, 4, 4]</span><br></pre></td></tr></tbody></table></figure><h2 id="&#x795E;&#x7ECF;&#x7F51;&#x7EDC;-nn&#x6A21;&#x5757;"><a href="#&#x795E;&#x7ECF;&#x7F51;&#x7EDC;-nn&#x6A21;&#x5757;" class="headerlink" title="&#x795E;&#x7ECF;&#x7F51;&#x7EDC; .nn&#x6A21;&#x5757;"></a>&#x795E;&#x7ECF;&#x7F51;&#x7EDC; <a href="https://www.tensorflow.org/versions/r1.12/api_guides/python/nn" target="_blank" rel="noopener">.nn&#x6A21;&#x5757;</a></h2><p>###&#x6FC0;&#x6D3B;&#x51FD;&#x6570; Activation Functions</p><table><thead><tr><th>&#x51FD;&#x6570;</th><th>&#x529F;&#x80FD;</th></tr></thead><tbody><tr><td><strong>tf.nn.relu(features,name=None )</strong><br>tf.nn.relu6(features,name=None )<br>tf.nn.relu_layer(x,weights, biases,name=None )</td><td>max(features,0)<br> min(max(features, 0), 6)<br> Relu(x * weight + biases)</td></tr><tr><td>tf.nn.elu(features,name=None)</td><td>exp(features)-1 if &lt; 0, features otherwise.</td></tr><tr><td><strong>tf.nn.sigmoid(x,name=None)</strong></td><td>y = 1 / (1 + exp(-x))</td></tr><tr><td><strong>tf.nn.tanh(x,name=None )</strong></td><td>&#x53CC;&#x66F2;&#x6B63;&#x5207;&#x6FC0;&#x6D3B;&#x51FD;&#x6570;</td></tr><tr><td>tf.math.softplus(features,name=None)</td><td>log(exp(features) + 1)</td></tr><tr><td>tf.nn.softsign(features,name=None)</td><td>features / (abs(features) + 1)</td></tr><tr><td>tf.nn.dropout(x,keep_prob,noise_shape=None,seed=None,     name=None )</td><td>&#x72EC;&#x7ACB;&#x7684;&#xFF0C;&#x5143;&#x7D20;&#x653E;&#x5927;(1-keep_prob)&#x6216;&#x8005;&#x53D8;&#x4E3A;0&#x3002;&#x7528;&#x4E8E;&#x9632;&#x6B62;&#x8FC7;&#x62DF;&#x5408;</td></tr><tr><td>tf.nn.bias_add(value,bias,data_format=None,name=None )</td><td>Adds bias  to value</td></tr></tbody></table><p>###&#x5377;&#x79EF;&#x51FD;&#x6570; Convolution</p><table><thead><tr><th>&#x51FD;&#x6570;</th><th>&#x529F;&#x80FD;</th></tr></thead><tbody><tr><td>tf.nn.conv2d<br>tf.nn.conv1d<br>tf.nn.conv3d</td><td>&#x5377;&#x79EF;&#x64CD;&#x4F5C;&#xFF0C;&#x8DDF;&#x591A;&#x89C1;&#x5B98;&#x7F51;</td></tr></tbody></table><p>###&#x6570;&#x636E;&#x6807;&#x51C6;&#x5316; Normalization</p><p>&#x5F53;&#x8F93;&#x5165;&#x5177;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x6BD4;&#x4F8B;&#x65F6;&#xFF0C;&#x5F52;&#x4E00;&#x5316;&#x53EF;&#x7528;&#x4E8E;&#x9632;&#x6B62;&#x795E;&#x7ECF;&#x5143;&#x9971;&#x548C;&#xFF0C;&#x5E76;&#x6709;&#x52A9;&#x4E8E;&#x4E00;&#x822C;&#x5316;&#x3002;</p><table><thead><tr><th>&#x51FD;&#x6570;</th><th>&#x529F;&#x80FD;</th></tr></thead><tbody><tr><td>tf.math.l2_normalize <br>tf.linalg.l2_normalize<br>tf.nn.l2_normalize(x,axis=None,epsilon=1e-12,name=None,dim=None )<br></td><td>&#x5BF9;&#x7EF4;&#x5EA6;dim&#x8FDB;&#x884C;L2&#x8303;&#x5F0F;&#x6807;&#x51C6;&#x5316;<br>output = x/sqrt(max(sum(x**2), epsilon))</td></tr><tr><td>tf.nn.moments(x,axes,shift=None,name=None,     keep_dims=False )</td><td>&#x8FD4;&#x56DE;2&#x4E2A;&#x5F20;&#x91CF;&#xFF1A;&#x5747;&#x503C;&#x548C;&#x65B9;&#x5DEE;</td></tr><tr><td>tf.nn.sufficient_statistics(x,axes,shift=None,keep_dims=False,     name=None )</td><td>&#x8BA1;&#x7B97;&#x4E0E;&#x5747;&#x503C;&#x548C;&#x65B9;&#x5DEE;&#x6709;&#x5173;&#x7684;&#x5B8C;&#x5168;&#x7EDF;&#x8BA1;&#x91CF;<br>&#x8FD4;&#x56DE;4&#x7EF4;&#x5143;&#x7EC4;,&#x5143;&#x7D20;&#x4E2A;&#x6570;&#xFF0C;&#x5143;&#x7D20;&#x603B;&#x548C;&#xFF0C;&#x5143;&#x7D20;&#x7684;&#x5E73;&#x65B9;&#x548C;&#xFF0C;shift&#x7ED3;&#x679C;</td></tr><tr><td>tf.nn.local_response_normalization<br>tf.nn.normalize_moments<br>tf.nn.weighted_moments<br>tf.nn.fused_batch_norm<br>tf.nn.batch_normalization<br>tf.nn.batch_norm_with_global_normalization</td><td>&#x5177;&#x4F53;&#x89C1;&#x5B98;&#x7F51;</td></tr></tbody></table><p>###&#x635F;&#x5931;&#x51FD;&#x6570; Losses</p><p>&#x635F;&#x5931;&#x64CD;&#x4F5C;&#x6D4B;&#x91CF;&#x4E24;&#x4E2A;&#x5F20;&#x91CF;&#x4E4B;&#x95F4;&#x6216;&#x5F20;&#x91CF;&#x548C;&#x96F6;&#x4E4B;&#x95F4;&#x7684;&#x8BEF;&#x5DEE;&#x3002; &#x8FD9;&#x53EF;&#x7528;&#x4E8E;&#x5728;&#x56DE;&#x5F52;&#x4EFB;&#x52A1;&#x4E2D;&#x6D4B;&#x91CF;&#x7F51;&#x7EDC;&#x7684;&#x51C6;&#x786E;&#x6027;&#x6216;&#x7528;&#x4E8E;&#x6B63;&#x5219;&#x5316;&#x76EE;&#x7684;&#xFF08;&#x6743;&#x91CD;&#x8870;&#x51CF;&#xFF09;&#x3002;</p><table><thead><tr><th>&#x51FD;&#x6570;</th><th>&#x529F;&#x80FD;</th></tr></thead><tbody><tr><td>tf.nn.l2_loss(t,name=None)</td><td>output = sum(t ** 2) / 2</td></tr><tr><td>tf.nn.log_poisson_loss(targets, log_input,compute_full_loss=False,     name=None )</td><td>&#x8BA1;&#x7B97;&#x7ED9;&#x5B9A; log_input&#x7684;&#x5BF9;&#x6570;&#x6CCA;&#x677E;&#x635F;&#x5931;</td></tr></tbody></table><p>###&#x5206;&#x7C7B;&#x51FD;&#x6570; Classification</p><p>&#x8FD9;&#x90E8;&#x5206;&#x51FD;&#x6570;&#x987A;&#x4FBF;&#x90FD;&#x5C06;&#x5404;&#x4E2A;&#x6837;&#x672C;&#x7684;&#x4EA4;&#x53C9;&#x71B5;&#x90FD;&#x7B97;&#x5B8C;&#x4E86;~~</p><table><thead><tr><th>&#x51FD;&#x6570;</th><th>&#x529F;&#x80FD;</th></tr></thead><tbody><tr><td><strong>tf.nn.sigmoid_cross_entropy_with_logits</strong>(<br> _sentinel=None,  <br> labels=None,   <br> logits=None,     <br> name=None )</td><td>&#x8BA1;&#x7B97; sigmoid&#x7684;&#x4EA4;&#x53C9;&#x71B5;<br>x = logits, z = labels<br>max(x, 0) - x * z + log(1 + exp(-abs(x)))<br>labels&#x4E00;&#x822C;&#x4E3A;one-hot&#x5F62;&#x5F0F;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x6982;&#x7387;&#x5206;&#x5E03;<br>logits&#x4E3A;&#x7F51;&#x7EDC;&#x83B7;&#x5F97;&#x7684;&#x7ED3;&#x679C;</td></tr><tr><td>tf.nn.softmax(    <br> logits,     <br> axis=None,   <br> name=None,   <br> dim=None )</td><td>softmax = exp(logits)/sum(exp(logits), axis)<br>&#x8BA1;&#x7B97;&#x5404;&#x81EA;&#x6982;&#x7387;</td></tr><tr><td>tf.nn.log_softmax(   <br>  logits,   <br>  axis=None,   <br>  name=None,  <br>  dim=None )</td><td>logsoftmax = logits - log(sum(exp(logits), axis))</td></tr><tr><td><strong>tf.nn.softmax_cross_entropy_with_logits_v2</strong>(<br>  _sentinel=None,   <br>  labels=None,   <br>  logits=None,   <br>  dim=-1,   <br>  name=None )</td><td>&#x8BA1;&#x7B97;softmax&#x7684;&#x4EA4;&#x53C9;&#x71B5;<br>&#x6CE8;&#x610F;&#x4E0D;&#x9700;&#x8981;&#x5728;&#x5916;&#x90E8;&#x5BF9;logits&#x8FDB;&#x884C;softmax&#x64CD;&#x4F5C;&#xFF01;</td></tr><tr><td>tf.nn.sparse_softmax_cross_entropy_with_logits</td><td>&#x8BA1;&#x7B97;&#x7A00;&#x758F;softmax&#x4EA4;&#x53C9;&#x71B5;</td></tr><tr><td>tf.nn.weighted_cross_entropy_with_logits</td><td>&#x8BA1;&#x7B97;&#x52A0;&#x6743;&#x4EA4;&#x53C9;&#x71B5;</td></tr></tbody></table><h3 id="&#x7B26;&#x53F7;&#x5D4C;&#x5165;-Embeddings"><a href="#&#x7B26;&#x53F7;&#x5D4C;&#x5165;-Embeddings" class="headerlink" title="&#x7B26;&#x53F7;&#x5D4C;&#x5165; Embeddings"></a>&#x7B26;&#x53F7;&#x5D4C;&#x5165; Embeddings</h3><p>&#x591A;&#x7528;&#x4E8E;&#x8BCD;&#x5D4C;&#x5165;</p><table><thead><tr><th>&#x51FD;&#x6570;</th><th>&#x529F;&#x80FD;</th></tr></thead><tbody><tr><td><strong>tf.nn.embedding_lookup</strong>(    <br> params,   <br> ids,  <br> partition_strategy=&#x2019;mod&#x2019;,   <br> name=None,   <br> validate_indices=True,   <br> max_norm=None )</td><td>Looks up ids in a list of embedding tensors.<br>&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;tf.gather&#x7684;&#x4E00;&#x79CD;&#x5E94;&#x7528;&#x3002;</td></tr><tr><td>tf.nn.embedding_lookup_sparse(   <br>  params,  <br>  sp_ids,   <br>  sp_weights,    <br>  partition_strategy=&#x2019;mod&#x2019;,   <br>  name=None,   <br>  combiner=None,   <br>  max_norm=None )</td><td>Computes embeddings for the given ids and weights.</td></tr></tbody></table><h3 id="&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;-RNN"><a href="#&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;-RNN" class="headerlink" title="&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC; RNN"></a>&#x5FAA;&#x73AF;&#x795E;&#x7ECF;&#x7F51;&#x7EDC; RNN</h3><p>.nn&#x6A21;&#x5757;&#x53EA;&#x6709;&#x4E00;&#x90E8;&#x5206;rnn&#x529F;&#x80FD;&#x3002;&#x66F4;&#x5168;&#x7684;&#x529F;&#x80FD;&#x8BE6;&#x89C1;tf.contrib.rnn&#x6A21;&#x5757;<del>~</del>~~~~</p><h3 id="&#x5019;&#x9009;&#x91C7;&#x6837;-Candidate-Sampling"><a href="#&#x5019;&#x9009;&#x91C7;&#x6837;-Candidate-Sampling" class="headerlink" title="&#x5019;&#x9009;&#x91C7;&#x6837; Candidate Sampling"></a>&#x5019;&#x9009;&#x91C7;&#x6837; Candidate Sampling</h3><p>&#x5BF9;&#x4E8E;&#x6709;&#x5DE8;&#x5927;&#x91CF;&#x7684;&#x591A;&#x5206;&#x7C7B;&#x4E0E;&#x591A;&#x6807;&#x7B7E;&#x6A21;&#x578B;&#xFF0C;&#x5982;&#x679C;&#x4F7F;&#x7528;&#x5168;&#x8FDE;&#x63A5;softmax&#x5C06;&#x4F1A;&#x5360;&#x7528;&#x5927;&#x91CF;&#x7684;&#x65F6;&#x95F4;&#x4E0E;&#x7A7A;&#x95F4;&#x8D44;&#x6E90;&#xFF0C;&#x6240;&#x4EE5;&#x91C7;&#x7528;&#x5019;&#x9009;&#x91C7;&#x6837;&#x65B9;&#x6CD5;&#x4EC5;&#x4F7F;&#x7528;&#x4E00;&#x5C0F;&#x90E8;&#x5206;&#x7C7B;&#x522B;&#x4E0E;&#x6807;&#x7B7E;&#x4F5C;&#x4E3A;&#x76D1;&#x7763;&#x4EE5;&#x52A0;&#x901F;&#x8BAD;&#x7EC3;&#x3002;</p><p>&#x6700;&#x7ECF;&#x5178;&#x7684;&#x5C31;&#x662F;&#x7528;&#x4E8E;&#x8BCD;&#x5411;&#x91CF;</p><table><thead><tr><th>&#x51FD;&#x6570;</th><th>&#x529F;&#x80FD;</th></tr></thead><tbody><tr><td>tf.nn.nce_loss(&#x2026;)</td><td>&#x8FD4;&#x56DE;noise-contrastive&#x7684;&#x8BAD;&#x7EC3;&#x635F;&#x5931;&#x7ED3;&#x679C;</td></tr><tr><td>tf.nn.sampled_softmax_loss()</td><td>&#x8FD4;&#x56DE;sampled softmax&#x7684;&#x8BAD;&#x7EC3;&#x635F;&#x5931;</td></tr><tr><td>tf.nn.uniform_candidate_sampler<br> tf.nn.log_uniform_candidate_sampler<br> tf.nn.learned_unigram_candidate_sampler<br> tf.nn.fixed_unigram_candidate_sampler</td><td>TensorFlow&#x63D0;&#x4F9B;&#x7684;&#x91C7;&#x6837;&#x5668;&#xFF0C;&#x7528;&#x4E8E;&#x5728;&#x4F7F;&#x7528;&#x4E0A;&#x8FF0;&#x91C7;&#x6837;&#x635F;&#x5931;&#x51FD;&#x6570;&#x4E4B;&#x4E00;&#x65F6;&#x968F;&#x673A;&#x91C7;&#x6837;&#x5019;&#x9009;&#x7C7B;&#x3002;</td></tr></tbody></table><h2 id="&#x4FDD;&#x5B58;&#x548C;&#x6062;&#x590D;"><a href="#&#x4FDD;&#x5B58;&#x548C;&#x6062;&#x590D;" class="headerlink" title="&#x4FDD;&#x5B58;&#x548C;&#x6062;&#x590D;"></a>&#x4FDD;&#x5B58;&#x548C;&#x6062;&#x590D;</h2><p>&#x63A8;&#x8350;&#x53EF;&#x4EE5;&#x770B;&#x8FD9;&#x7BC7;<a href="https://cv-tricks.com/tensorflow-tutorial/save-restore-tensorflow-models-quick-complete-tutorial/" target="_blank" rel="noopener">&#x6587;&#x7AE0;</a></p><table><thead><tr><th>Class  =&gt;  tf.train.Saver</th><th></th></tr></thead><tbody><tr><td><strong>init</strong>(    <br>   var_list=None,   <br>   max_to_keep=5,    <br>   keep_checkpoint_every_n_hours=10000.0,    <br>   filename=None <br>   &#x2026;&#x2026;)</td><td><strong>var_list</strong>&#xFF1A;&#x6307;&#x5B9A;&#x5C06;&#x8981;&#x4FDD;&#x5B58;&#x548C;&#x6062;&#x590D;&#x7684;&#x53D8;&#x91CF;&#x3002;<br>&#x53EF;&#x4EE5;&#x662F;list&#x6216;dict&#x3002;&#x9ED8;&#x8BA4;&#x5168;&#x52A0;&#x3002;<br><strong>max_to_keep</strong>&#xFF1A;&#x4FDD;&#x5B58;&#x6700;&#x8FD1;&#x68C0;&#x67E5;&#x70B9;&#x7684;&#x6570;&#x91CF;<br> <strong>keep_checkpoint_every_n_hours</strong>&#xFF1A;&#x591A;&#x4E45;&#x81EA;&#x52A8;&#x4FDD;&#x5B58;&#x4E00;&#x6B21;<br> &#x2026;&#x2026;</td></tr><tr><td>save(    <br>  sess,    <br>  save_path,    <br>  global_step=None, <br>  latest_filename=None,   <br>  meta_graph_suffix=&#x2019;meta&#x2019;,   <br>  write_meta_graph=True,   <br>  write_state=True,    <br>  strip_default_attrs=False )</td><td><strong>sess</strong>:&#x53D8;&#x91CF;&#x6240;&#x5728;&#x4F1A;&#x8BDD;<br> <strong>save_path</strong>: &#x4FDD;&#x5B58;&#x5730;&#x5740;<br> global_step:&#x51E0;&#x6B65;&#x4FDD;&#x5B58;&#x4E00;&#x6B21;<br> write_meta_graph:&#x662F;&#x5426;&#x4FDD;&#x5B58;&#x56FE;&#x5143;&#x6587;&#x4EF6;<br> &#x2026;&#x2026;</td></tr><tr><td>restore( <br> sess,   <br> save_path )</td><td><strong>sess</strong>:&#x53D8;&#x91CF;&#x6062;&#x590D;&#x4F1A;&#x8BDD;<br><strong>save_path</strong>: &#x6587;&#x4EF6;&#x5730;&#x5740;<br></td></tr><tr><td>&#x2026;&#x2026;</td></tr></tbody></table><figure class="highlight python"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br></pre></td><td class="code"><pre><span class="line"><span class="comment">######################################  &#x5B58;&#x50A8;&#x7684;&#x6587;&#x4EF6;  #############################################</span></span><br><span class="line"><span class="comment"># v&lt;0.11</span></span><br><span class="line"><span class="comment"># checkpoint   my_test_model.meta   my_test_model.ckpt</span></span><br><span class="line"><span class="comment"># v&gt;=0.11</span></span><br><span class="line"><span class="comment"># checkpoint   my_test_model.meta   my_test_model.data-00000-of-00001    my_test_model.index   </span></span><br><span class="line"></span><br><span class="line"><span class="comment">########################################  &#x4FDD;&#x5B58;  ##############################################  </span></span><br><span class="line">saver = tf.train.Saver()</span><br><span class="line"><span class="comment">#saver = tf.train.Saver([w1, w2])</span></span><br><span class="line"><span class="comment">#saver = tf.train.Saver({&apos;w1&apos;: w1, &apos;w2&apos;: w2})</span></span><br><span class="line"><span class="comment">#saver = tf.train.Saver(max_to_keep=4, keep_checkpoint_every_n_hours=2)</span></span><br><span class="line"></span><br><span class="line">save_path = saver.save(sess, <span class="string">&quot;my-test-model&quot;</span>)</span><br><span class="line"><span class="comment">#saver.save(sess, &apos;my_test_model&apos;,global_step=1000)</span></span><br><span class="line"></span><br><span class="line"><span class="comment">#########################################  &#x6062;&#x590D;  ###############################################</span></span><br><span class="line"></span><br><span class="line"><span class="comment">#&#x53EA;&#x6062;&#x590D;&#x53D8;&#x91CF;&#xFF0C;&#x6A21;&#x578B;&#x5DF2;&#x7ECF;&#x63D0;&#x524D;&#x624B;&#x52A8;&#x64B8;&#x5B8C;&#xFF0C;&#x800C;&#x4E14;&#x8981;&#x4FDD;&#x8BC1;&#x53D8;&#x91CF;&#x4E00;&#x81F4;</span></span><br><span class="line">saver = tf.train.Saver()</span><br><span class="line">saver.restore(sess, <span class="string">&quot;my-test-model&quot;</span>)</span><br><span class="line">saver&#x3002;restore(sess,tf.train.latest_checkpoint(<span class="string">&apos;/&apos;</span>))<span class="comment">#&#x81EA;&#x52A8;&#x83B7;&#x53D6;&#x76EE;&#x5F55;&#x4E0B;&#x6700;&#x8FD1;&#x7684;&#x6A21;&#x578B;</span></span><br><span class="line"></span><br><span class="line"><span class="comment">#&#x6062;&#x590D;&#x6A21;&#x578B;&#x548C;&#x6570;&#x636E;</span></span><br><span class="line">new_saver = tf.train.import_meta_graph(<span class="string">&apos;my_test_model-1000.meta&apos;</span>)</span><br><span class="line">new_saver.restore(sess, tf.train.latest_checkpoint(<span class="string">&apos;./&apos;</span>)) <span class="comment">#&#x76EE;&#x5F55;&#x5373;&#x53EF;</span></span><br><span class="line"></span><br><span class="line"><span class="comment">#&#x4F7F;&#x7528;&#x6062;&#x590D;&#x5F97;&#x5230;&#x7684;&#x6A21;&#x578B;</span></span><br><span class="line">graph = tf.get_default_graph()</span><br><span class="line"><span class="comment"># access and create placeholders variables and create feed-dict to feed new data</span></span><br><span class="line">w1 = graph.get_tensor_by_name(<span class="string">&quot;w1:0&quot;</span>)</span><br><span class="line">w2 = graph.get_tensor_by_name(<span class="string">&quot;w2:0&quot;</span>)</span><br><span class="line">feed_dict ={w1:<span class="number">13.0</span>,w2:<span class="number">17.0</span>}</span><br><span class="line"><span class="comment"># access the op that you want to run. </span></span><br><span class="line">op_to_restore = graph.get_tensor_by_name(<span class="string">&quot;op_to_restore:0&quot;</span>)</span><br><span class="line"><span class="comment"># Add more to the current graph</span></span><br><span class="line">add_on_op = tf.multiply(op_to_restore,<span class="number">2</span>)</span><br><span class="line"></span><br><span class="line"><span class="keyword">print</span> sess.run(add_on_op,feed_dict)</span><br></pre></td></tr></tbody></table></figure><h2 id="&#x56FE;&#x7684;&#x6784;&#x5EFA;"><a href="#&#x56FE;&#x7684;&#x6784;&#x5EFA;" class="headerlink" title="&#x56FE;&#x7684;&#x6784;&#x5EFA;"></a>&#x56FE;&#x7684;&#x6784;&#x5EFA;</h2><p>A TensorFlow computation, represented as a dataflow graph.</p><p>A <code>Graph</code> contains a set of <code>tf.Operation</code> objects, which represent units of computation; and <code>tf.Tensor</code> objects, which represent the units of data that flow between operations.</p><h3 id="tf-Graph"><a href="#tf-Graph" class="headerlink" title="tf.Graph"></a><a href="https://www.tensorflow.org/api_docs/python/tf/Graph?hl=zh-cn" target="_blank" rel="noopener">tf.Graph</a></h3><table><thead><tr><th>Class =&gt; tf.Graph</th><th>&#x6CE8;&#x610F;&#xFF1A;&#x8BE5;&#x7C7B;&#x5E76;&#x4E0D;&#x662F;&#x7EBF;&#x7A0B;&#x5B89;&#x5168;&#x7684;&#xFF01;&#xFF01;</th></tr></thead><tbody><tr><td><strong>init</strong>()</td><td>&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x7A7A;&#x7684;&#x56FE;</td></tr><tr><td><strong>.as_default()</strong></td><td>&#x4E00;&#x4E2A;&#x5C06;&#x67D0;&#x56FE;&#x8BBE;&#x7F6E;&#x4E3A;&#x9ED8;&#x8BA4;&#x56FE;&#xFF0C;&#x5E76;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x4E0A;&#x4E0B;&#x6587;&#x7BA1;&#x7406;&#x5668;</td></tr><tr><td>.finalize()</td><td>&#x5B8C;&#x6210;&#x56FE;&#x7684;&#x6784;&#x5EFA;&#xFF0C;&#x5373;&#x5C06;&#x5176;&#x8BBE;&#x7F6E;&#x4E3A;&#x53EA;&#x8BFB;&#x6A21;&#x5F0F;</td></tr><tr><td><strong>.device(device_name_or_function)</strong></td><td>&#x6307;&#x5B9A;&#x4E00;&#x4E2A;&#x9ED8;&#x8BA4;&#x9A71;&#x52A8;&#xFF0C;&#x5E76;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x4E0A;&#x4E0B;&#x6587;&#x7BA1;&#x7406;&#x5668;</td></tr><tr><td>.get_operation_by_name(name)</td><td>&#x83B7;&#x5F97;&#x6307;&#x5B9A;&#x540D;&#x5B57;&#x7684;operation</td></tr><tr><td>.get_tensor_by_name(name)</td><td>&#x83B7;&#x5F97;&#x6307;&#x5B9A;&#x540D;&#x5B57;&#x7684;tensor</td></tr><tr><td>.name_scope(name)</td><td>&#x4E3A;&#x8282;&#x70B9;&#x521B;&#x5EFA;&#x5C42;&#x6B21;&#x5316;&#x7684;&#x540D;&#x79F0;&#xFF0C;&#x5E76;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x4E0A;&#x4E0B;&#x6587;&#x7BA1;&#x7406;&#x5668;</td></tr><tr><td>&#x2026;&#x2026;</td><td></td></tr><tr><td><strong>tf.get_default_graph()</strong></td><td>&#x83B7;&#x5F97;&#x5F53;&#x524D;&#x4E0A;&#x4E0B;&#x6587;&#x7684;&#x9ED8;&#x8BA4;&#x56FE;</td></tr><tr><td><strong>tf.reset_default_graph()</strong></td><td>&#x6E05;&#x9664;&#x9ED8;&#x8BA4;&#x56FE;&#x7684;&#x5806;&#x6808;&#xFF0C;&#x5E76;&#x8BBE;&#x7F6E;&#x5168;&#x5C40;&#x56FE;&#x4E3A;&#x9ED8;&#x8BA4;&#x56FE;</td></tr></tbody></table><figure class="highlight python"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br></pre></td><td class="code"><pre><span class="line"><span class="comment">#&#x83B7;&#x5F97;&#x9ED8;&#x8BA4;&#x56FE;</span></span><br><span class="line">g = tf.get_default_graph()</span><br><span class="line"></span><br><span class="line"><span class="comment">#&#x4F7F;&#x7528;&#x65B0;&#x5EFA;&#x7684;&#x56FE;&#xFF08;1&#xFF09;</span></span><br><span class="line">g = tf.Graph()</span><br><span class="line"><span class="keyword">with</span> g.as_default():</span><br><span class="line">  c = tf.constant(<span class="number">5.0</span>)</span><br><span class="line">  <span class="keyword">assert</span> c.graph <span class="keyword">is</span> g</span><br><span class="line"></span><br><span class="line"><span class="comment">#&#x4F7F;&#x7528;&#x65B0;&#x5EFA;&#x7684;&#x56FE;&#xFF08;2&#xFF09;</span></span><br><span class="line"><span class="keyword">with</span> tf.Graph().as_default() <span class="keyword">as</span> g:</span><br><span class="line">  c = tf.constant(<span class="number">5.0</span>)</span><br><span class="line">  <span class="keyword">assert</span> c.graph <span class="keyword">is</span> g</span><br><span class="line"></span><br><span class="line"><span class="comment">#&#x6307;&#x5B9A;&#x9A71;&#x52A8;</span></span><br><span class="line"><span class="keyword">with</span> g.device(<span class="string">&apos;/device:GPU:0&apos;</span>):</span><br><span class="line">  </span><br><span class="line"><span class="comment">#&#x4F7F;&#x7528;name_scope()</span></span><br><span class="line">  c = tf.constant(<span class="number">5.0</span>, name=<span class="string">&quot;c&quot;</span>)</span><br><span class="line">  <span class="keyword">assert</span> c.op.name == <span class="string">&quot;c&quot;</span></span><br><span class="line">  c_1 = tf.constant(<span class="number">6.0</span>, name=<span class="string">&quot;c&quot;</span>)</span><br><span class="line">  <span class="keyword">assert</span> c_1.op.name == <span class="string">&quot;c_1&quot;</span></span><br><span class="line">  <span class="comment"># Creates a scope called &quot;nested&quot;</span></span><br><span class="line">  <span class="keyword">with</span> g.name_scope(<span class="string">&quot;nested&quot;</span>) <span class="keyword">as</span> scope:</span><br><span class="line">    nested_c = tf.constant(<span class="number">10.0</span>, name=<span class="string">&quot;c&quot;</span>)</span><br><span class="line">    <span class="keyword">assert</span> nested_c.op.name == <span class="string">&quot;nested/c&quot;</span></span><br><span class="line">    <span class="comment"># Creates a nested scope called &quot;inner&quot;.</span></span><br><span class="line">    <span class="keyword">with</span> g.name_scope(<span class="string">&quot;inner&quot;</span>):</span><br><span class="line">      nested_inner_c = tf.constant(<span class="number">20.0</span>, name=<span class="string">&quot;c&quot;</span>)</span><br><span class="line">      <span class="keyword">assert</span> nested_inner_c.op.name == <span class="string">&quot;nested/inner/c&quot;</span></span><br></pre></td></tr></tbody></table></figure><h3 id="tf-Operation"><a href="#tf-Operation" class="headerlink" title="tf.Operation"></a><a href="https://www.tensorflow.org/api_docs/python/tf/Operation?hl=zh-cn" target="_blank" rel="noopener">tf.Operation</a></h3><p>Objects of type <code>Operation</code> are created by calling a Python op constructor (such as<code>tf.matmul</code>) or <code>tf.Graph.create_op</code></p><table><thead><tr><th>Class =&gt; tf.Operation</th><th>&#x4E00;&#x822C;&#x4E0D;&#x600E;&#x4E48;&#x64CD;&#x4F5C;</th></tr></thead><tbody><tr><td>tf.Operation.name</td><td>&#x64CD;&#x4F5C;&#x8282;&#x70B9;(op)&#x7684;&#x540D;&#x79F0;</td></tr><tr><td>tf.Operation.type</td><td>&#x64CD;&#x4F5C;&#x8282;&#x70B9;(op)&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x6BD4;&#x5982;&#x201D;MatMul&#x201D;</td></tr><tr><td>tf.Operation.run(feed_dict=None, session=None)</td><td>&#x5728;&#x4F1A;&#x8BDD;(Session)&#x4E2D;&#x8FD0;&#x884C;&#x8BE5;&#x64CD;&#x4F5C;</td></tr><tr><td></td></tr></tbody></table><h3 id="tf-Tensor"><a href="#tf-Tensor" class="headerlink" title="tf.Tensor"></a><a href="https://www.tensorflow.org/api_docs/python/tf/Tensor?hl=zh-cn" target="_blank" rel="noopener">tf.Tensor</a></h3><p>Represents one of the outputs of an Operation. &#x8BA1;&#x7B97;&#x56FE;&#x4E2D;, &#x64CD;&#x4F5C;&#x95F4;&#x4F20;&#x9012;&#x7684;&#x6570;&#x636E;&#x90FD;&#x662F; tensor&#x3002;</p><p>&#x6CE8;&#x610F;&#xFF1A;Tensor&#x53EA;&#x662F;&#x4E00;&#x4E2A;operation&#x8F93;&#x51FA;&#x7684;&#x7B26;&#x53F7;&#x8C61;&#x5F81;&#xFF0C;&#x5E76;&#x4E0D;&#x4FDD;&#x5B58;&#x786E;&#x5207;&#x7684;&#x503C;&#xFF0C;&#x53EA;&#x662F;&#x63D0;&#x4F9B;&#x4E86;&#x8BA1;&#x7B97;&#x8FD9;&#x4E2A;&#x503C;&#x7684;&#x65B9;&#x6CD5;&#xFF01;</p><table><thead><tr><th>Class =&gt; tf.Tensor</th><th>&#x4E00;&#x822C;&#x4E0D;&#x600E;&#x4E48;&#x64CD;&#x4F5C;</th></tr></thead><tbody><tr><td>.dtype</td><td>&#x6570;&#x636E;&#x7C7B;&#x578B;</td></tr><tr><td>.name</td><td>tensor&#x540D;&#x79F0;</td></tr><tr><td>.op</td><td>&#x4EA7;&#x751F;&#x8BE5;tensor&#x7684;op</td></tr><tr><td>.eval(feed_dict=None,session=None )</td><td>&#x5728;&#x4F1A;&#x8BDD;(Session)&#x4E2D;&#x8FD0;&#x884C;&#x8BE5;Tensor</td></tr><tr><td>&#x2026;&#x2026;</td></tr></tbody></table><h2 id="&#x56FE;&#x7684;&#x8FD0;&#x884C;"><a href="#&#x56FE;&#x7684;&#x8FD0;&#x884C;" class="headerlink" title="&#x56FE;&#x7684;&#x8FD0;&#x884C;"></a>&#x56FE;&#x7684;&#x8FD0;&#x884C;</h2><table><thead><tr><th>Class =&gt; tf.Session</th><th></th></tr></thead><tbody><tr><td><strong>init</strong>( target=&#x2019;&#x2019;,graph=None,config=None )</td><td>graph:&#x9ED8;&#x8BA4;&#x52A0;&#x8F7D;&#x4E0A;&#x4E0B;&#x6587;&#x9ED8;&#x8BA4;&#x56FE;</td></tr><tr><td><strong>run(    <br>    fetches,   <br>    feed_dict=None,  <br>    options=None,  <br>    run_metadata=None )</strong></td><td>&#x6B64;&#x65B9;&#x6CD5;&#x8FD0;&#x884C;TensorFlow&#x8BA1;&#x7B97;&#x7684;&#x4E00;&#x4E2A;&#x201C;step&#x201D;&#xFF0C;<br>&#x901A;&#x8FC7;&#x8FD0;&#x884C;&#x5FC5;&#x8981;&#x7684;&#x56FE;&#x5F62;&#x7247;&#x6BB5;&#x6765;&#x6267;&#x884C;&#x6BCF;&#x4E2A;&#x64CD;&#x4F5C;<br>&#x5E76;&#x8BC4;&#x4F30;fetches&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;Tensor&#xFF0C;<br>&#x5C06;feed_dict&#x4E2D;&#x7684;&#x503C;&#x66FF;&#x6362;&#x4E3A;&#x76F8;&#x5E94;&#x7684;&#x8F93;&#x5165;&#x503C;&#x3002;<br>fetches:&#x5355;&#x4E2A;&#x56FE;&#x5143;&#x7D20;&#xFF0C;&#x56FE;&#x5143;&#x7D20;&#x5217;&#x8868;&#x6216;&#x5B57;&#x5178;<br>feed_dict:&#x56FE;&#x5143;&#x7D20;&#x4E0E;&#x503C;&#x7684;&#x6620;&#x5C04;&#x5B57;&#x5178;</td></tr><tr><td><strong>.as_default()</strong></td><td>&#x5C06;&#x8BE5;&#x4F1A;&#x8BDD;&#x8BBE;&#x7F6E;&#x4E3A;&#x9ED8;&#x8BA4;&#x4F1A;&#x8BDD;&#xFF0C;&#x5E76;&#x8FD4;&#x56DE;&#x4E00;&#x4E2A;&#x4E0A;&#x4E0B;&#x6587;&#x7BA1;&#x7406;&#x5668;&#x3002;<br>&#x5728;&#x6B64;&#x4F1A;&#x8BDD;&#x4E2D;&#x53EF;&#x6267;&#x884C;tf.Operation.run&#x6216;tf.Tensor.eval&#x3002;</td></tr><tr><td>&#x2026;&#x2026;</td><td></td></tr><tr><td><strong>Class =&gt; tf.InteractiveSession</strong></td><td>&#x4F7F;&#x7528;&#x5728;&#x4EA4;&#x4E92;&#x5F0F;&#x4E0A;&#x4E0B;&#x6587;&#x73AF;&#x5883;&#x7684;tf&#x4F1A;&#x8BDD;&#xFF0C;&#x6BD4;&#x5982;shell&#xFF0C;ipython&#x3002;<br><strong>&#x4E0E;.Session&#x7684;&#x552F;&#x4E00;&#x533A;&#x522B;&#x662F;InteractiveSession&#x5728;&#x6784;&#x9020;&#x65F6;&#x76F4;&#x63A5;&#x5C06;&#x81EA;&#x5DF1;&#x8BBE;&#x7F6E;&#x4E3A;&#x4E86;&#x9ED8;&#x8BA4;session&#x3002;</strong>&#x4E8E;&#x662F;&#x80FD;&#x591F;&#x76F4;&#x63A5;&#x8C03;&#x7528;Operation.run()&#x548C;Tensor.eval()&#x3002;</td></tr><tr><td>&#x2026;&#x2026;</td><td></td></tr><tr><td>tf.get_default_session()</td><td>&#x8FD4;&#x56DE;&#x5F53;&#x524D;&#x7EBF;&#x7A0B;&#x7684;&#x9ED8;&#x8BA4;&#x4F1A;&#x8BDD;</td></tr></tbody></table><figure class="highlight python"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">with</span> tf.Session() <span class="keyword">as</span> sess:</span><br><span class="line">  sess.run(c)</span><br><span class="line">  <span class="keyword">with</span> sess.as_default():</span><br><span class="line">  <span class="keyword">assert</span> tf.get_default_session() <span class="keyword">is</span> sess</span><br><span class="line">  print(c.eval()) <span class="comment">#&#x76F4;&#x63A5;&#x8FD0;&#x884C;~</span></span><br><span class="line"></span><br><span class="line"><span class="keyword">with</span> tf.InteractiveSession() <span class="keyword">as</span> sess:</span><br><span class="line">  print(c.eval()) <span class="comment">#&#x76F4;&#x63A5;&#x8FD0;&#x884C;</span></span><br></pre></td></tr></tbody></table></figure><h2 id="&#x56FE;&#x7684;&#x4F18;&#x5316;&#x8BAD;&#x7EC3;"><a href="#&#x56FE;&#x7684;&#x4F18;&#x5316;&#x8BAD;&#x7EC3;" class="headerlink" title="&#x56FE;&#x7684;&#x4F18;&#x5316;&#x8BAD;&#x7EC3;"></a>&#x56FE;&#x7684;&#x4F18;&#x5316;&#x8BAD;&#x7EC3;</h2><p>&#x53EA;&#x8003;&#x8651;&#x57FA;&#x672C;&#x7684;&#x4F7F;&#x7528;&#xFF0C;&#x90A3;&#x4E9B;&#x4EC0;&#x4E48;Gradient Computation and Clipping&#x7684;&#x81EA;&#x5DF1;&#x52A8;&#x624B;&#x6539;&#x4F18;&#x5316;&#x5668;&#x7684;&#x9A9A;&#x64CD;&#x4F5C;&#x90FD;&#x4E0D;&#x5728;&#x672C;&#x83DC;&#x9E1F;&#x7684;&#x8003;&#x8651;&#x8303;&#x56F4;&#x5185;&#xB7;&#xB7;&#xB7;&#xB7;&#xB7;&#xB7;&#xB7;</p><table><thead><tr><th>Class tf.train.Optimizer</th><th>&#x4F18;&#x5316;&#x7C7B;&#x7684;base&#x7C7B;&#xFF0C;&#x8BE5;&#x7C7B;&#x4E0D;&#x76F4;&#x63A5;&#x88AB;&#x8C03;&#x7528;&#x3002;<br>&#x800C;&#x8F83;&#x591A;&#x4F7F;&#x7528;&#x5176;&#x5B50;&#x7C7B;&#xFF0C;&#x6BD4;&#x5982;GradientDescentOptimizer</th></tr></thead><tbody><tr><td><strong>.minimize(  <br>   loss, <br>   global_step=None,  <br>   var_list=None,   <br>   gate_gradients=GATE_OP,   <br>   aggregation_method=None,<br>   colocate_gradients_with_ops=False,<br>   name=None,   <br>   grad_loss=None )</strong></td><td><strong>loss</strong>: &#x7528;&#x4E8E;&#x6700;&#x5C0F;&#x5316;&#x7684;tensor<br><strong>global_step</strong>:&#x5982;&#x679C;&#x975E;&#x7A7A;&#xFF0C;&#x5219;&#x6BCF;&#x6B21;&#x8FD0;&#x884C;&#x8BB0;&#x5F55;&#x6B65;&#x6570;<br>var_list:&#x66F4;&#x65B0;&#x7684;&#x53D8;&#x91CF;&#x3002;<br>gate_gradients: &#x7528;&#x4E8E;&#x63A7;&#x5236;&#x5E76;&#x884C;&#x5316;&#x7684;&#x7A0B;&#x5EA6;&#x3002;</td></tr><tr><td>.compute_gradients(&#x2026;&#x2026;)</td><td>&#x8BA1;&#x7B97;&#x68AF;&#x5EA6;&#xFF08;&#x4F9B;&#x5927;&#x4F6C;&#x4F7F;&#x7528;&#xFF09;</td></tr><tr><td>.apply_gradients(&#x2026;&#x2026;)</td><td>&#x5BF9;&#x53D8;&#x91CF;&#x5E94;&#x7528;&#x68AF;&#x5EA6;&#xFF08;&#x4F9B;&#x5927;&#x4F6C;&#x4F7F;&#x7528;&#xFF09;</td></tr><tr><td>&#x2026;&#x2026;</td><td></td></tr><tr><td><strong>&#x5E38;&#x7528;&#x5B9E;&#x73B0;&#x7C7B;</strong></td><td></td></tr><tr><td><strong>class tf.train.GradientDescentOptimizer</strong></td><td>&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#x4F18;&#x5316;&#x5668;</td></tr><tr><td><strong>class tf.train.AdamOptimizer</strong></td><td>Adam&#x4F18;&#x5316;&#x5668;</td></tr><tr><td><strong>class tf.train.AdadeltaOptimizer</strong></td><td>Adadelta&#x4F18;&#x5316;&#x5668;</td></tr><tr><td><strong>class tf.train.AdagradOptimizer</strong></td><td>Adagrad&#x4F18;&#x5316;&#x5668;</td></tr><tr><td>class tf.train.MomentumOptimizer</td><td>Momentum&#x4F18;&#x5316;&#x5668;</td></tr><tr><td>class tf.train.FtrlOptimizer</td><td>Ftrl&#x4F18;&#x5316;&#x5668;</td></tr><tr><td>class tf.train.RMSPropOptimizer</td><td>RMSProp&#x4F18;&#x5316;&#x5668;</td></tr></tbody></table><p><strong>gate_gradients=</strong></p><p><em>GATE_NONE</em> : &#x5E76;&#x884C;&#x5730;&#x8BA1;&#x7B97;&#x548C;&#x5E94;&#x7528;&#x68AF;&#x5EA6;&#x3002;&#x63D0;&#x4F9B;&#x6700;&#x5927;&#x5316;&#x7684;&#x5E76;&#x884C;&#x6267;&#x884C;&#xFF0C;&#x4F46;&#x662F;&#x4F1A;&#x5BFC;&#x81F4;&#x6709;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x679C;&#x6CA1;&#x6709;&#x518D;&#x73B0;&#x6027;&#x3002;&#x6BD4;&#x5982;&#x4E24;&#x4E2A;matmul&#x64CD;&#x4F5C;&#x7684;&#x68AF;&#x5EA6;&#x4F9D;&#x8D56;&#x8F93;&#x5165;&#x503C;&#xFF0C;&#x4F7F;&#x7528;GATE_NONE&#x53EF;&#x80FD;&#x4F1A;&#x51FA;&#x73B0;&#x6709;&#x4E00;&#x4E2A;&#x68AF;&#x5EA6;&#x5728;&#x5176;&#x4ED6;&#x68AF;&#x5EA6;&#x4E4B;&#x524D;&#x4FBF;&#x5E94;&#x7528;&#x5230;&#x67D0;&#x4E2A;&#x8F93;&#x5165;&#x4E2D;&#xFF0C;&#x5BFC;&#x81F4;&#x51FA;&#x73B0;&#x4E0D;&#x53EF;&#x518D;&#x73B0;&#x7684;(non-reproducible)&#x7ED3;&#x679C;&#x3002;<br><em>GATE_OP</em> : &#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;&#x64CD;&#x4F5C;Op&#xFF0C;&#x786E;&#x4FDD;&#x6BCF;&#x4E00;&#x4E2A;&#x68AF;&#x5EA6;&#x5728;&#x4F7F;&#x7528;&#x4E4B;&#x524D;&#x90FD;&#x5DF2;&#x7ECF;&#x8BA1;&#x7B97;&#x5B8C;&#x6210;&#x3002;&#x8FD9;&#x79CD;&#x505A;&#x6CD5;&#x9632;&#x6B62;&#x4E86;&#x90A3;&#x4E9B;&#x5177;&#x6709;&#x591A;&#x4E2A;&#x8F93;&#x5165;&#xFF0C;&#x5E76;&#x4E14;&#x68AF;&#x5EA6;&#x8BA1;&#x7B97;&#x4F9D;&#x8D56;&#x8F93;&#x5165;&#x60C5;&#x5F62;&#x4E2D;&#xFF0C;&#x591A;&#x8F93;&#x5165;Ops&#x4E4B;&#x95F4;&#x7684;&#x7ADE;&#x4E89;&#x60C5;&#x51B5;&#x51FA;&#x73B0;&#x3002;<br><em>GATE_GRAPH</em> : &#x786E;&#x4FDD;&#x6240;&#x6709;&#x7684;&#x53D8;&#x91CF;&#x5BF9;&#x5E94;&#x7684;&#x6240;&#x6709;&#x68AF;&#x5EA6;&#x5728;&#x4ED6;&#x4EEC;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x88AB;&#x4F7F;&#x7528;&#x524D;&#x8BA1;&#x7B97;&#x5B8C;&#x6210;&#x3002;&#x8BE5;&#x65B9;&#x5F0F;&#x5177;&#x6709;&#x6700;&#x4F4E;&#x7EA7;&#x522B;&#x7684;&#x5E76;&#x884C;&#x5316;&#x7A0B;&#x5EA6;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x60F3;&#x8981;&#x5728;&#x5E94;&#x7528;&#x5B83;&#x4EEC;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x4E4B;&#x524D;&#x5904;&#x7406;&#x5B8C;&#x6240;&#x6709;&#x7684;&#x68AF;&#x5EA6;&#x8BA1;&#x7B97;&#x65F6;&#x5F88;&#x6709;&#x5E2E;&#x52A9;&#x7684;&#x3002;</p><figure class="highlight python"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br></pre></td><td class="code"><pre><span class="line"><span class="comment">#&#x57FA;&#x672C;&#x4F7F;&#x7528;</span></span><br><span class="line">global_step = tf.Variable(<span class="number">10</span>, trainable=<span class="keyword">False</span>, name=<span class="string">&apos;global_step&apos;</span>)</span><br><span class="line"><span class="comment"># Create an optimizer with the desired parameters.</span></span><br><span class="line">opt = GradientDescentOptimizer(learning_rate=<span class="number">0.1</span>)</span><br><span class="line"><span class="comment"># Add Ops to the graph to minimize a cost by updating a list of variables.</span></span><br><span class="line"><span class="comment"># &quot;cost&quot; is a Tensor, and the list of variables contains tf.Variable objects.</span></span><br><span class="line">opt_op = opt.minimize(cost, var_list=&lt;list of variables&gt;&#xFF0C;global_step=global_step)</span><br><span class="line"><span class="comment"># Execute opt_op to do one step of training:</span></span><br><span class="line">opt_op.run()</span><br></pre></td></tr></tbody></table></figure><p>##&#x6570;&#x636E;&#x7684;&#x5BFC;&#x5165;</p><p>&#x5E76;&#x4E0D;&#x5FC5;&#x987B;&#xFF0C;&#x81EA;&#x5DF1;&#x5904;&#x7406;&#x5BFC;&#x5165;&#x6570;&#x636E;&#x66F4;&#x52A0;&#x7075;&#x6D3B;&#x4F46;&#x662F;&#x53EF;&#x4EE5;&#x7B80;&#x5316;&#x7A0B;&#x5E8F;&#xFF01;&#x8FD9;&#x91CC;&#x53EA;&#x662F;&#x7B80;&#x5355;&#x7684;&#x5E94;&#x7528;&#x3002;</p><table><thead><tr><th>Class tf.data.Dataset</th><th>&#x5143;&#x7D20;&#x96C6;&#x5408;&#x8F93;&#x5165;&#x7684;&#x7BA1;&#x9053;</th></tr></thead><tbody><tr><td><strong>.from_tensor_slices(tensors)</strong></td><td>&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x5176;&#x5143;&#x7D20;&#x662F;&#x7ED9;&#x5B9A;&#x5F20;&#x91CF;&#x7684;&#x5207;&#x7247;&#x3002;</td></tr><tr><td><strong>.map(map_func,num_parallel_calls=None)</strong></td><td>&#x5BF9;&#x6570;&#x636E;&#x96C6;&#x5143;&#x7D20;&#x8FDB;&#x884C;&#x6620;&#x5C04;</td></tr><tr><td><strong>.shuffle(buffer_size, seed=None,    reshuffle_each_iteration=None)</strong></td><td>&#x968F;&#x673A;&#x6DF7;&#x6D17;&#x6B64;&#x6570;&#x636E;&#x96C6;&#x7684;&#x5143;&#x7D20;&#x3002;</td></tr><tr><td><strong>.batch(batch_size,drop_remainder=False )</strong></td><td>&#x5C06;&#x6B64;&#x6570;&#x636E;&#x96C6;&#x7684;&#x8FDE;&#x7EED;&#x5143;&#x7D20;&#x7EC4;&#x5408;&#x6210;&#x6279;&#x6B21;&#xFF0C;&#x4E3B;&#x8981;&#x7528;&#x6765;&#x5904;&#x7406;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x4E2D;&#x7684;batch_size</td></tr><tr><td><strong>.repeat(count=None)</strong></td><td>&#x5C06;&#x6574;&#x4E2A;&#x5E8F;&#x5217;&#x91CD;&#x590D;&#x591A;&#x6B21;&#xFF0C;&#x4E3B;&#x8981;&#x7528;&#x6765;&#x5904;&#x7406;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x4E2D;&#x7684;epoch</td></tr><tr><td><strong>.make_one_shot_iterator()</strong></td><td><strong>&#x5355;&#x6B21;</strong>&#x8FED;&#x4EE3;&#x5668;&#x662F;&#x6700;&#x7B80;&#x5355;&#x7684;&#x8FED;&#x4EE3;&#x5668;&#x5F62;&#x5F0F;&#xFF0C;&#x4EC5;&#x652F;&#x6301;&#x5BF9;&#x6570;&#x636E;&#x96C6;&#x8FDB;&#x884C;&#x4E00;&#x6B21;&#x8FED;&#x4EE3;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x663E;&#x5F0F;&#x521D;&#x59CB;&#x5316;&#x3002; &#x4F46;&#x4E0D;&#x652F;&#x6301;&#x53C2;&#x6570;&#x5316;&#x3002;</td></tr><tr><td><strong>.make_initializable_iterator(shared_name=None)</strong></td><td>&#x521B;&#x5EFA;&#x7528;&#x4E8E;&#x679A;&#x4E3E;&#x6B64;&#x6570;&#x636E;&#x96C6;&#x5143;&#x7D20;&#x7684;&#x8FED;&#x4EE3;&#x5668;&#x3002;&#x9700;&#x8981;&#x521D;&#x59CB;&#x5316;&#x3002;&#x4F46;&#x5141;&#x8BB8;&#x4F7F;&#x7528;&#x5F20;&#x91CF;&#x53C2;&#x6570;&#x5316;&#x6570;&#x636E;&#x96C6;&#x7684;&#x5B9A;&#x4E49;&#x3002;</td></tr><tr><td><strong>tf.errors.OutOfRangeError</strong></td><td>&#x76D1;&#x6D4B;&#x6570;&#x636E;&#x662F;&#x5426;&#x5DF2;&#x7ECF;&#x7528;&#x5B8C;&#x3002;</td></tr><tr><td>.from_generator( &#x2026; )</td><td>&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x5176;&#x5143;&#x7D20;&#x7531;&#x751F;&#x6210;&#x5668;&#x751F;&#x6210;&#x3002;</td></tr><tr><td>.from_tensors(tensors)</td><td>&#x4F7F;&#x7528;&#x5305;&#x542B;&#x7ED9;&#x5B9A;&#x5F20;&#x91CF;&#x7684;&#x5355;&#x4E2A;&#x5143;&#x7D20;&#x521B;&#x5EFA;&#x6570;&#x636E;&#x96C6;&#x3002;</td></tr><tr><td>.list_files(file_pattern,shuffle=None,seed=None)</td><td>&#x4E0E;&#x6A21;&#x5F0F;&#x5339;&#x914D;&#x7684;&#x6240;&#x6709;&#x6587;&#x4EF6;&#x7684;&#x6570;&#x636E;&#x96C6;&#x3002;</td></tr><tr><td>.padded_batch()</td><td>&#x5C06;&#x6B64;&#x6570;&#x636E;&#x96C6;&#x7684;&#x8FDE;&#x7EED;&#x5143;&#x7D20;&#x7EC4;&#x5408;&#x6210;&#x6279;&#x6B21;,&#x5141;&#x8BB8;&#x8F93;&#x5165;&#x5143;&#x7D20;&#x7684;&#x5927;&#x5C0F;&#x4E0D;&#x540C;&#x3002;</td></tr><tr><td>.concatenate(dataset)</td><td>&#x5408;&#x5E76;&#x6570;&#x636E;&#x96C6;</td></tr><tr><td>.filter(predicate)</td><td>&#x8FC7;&#x6EE4;&#x6570;&#x636E;&#x96C6;</td></tr><tr><td>.flat_map(map_func)</td><td>&#x5728;&#x6B64;&#x6570;&#x636E;&#x96C6;&#x4E2D;&#x6620;&#x5C04;map_func&#x5E76;&#x5C55;&#x5E73;&#x7ED3;&#x679C;&#x3002;</td></tr><tr><td>.range(*args)</td><td>&#x6839;&#x636E;&#x7ED9;&#x5B9A;&#x8303;&#x56F4;&#x751F;&#x6210;&#x6570;&#x636E;&#x96C6;</td></tr></tbody></table><figure class="highlight python"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br><span class="line">8</span><br><span class="line">9</span><br><span class="line">10</span><br><span class="line">11</span><br><span class="line">12</span><br><span class="line">13</span><br><span class="line">14</span><br><span class="line">15</span><br><span class="line">16</span><br><span class="line">17</span><br><span class="line">18</span><br><span class="line">19</span><br><span class="line">20</span><br><span class="line">21</span><br><span class="line">22</span><br><span class="line">23</span><br><span class="line">24</span><br><span class="line">25</span><br><span class="line">26</span><br><span class="line">27</span><br><span class="line">28</span><br><span class="line">29</span><br><span class="line">30</span><br><span class="line">31</span><br><span class="line">32</span><br><span class="line">33</span><br><span class="line">34</span><br><span class="line">35</span><br><span class="line">36</span><br><span class="line">37</span><br><span class="line">38</span><br><span class="line">39</span><br><span class="line">40</span><br><span class="line">41</span><br><span class="line">42</span><br><span class="line">43</span><br><span class="line">44</span><br><span class="line">45</span><br><span class="line">46</span><br><span class="line">47</span><br><span class="line">48</span><br><span class="line">49</span><br><span class="line">50</span><br><span class="line">51</span><br><span class="line">52</span><br><span class="line">53</span><br><span class="line">54</span><br><span class="line">55</span><br><span class="line">56</span><br><span class="line">57</span><br><span class="line">58</span><br><span class="line">59</span><br><span class="line">60</span><br><span class="line">61</span><br><span class="line">62</span><br><span class="line">63</span><br><span class="line">64</span><br><span class="line">65</span><br><span class="line">66</span><br><span class="line">67</span><br></pre></td><td class="code"><pre><span class="line"><span class="comment"># Assume that each row of `features` corresponds to the same row as `labels`.</span></span><br><span class="line"><span class="keyword">assert</span> features.shape[<span class="number">0</span>] == labels.shape[<span class="number">0</span>]</span><br><span class="line"></span><br><span class="line">dataset = tf.data.Dataset.from_tensor_slices((features, labels))</span><br><span class="line">dataset = dataset.map(...)  <span class="comment"># Parse the record into tensors.</span></span><br><span class="line"><span class="comment">#&#x968F;&#x673A;&#x91CD;&#x6392;&#x8F93;&#x5165;&#x6570;&#x636E;&#x96C6;&#xFF1A;&#x5B83;&#x4F1A;&#x7EF4;&#x6301;&#x4E00;&#x4E2A;&#x56FA;&#x5B9A;&#x5927;&#x5C0F;&#x7684;&#x7F13;&#x51B2;&#x533A;&#xFF0C;&#x5E76;&#x4ECE;&#x8BE5;&#x7F13;&#x51B2;&#x533A;&#x7EDF;&#x4E00;&#x5730;&#x968F;&#x673A;&#x9009;&#x62E9;&#x4E0B;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x3002;</span></span><br><span class="line">dataset = dataset.shuffle(buffersize=<span class="number">1000</span>)</span><br><span class="line"><span class="comment">#&#x5C06;&#x6570;&#x636E;&#x96C6;&#x4E2D;&#x7684;n&#x4E2A;&#x8FDE;&#x7EED;&#x5143;&#x7D20;&#x5806;&#x53E0;&#x4E3A;&#x4E00;&#x4E2A;&#x5143;&#x7D20;&#x3002;</span></span><br><span class="line">dataset = dataset.batch(<span class="number">32</span>)</span><br><span class="line"><span class="comment"># &#x5F53;count=None/-1 &#x65F6;&#x91CD;&#x590D;&#x65E0;&#x9650;&#x6B21;&#xFF01;</span></span><br><span class="line">dataset = dataset.repeat(count=epoch)  </span><br><span class="line"><span class="comment">#&#x751F;&#x6210;&#x8FED;&#x4EE3;&#x5668;</span></span><br><span class="line">iterator = dataset.make_initializable_iterator()</span><br><span class="line">next_element = iterator.get_next()</span><br><span class="line">sess.run(iterator.initializer)</span><br><span class="line"><span class="keyword">while</span> <span class="keyword">True</span>:</span><br><span class="line">  <span class="keyword">try</span>:</span><br><span class="line">    sess.run(result)</span><br><span class="line">  <span class="keyword">except</span> tf.errors.OutOfRangeError:</span><br><span class="line">    <span class="keyword">break</span></span><br><span class="line"></span><br><span class="line"><span class="comment">#########       make_initializable_iterator &#x4E0E; make_one_shot_iterator &#x7684;&#x533A;&#x522B;   #################</span></span><br><span class="line">limit = tf.placeholder(dtype=tf.int32, shape=[])</span><br><span class="line">dataset = tf.data.Dataset.from_tensor_slices(tf.range(start=<span class="number">0</span>, limit=limit))</span><br><span class="line">iterator = dataset.make_initializable_iterator()</span><br><span class="line">next_element = iterator.get_next()</span><br><span class="line"><span class="comment">#&#x80FD;&#x591F;&#x4F7F;&#x7528;&#x53C2;&#x6570;&#x5316;&#xFF0C;feed&#x6570;&#x636E;&#x3002;&#x5FC5;&#x987B;&#x624B;&#x52A8;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x591A;&#x6B21;&#x521D;&#x59CB;&#x5316;&#xFF01;</span></span><br><span class="line">sess.run(iterator.initializer, feed_dict={limit: <span class="number">10</span>})</span><br><span class="line">sess.run(next_element)</span><br><span class="line">//////////////</span><br><span class="line">iterator = dataset.make_one_shot_iterator()</span><br><span class="line"><span class="comment">#&#x4E0D;&#x80FD;&#x4F7F;&#x7528;&#x53C2;&#x6570;&#xFF0C;&#x4E14;&#x6570;&#x636E;&#x8FC7;&#x4E00;&#x904D;&#x5C31;&#x6CA1;&#x4E86;&#x3002;&#x4F46;&#x4E0D;&#x9700;&#x8981;&#x521D;&#x59CB;&#x5316;&#x3002;</span></span><br><span class="line">one_element = iterator.get_next()</span><br><span class="line">sess.run(one_element)</span><br><span class="line"></span><br><span class="line"><span class="comment">##########################################  .batch    ##########################################</span></span><br><span class="line">inc_dataset = tf.data.Dataset.range(<span class="number">100</span>)</span><br><span class="line">dec_dataset = tf.data.Dataset.range(<span class="number">0</span>, <span class="number">-100</span>, <span class="number">-1</span>)</span><br><span class="line">dataset = tf.data.Dataset.zip((inc_dataset, dec_dataset))</span><br><span class="line">batched_dataset = dataset.batch(<span class="number">4</span>)</span><br><span class="line">iterator = batched_dataset.make_one_shot_iterator()</span><br><span class="line">next_element = iterator.get_next()</span><br><span class="line">print(sess.run(next_element))  <span class="comment"># ==&gt; ([0, 1, 2,   3],   [ 0, -1,  -2,  -3])</span></span><br><span class="line">print(sess.run(next_element))  <span class="comment"># ==&gt; ([4, 5, 6,   7],   [-4, -5,  -6,  -7])</span></span><br><span class="line">print(sess.run(next_element))  <span class="comment"># ==&gt; ([8, 9, 10, 11],   [-8, -9, -10, -11])</span></span><br><span class="line"></span><br><span class="line"><span class="comment">##########################################  .repeat   ########################################</span></span><br><span class="line"><span class="comment">#&#x8981;&#x8FED;&#x4EE3;&#x6570;&#x636E;&#x96C6;&#x591A;&#x4E2A;&#x5468;&#x671F;&#xFF0C;&#x6700;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x4F7F;&#x7528; Dataset.repeat() &#x8F6C;&#x6362;&#x3002;</span></span><br><span class="line"><span class="comment">#&#x5E94;&#x7528;&#x4E0D;&#x5E26;&#x53C2;&#x6570;&#x7684; Dataset.repeat() &#x8F6C;&#x6362;&#x5C06;&#x65E0;&#x9650;&#x6B21;&#x5730;&#x91CD;&#x590D;&#x8F93;&#x5165;&#x3002;Dataset.repeat() &#x8F6C;&#x6362;&#x5C06;&#x5176;&#x53C2;&#x6570;&#x8FDE;&#x63A5;&#x8D77;&#x6765;&#xFF0C;&#x800C;&#x4E0D;&#x4F1A;#&#x5728;&#x4E00;&#x4E2A;&#x5468;&#x671F;&#x7ED3;&#x675F;&#x548C;&#x4E0B;&#x4E00;&#x4E2A;&#x5468;&#x671F;&#x5F00;&#x59CB;&#x65F6;&#x53D1;&#x51FA;&#x4FE1;&#x53F7;!&#x6240;&#x4EE5;&#x6CA1;&#x6CD5;&#x5728;&#x6BCF;&#x4E2A;epoch&#x540E;&#x8FDB;&#x884C;&#x76F8;&#x5E94;&#x5904;&#x7406;&#xFF01;&#xFF01;&#xFF01;</span></span><br><span class="line">dataset = dataset.repeat(num_epochs)</span><br><span class="line">iterator = dataset.make_one_shot_iterator()</span><br><span class="line">next_example, next_label = iterator.get_next()</span><br><span class="line">loss = model_function(next_example, next_label)</span><br><span class="line">training_op = tf.train.AdagradOptimizer(...).minimize(loss)</span><br><span class="line"><span class="keyword">with</span> tf.train.MonitoredTrainingSession(...) <span class="keyword">as</span> sess:  <span class="comment">#&#x76F8;&#x5F53;&#x4E8E;&#x76D1;&#x63A7;&#x4E86;tf.errors.OutOfRangeError</span></span><br><span class="line">  <span class="keyword">while</span> <span class="keyword">not</span> sess.should_stop():</span><br><span class="line">    sess.run(training_op)</span><br><span class="line"><span class="comment">#&#x5982;&#x679C;&#x60F3;&#x5728;&#x6BCF;&#x4E2A;&#x5468;&#x671F;&#x7ED3;&#x675F;&#x65F6;&#x6536;&#x5230;&#x4FE1;&#x53F7;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x7F16;&#x5199;&#x5728;&#x6570;&#x636E;&#x96C6;&#x7ED3;&#x675F;&#x65F6;&#x6355;&#x83B7; tf.errors.OutOfRangeError &#x7684;&#x8BAD;&#x7EC3;&#x5FAA;&#x73AF;&#x3002;</span></span><br><span class="line"><span class="comment"># Compute for 100 epochs.&#x4E0D;&#x7528;.repeat()!!</span></span><br><span class="line"><span class="keyword">for</span> _ <span class="keyword">in</span> range(<span class="number">100</span>):</span><br><span class="line">  sess.run(iterator.initializer)</span><br><span class="line">  <span class="keyword">while</span> <span class="keyword">True</span>:</span><br><span class="line">    <span class="keyword">try</span>:</span><br><span class="line">      sess.run(next_element)</span><br><span class="line">    <span class="keyword">except</span> tf.errors.OutOfRangeError:</span><br><span class="line">      <span class="keyword">break</span></span><br><span class="line">  <span class="comment"># [Perform end-of-epoch calculations here.]</span></span><br></pre></td></tr></tbody></table></figure><script>        document.querySelectorAll('.github-emoji')          .forEach(el => {            if (!el.dataset.src) { return; }            const img = document.createElement('img');            img.style = 'display:none !important;';            img.src = el.dataset.src;            img.addEventListener('error', () => {              img.remove();              el.style.color = 'inherit';              el.style.backgroundImage = 'none';              el.style.background = 'none';            });            img.addEventListener('load', () => {              img.remove();            });            document.body.appendChild(img);          });      </script>]]></content>
    
    <summary type="html">
    
      对TensorFlow中常用函数的整理
    
    </summary>
    
      <category term="机器学习" scheme="https://cenleiding.github.io/categories/%E6%9C%BA%E5%99%A8%E5%AD%A6%E4%B9%A0/"/>
    
    
      <category term="TensorFlow,机器学习.API" scheme="https://cenleiding.github.io/tags/TensorFlow-%E6%9C%BA%E5%99%A8%E5%AD%A6%E4%B9%A0-API/"/>
    
  </entry>
  
  <entry>
    <title>word2vec词向量</title>
    <link href="https://cenleiding.github.io/word2vec.html"/>
    <id>https://cenleiding.github.io/word2vec.html</id>
    <published>2018-10-09T13:43:32.000Z</published>
    <updated>2018-10-09T13:52:52.799Z</updated>
    
    <content type="html"><![CDATA[<p>&#x200B;word2vec&#x6574;&#x4F53;&#x601D;&#x8DEF;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x5F88;&#x7B80;&#x5355;&#x7684;&#xFF08;&#x5F53;&#x7136;&#x53EF;&#x80FD;&#x662F;&#x56E0;&#x4E3A;&#x6211;&#x5B66;&#x7684;&#x6BD4;&#x8F83;&#x6D45; &#x1F622;&#xFF09;</p><p>&#x8BE6;&#x7EC6;&#x7684;&#x53EF;&#x4EE5;&#x770B; TensorFlow &#x5B98;&#x7F51;&#x7ED9;&#x51FA;&#x7684;&#x6559;&#x7A0B;&#xFF0C;&#x53EF;&#x4EE5;&#x81EA;&#x5DF1;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#x4E00;&#x4E0B;<a href="http://www.tensorfly.cn/tfdoc/tutorials/word2vec.html" target="_blank" rel="noopener">&#x6559;&#x7A0B;</a></p><p>&#x8FD9;&#x91CC;&#x53EA;&#x8FDB;&#x884C;&#x7B80;&#x5355;&#x7684;&#x4ECB;&#x7ECD;&#xFF0C;&#x5BF9;&#x4E00;&#x4E9B;&#x91CD;&#x8981;&#x6982;&#x5FF5;&#x8FDB;&#x884C;&#x68B3;&#x7406;&#xFF1A;</p><p><img src="/word2vec/word2vec_1.png" alt="word2vec"></p><blockquote><p>&#x9996;&#x5148;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x8FDB;&#x884C;word embeddings?</p></blockquote><p>&#x6211;&#x4EEC;&#x65E2;&#x7136;&#x8981;&#x5904;&#x7406;&#x81EA;&#x7136;&#x8BED;&#x8A00;&#xFF0C;&#x90A3;&#x4E48;&#x9996;&#x5148;&#x5C31;&#x9700;&#x8981;&#x5C06;&#x5176;&#x8F6C;&#x6362;&#x6210;&#x7535;&#x8111;&#x80FD;&#x770B;&#x61C2;&#x7684;&#x5F62;&#x5F0F;&#x3002;&#x6700;&#x7B80;&#x5355;&#x7684;&#x5C31;&#x662F;&#x7528;<strong>one-hot encode</strong> &#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x53CA;&#x6BCF;&#x4E2A;&#x5411;&#x91CF;&#x53EA;&#x6709;&#x4E00;&#x4F4D;&#x4E3A;1&#x5176;&#x4F59;&#x4E3A;0&#xFF0C;&#x7528;&#x4E00;&#x4E2A;&#x5411;&#x91CF;&#x8868;&#x793A;&#x4E00;&#x4E2A;&#x76EE;&#x6807;&#xFF08;&#x6CE8;&#x610F;&#x8FD9;&#x4E2A;&#x76EE;&#x6807;&#x7406;&#x89E3;&#x4E3A;token&#xFF0C;&#x53EF;&#x4EE5;&#x662F;&#x5B57;&#x4E5F;&#x53EF;&#x4EE5;&#x662F;&#x8BCD;&#xFF0C;&#x53E5;&#x5B50;&#x3001;&#x6587;&#x7AE0;&#x4EC0;&#x4E48;&#x7684;&#x8FD9;&#x91CC;&#x4E0D;&#x8003;&#x8651;~&#xFF09;&#x3002;&#x4F46;&#x662F;&#x8FD9;&#x6837;&#x8868;&#x793A;&#x7684;&#x8BDD;&#xFF0C;&#x90FD;&#x662F;&#x7A00;&#x758F;&#x5411;&#x91CF;&#xFF08;sparse vector&#xFF09;&#xFF0C;&#x4E0D;&#x4F46;&#x5360;&#x4F4D;&#x5B50;&#x800C;&#x4E14;&#x5411;&#x91CF;&#x4E4B;&#x95F4;&#x90FD;&#x6BEB;&#x65E0;&#x5173;&#x7CFB;&#xFF0C;&#x8FD9;&#x5BF9;&#x4E8E;&#x540E;&#x7EED;&#x7684;&#x5904;&#x7406;&#x65E0;&#x7591;&#x662F;&#x5F88;&#x4E0D;&#x5229;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x80FD;&#x591F;&#x8868;&#x793A;&#x5404;&#x4E2A;&#x8BCD;&#x4E4B;&#x95F4;&#x5173;&#x7CFB;&#x7684;&#x7A20;&#x5BC6;&#x5411;&#x91CF;&#xFF08;dense vector&#xFF09;&#x6765;&#x8868;&#x793A;&#x76EE;&#x6807;&#x3002;&#x4E8E;&#x662F;&#x5C31;&#x9700;&#x8981;&#x8FDB;&#x884C;word embedding,&#x6765;&#x5F97;&#x5230;&#x8BCD;&#x5411;&#x91CF;&#x7A7A;&#x95F4;&#x3002;</p><blockquote><p>&#x80FD;&#x591F;&#x7528;&#x5411;&#x91CF;&#x8868;&#x793A;&#x8BCD;&#x4E4B;&#x95F4;&#x5173;&#x7CFB;&#x7684;&#x539F;&#x7406;&#x662F;&#x4EC0;&#x4E48;&#xFF1F;</p></blockquote><p>&#x4F9D;&#x8D56;&#x4E8E;<strong>&#x5206;&#x5E03;&#x5F0F;&#x5047;&#x8BBE; distributional hypothesis</strong> &#xFF0C;&#x5177;&#x4F53;&#x53EF;&#x5206;&#x4E3A;&#x4E24;&#x7C7B;&#xFF1A;</p><p><strong>&#x57FA;&#x4E8E;&#x8BA1;&#x6570;&#x7684;&#x65B9;&#x6CD5;</strong>&#xFF1A;&#x8BA1;&#x7B97;&#x67D0;&#x8BCD;&#x6C47;&#x4E0E;&#x5176;&#x90BB;&#x8FD1;&#x8BCD;&#x6C47;&#x5728;&#x4E00;&#x4E2A;&#x5927;&#x578B;&#x8BED;&#x6599;&#x5E93;&#x4E2D;&#x5171;&#x540C;&#x51FA;&#x73B0;&#x7684;&#x9891;&#x7387;&#x53CA;&#x5176;&#x4ED6;&#x7EDF;&#x8BA1;&#x91CF;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x8FD9;&#x4E9B;&#x7EDF;&#x8BA1;&#x91CF;&#x6620;&#x5C04;&#x5230;&#x4E00;&#x4E2A;&#x5C0F;&#x578B;&#x4E14;&#x7A20;&#x5BC6;&#x7684;&#x5411;&#x91CF;&#x4E2D;&#x3002;</p><p><strong>&#x57FA;&#x4E8E;&#x9884;&#x6D4B;&#x65B9;&#x6CD5;</strong>&#xFF1A;&#x8BD5;&#x56FE;&#x76F4;&#x63A5;&#x4ECE;&#x67D0;&#x8BCD;&#x6C47;&#x7684;&#x90BB;&#x8FD1;&#x8BCD;&#x6C47;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x9884;&#x6D4B;&#xFF0C;&#x5728;&#x6B64;&#x8FC7;&#x7A0B;&#x4E2D;&#x5229;&#x7528;&#x5DF2;&#x7ECF;&#x5B66;&#x4E60;&#x5230;&#x7684;&#x5C0F;&#x578B;&#x4E14;&#x7A20;&#x5BC6;&#x7684;<em>&#x5D4C;&#x5957;&#x5411;&#x91CF;</em>&#x3002;</p><p>&#x1F602;&#x56E0;&#x4E3A;&#x61D2;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x91CC;&#x53EA;&#x4E86;&#x89E3;&#x4E86;&#x4E00;&#x4E0B;&#x57FA;&#x4E8E;&#x9884;&#x6D4B;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p><blockquote><p>&#x600E;&#x4E48;&#x57FA;&#x4E8E;&#x9884;&#x6D4B;&#xFF1F;</p></blockquote><p>&#x9884;&#x6D4B;&#xFF0C;&#x9884;&#x6D4B;&#x3002;&#x5F88;&#x660E;&#x663E;&#x5C31;&#x662F;&#x8981;&#x7528;&#x5230;&#x8FD9;&#x4E2A;&#x8BCD;&#x7684;&#x5468;&#x56F4;&#x8BCD;&#x4E86;&#x3002;&#x9884;&#x6D4B;&#x65B9;&#x6CD5;&#x5206;&#x4E3A;&#x4E24;&#x7C7B;&#xFF1A;</p><p><strong>&#x8FDE;&#x7EED;&#x8BCD;&#x888B;&#x6A21;&#x578B;&#xFF08;CBOW&#xFF09;</strong>&#xFF1A;&#x6839;&#x636E;&#x4E0A;&#x4E0B;&#x6587;&#x8BCD;&#x6C47;&#x6765;&#x9884;&#x6D4B;&#x76EE;&#x6807;&#x8BCD;&#x6C47;&#x3002;&#x5BF9;&#x4E8E;&#x5F88;&#x591A;&#x5206;&#x5E03;&#x5F0F;&#x4FE1;&#x606F;&#x8FDB;&#x884C;&#x4E86;&#x5E73;&#x6ED1;&#x5904;&#x7406;&#xFF08;&#x4F8B;&#x5982;&#x5C06;&#x4E00;&#x6574;&#x6BB5;&#x4E0A;&#x4E0B;&#x6587;&#x4FE1;&#x606F;&#x89C6;&#x4E3A;&#x4E00;&#x4E2A;&#x5355;&#x4E00;&#x89C2;&#x5BDF;&#x91CF;&#xFF09;&#x3002;&#x5F88;&#x591A;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5BF9;&#x4E8E;<strong>&#x5C0F;&#x578B;&#x7684;&#x6570;&#x636E;&#x96C6;</strong>&#xFF0C;&#x8FD9;&#x4E00;&#x5904;&#x7406;&#x662F;&#x6709;&#x5E2E;&#x52A9;&#x7684;&#x3002;</p><p><strong>Skip-Gram&#x6A21;&#x578B;</strong>&#xFF1A;&#x901A;&#x8FC7;&#x76EE;&#x6807;&#x8BCD;&#x6C47;&#x6765;&#x9884;&#x6D4B;&#x4E0A;&#x4E0B;&#x6587;&#x8BCD;&#x6C47;&#x3002;&#x5C06;&#x6BCF;&#x4E2A;&#x201C;&#x4E0A;&#x4E0B;&#x6587;-&#x76EE;&#x6807;&#x8BCD;&#x6C47;&#x201D;&#x7684;&#x7EC4;&#x5408;&#x89C6;&#x4E3A;&#x4E00;&#x4E2A;&#x65B0;&#x89C2;&#x5BDF;&#x91CF;&#xFF0C;&#x8FD9;&#x79CD;&#x505A;&#x6CD5;&#x5728;<strong>&#x5927;&#x578B;&#x6570;&#x636E;&#x96C6;</strong>&#x4E2D;&#x4F1A;&#x66F4;&#x4E3A;&#x6709;&#x6548;&#x3002;</p><p>&#x7B80;&#x5355;&#x6765;&#x8BF4;&#x5C31;&#x662F;&#x5BF9;&#x4E8E;&#x201D;&#x6211;&#x7231;&#x4F60;&#x201D;&#x8FD9;&#x53E5;&#xFF0C;&#x7231;&#x4F5C;&#x4E3A;&#x76EE;&#x6807;&#x8BCD;&#xFF0C;cbow&#x6A21;&#x578B;&#x9700;&#x8981;&#x7531;&#x2018;&#x7231;&#x2019;&#x63A8;&#x51FA;&#x2018;&#x6211;&#x2019;&#x3001;&#x2018;&#x4F60;&#x2019;&#xFF0C;&#x800C;skip-gram&#x6A21;&#x578B;&#x5219;&#x662F;&#x8981;&#x7531;&#x2018;&#x6211;&#x2019;&#x63A8;&#x51FA;&#x2018;&#x7231;&#x2019;&#xFF0C;&#x2018;&#x4F60;&#x2019;&#x63A8;&#x51FA;&#x2018;&#x7231;&#x2019;&#x3002;&#x5728;&#x4EE3;&#x7801;&#x5177;&#x4F53;&#x5B9E;&#x73B0;&#x65F6;&#xFF0C;&#x53EA;&#x8981;&#x7A0D;&#x4F5C;&#x4FEE;&#x6539;&#x5373;&#x53EF;&#x3002;</p><blockquote><p>&#x600E;&#x4E48;&#x8BC4;&#x4F30;&#x8FD9;&#x4E2A;&#x9884;&#x6D4B;&#x503C;&#xFF08;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#xFF09;&#xFF1F;</p></blockquote><p><strong>softmax function &#xFF1F;</strong>&#x5BF9;&#x4E8E;&#x8FD9;&#x79CD;&#x6982;&#x7387;&#x578B;&#x7684;&#x95EE;&#x9898;&#xFF0C;softmax function &#x5F53;&#x7136;&#x53EF;&#x4EE5;&#x3002;&#x4F46;&#x7528;softmax function&#x5728;&#x8FD9;&#x91CC;&#x6709;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4E3A;&#x4E86;&#x6C42;&#x51FA;&#x6982;&#x7387;&#xFF0C;&#x4ED6;&#x9700;&#x8981;&#x5C06;&#x6240;&#x6709;&#x7684;&#x5176;&#x4ED6;&#x8BCD;&#x7684;&#x6982;&#x7387;&#x5F97;&#x5206;&#x90FD;&#x6C42;&#x4E00;&#x904D;,&#x867D;&#x7136;&#x8FD9;&#x6837;&#x4F1A;&#x6BD4;&#x8F83;&#x51C6;&#x786E;&#xFF0C;&#x4F46;&#x5F00;&#x9500;&#x5B9E;&#x5728;&#x592A;&#x5927;&#xFF0C;&#x9664;&#x975E;&#x4F60;&#x7535;&#x8111;&#x771F;&#x725B;&#x903C;&#xFF0C;&#x4E0D;&#x7136;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x3002;</p><p><strong>&#x8D1F;&#x91C7;&#x6837; negative sample &#xFF1A;</strong> &#x6211;&#x4EEC;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x5BF9;&#x6240;&#x6709;&#x4E0A;&#x4E0B;&#x6587;&#x7684;&#x8BCD;&#x90FD;&#x8FDB;&#x884C;&#x8BC4;&#x5206;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x628A;&#x95EE;&#x9898;&#x7B80;&#x5316;&#x4E3A;&#xFF1A;&#x73B0;&#x5728;&#x6709;&#x6211;&#x4EEC;&#x7684;&#x9884;&#x6D4B;&#x503C;&#xFF0C;&#x76EE;&#x6807;&#x5355;&#x8BCD;&#xFF0C;&#x548C;&#x4E00;&#x4E9B;&#x566A;&#x58F0;&#x5355;&#x8BCD;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x8981;&#x76EE;&#x6807;&#x5355;&#x8BCD;&#x88AB;&#x5206;&#x914D;&#x5230;&#x8F83;&#x9AD8;&#x7684;&#x6982;&#x7387;&#xFF0C;&#x540C;&#x65F6;&#x566A;&#x58F0;&#x5355;&#x8BCD;&#x7684;&#x6982;&#x7387;&#x5F88;&#x4F4E;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x9AD8;&#x5174;&#x7684;&#x8BA4;&#x4E3A;&#x8FD9;&#x4E2A;&#x9884;&#x6D4B;&#x662F;&#x597D;&#x7684;&#x3002;&#x7136;&#x540E;&#x8FD9;&#x4E2A;&#x5206;&#x914D;&#x6982;&#x7387;&#x600E;&#x4E48;&#x6C42;&#xFF1F;&#x8FD9;&#x53EF;&#x4EE5;&#x5F53;&#x505A;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x4E8C;&#x5206;&#x7C7B;&#x903B;&#x8F91;&#x56DE;&#x5F52;&#x95EE;&#x9898;&#x3002;&#x4E8E;&#x662F;&#x6211;&#x4EEC;&#x5C31;&#x6109;&#x5FEB;&#x7684;&#x5F97;&#x5230;&#x4E86;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x4EE3;&#x4EF7;&#x51FD;&#x6570;&#x3002;</p><blockquote><p>&#x5177;&#x4F53;&#x7684;&#x5B9E;&#x73B0;&#x662F;&#x600E;&#x4E48;&#x6837;&#x7684;&#xFF1F;</p></blockquote><p><img src="/word2vec/word2vec_2.png" alt="img"></p><p><strong>projection layer&#xFF1A;</strong> &#x8FD9;&#x4E00;&#x5C42;&#x8F93;&#x5165;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x8BCD;&#x7684;one-hot&#x7F16;&#x7801;&#xFF0C;&#x5927;&#x5C0F;&#x4E3A;[1*&#x8BCD;&#x603B;&#x91CF;]&#xFF0C;&#x4E3A;&#x4E86;&#x7B80;&#x5355;&#x4E5F;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x4E3A;&#x6BCF;&#x4E2A;&#x8BCD;&#x7684;&#x552F;&#x4E00;id&#x503C;&#x3002;</p><p><strong>g(embedding)&#xFF1A;</strong> &#x8FD9;&#x662F;&#x4E00;&#x4E2A;[&#x8BCD;&#x603B;&#x91CF; * &#x8BCD;&#x5411;&#x91CF;&#x957F;&#x5EA6;]&#x7684;&#x77E9;&#x9635;&#x53C2;&#x6570;&#xFF0C;&#x5176;&#x4E2D;&#x8BCD;&#x5411;&#x91CF;&#x957F;&#x5EA6;&#x662F;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#x5B9A;&#x4E49;&#x7684;&#x3002;&#x8FD9;&#x4E2A;&#x77E9;&#x9635;&#x4E3A;&#x6BCF;&#x4E2A;&#x8BCD;&#x90FD;&#x5206;&#x914D;&#x4E86;&#x4E00;&#x4E2A;&#x6307;&#x5B9A;&#x957F;&#x5EA6;&#x5411;&#x91CF;&#xFF0C;&#x8BF4;&#x767D;&#x4E86;&#x5C31;&#x662F;&#x4E00;&#x5F20;&#x6620;&#x5C04;&#x8868;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x671F;&#x671B;&#x5F97;&#x5230;&#x7684;&#x8BCD;&#x5411;&#x91CF;&#x7A7A;&#x95F4;&#x3002;</p><p><strong>hidden layer&#xFF1A;</strong> &#x8FD9;&#x4E00;&#x5C42;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x76F8;&#x5E94;&#x7684;&#x8BCD;&#x5411;&#x91CF;&#xFF0C;&#x4F5C;&#x4E3A;&#x9884;&#x6D4B;&#x503C;&#x3002;</p><p><strong>noise classifier&#xFF1A;</strong> &#x8FD9;&#x4E00;&#x5C42;&#x662F;&#x4E00;&#x4E2A;&#x903B;&#x8F91;&#x56DE;&#x5F52;&#x3002;&#x8BBE;&#x6709;&#x53C2;&#x6570;&#x548C;&#x504F;&#x7F6E;&#x3002;TensorFlow&#x4E2D;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x7528;nce&#x51FD;&#x6570;&#x5B9E;&#x73B0;&#x3002;</p><p><strong>&#x8BAD;&#x7EC3;&#xFF1A;</strong> &#x4F7F;&#x7528;&#x5E38;&#x89C4;&#x7684;&#x68AF;&#x5EA6;&#x4E0B;&#x964D;&#xFF0C;&#x8C03;&#x6574;&#x5404;&#x4E2A;&#x53C2;&#x6570;&#x503C;&#x3002;</p><blockquote><p>&#x4E00;&#x4E9B;&#x5FC3;&#x5F97;</p></blockquote><p><strong>nec &#x51FD;&#x6570;&#xFF1A;</strong> </p><figure class="highlight python"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br></pre></td><td class="code"><pre><span class="line"><span class="function"><span class="keyword">def</span> <span class="title">nce_loss</span><span class="params">(weights, biases, inputs, labels, num_sampled, num_classes,</span></span></span><br><span class="line"><span class="function"><span class="params">             num_true=<span class="number">1</span>,</span></span></span><br><span class="line"><span class="function"><span class="params">             sampled_values=None,</span></span></span><br><span class="line"><span class="function"><span class="params">             remove_accidental_hits=False,</span></span></span><br><span class="line"><span class="function"><span class="params">             partition_strategy=<span class="string">&quot;mod&quot;</span>,</span></span></span><br><span class="line"><span class="function"><span class="params">             name=<span class="string">&quot;nce_loss&quot;</span>)</span></span></span><br></pre></td></tr></tbody></table></figure><p>weights,biases:&#x903B;&#x8F91;&#x56DE;&#x5F52;&#x7684;&#x53C2;&#x6570;</p><p>input,labels:&#x9884;&#x6D4B;&#x503C;&#xFF0C;&#x771F;&#x5B9E;&#x503C;</p><p>num_sampled:&#x91C7;&#x6837;&#x6570;</p><p>num_classes&#xFF1A;&#x8BCD;&#x603B;&#x6570;</p><p>&#x8FD9;&#x4E9B;&#x53C2;&#x6570;&#x90FD;&#x6CA1;&#x4EC0;&#x4E48;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x662F;sampled_values&#x4E3A;&#x4EC0;&#x4E48;&#x9ED8;&#x8BA4;&#x4E3A;None?&#x770B;&#x6E90;&#x7801;&#x53EF;&#x4EE5;&#x53D1;&#x73B0;&#xFF0C;&#x5176;&#x9ED8;&#x8BA4;&#x4F7F;&#x7528;log_uniform_candidate_sampler&#x51FD;&#x6570;&#x91C7;&#x6837;&#xFF0C;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;P(k)&#xFF0C;k&#x8D8A;&#x5927;&#xFF0C;&#x88AB;&#x91C7;&#x6837;&#x5230;&#x7684;&#x6982;&#x7387;&#x8D8A;&#x5C0F;&#x3002;&#x8FD9;&#x91CC;&#x7684;k&#x5C31;&#x662F;&#x8BCD;&#x7684;&#x7F16;&#x53F7;&#x3002;&#x5F88;&#x660E;&#x663E;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x8BA9;&#x9AD8;&#x9891;&#x8BCD;&#x88AB;&#x91C7;&#x5230;&#x7684;&#x6982;&#x7387;&#x66F4;&#x5927;&#x4E00;&#x70B9;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x5B9E;&#x73B0;&#x7684;&#x65F6;&#x5019;&#x9700;&#x8981;&#x5C06;&#x9AD8;&#x9891;&#x8BCD;&#x653E;&#x5728;&#x524D;&#x9762;&#x4F7F;&#x5176;&#x7F16;&#x53F7;&#x5C0F;&#x3002;</p><p><strong>gensim&#xFF1A;</strong></p><p>&#x867D;&#x7136;&#x81EA;&#x5DF1;&#x4E5F;&#x8DDF;&#x7740;&#x6559;&#x7A0B;&#x5B9E;&#x73B0;&#x4E86;&#x4E00;&#x4E0B;&#x7A0B;&#x5E8F;&#xFF0C;&#x4E5F;&#x80FD;&#x7528;&#xFF0C;&#x4F46;&#x5B9E;&#x9645;&#x4F7F;&#x7528;&#x65F6;&#x5F53;&#x7136;&#x9009;&#x62E9;&#x522B;&#x4EBA;&#x63D0;&#x4F9B;&#x7684;&#x5DE5;&#x5177;&#x6A21;&#x5757;&#x3002;</p><p>&#x4E8E;&#x662F;&#x5B9E;&#x9645;&#x7528;&#x4E86;gensim&#x6765;&#x8FDB;&#x884C;&#x8BCD;&#x5D4C;&#x5165;&#x3002;&#x63A5;&#x53E3;&#x662F;&#x5426;&#x7B80;&#x5355;&#xFF0C;&#x6CA1;&#x4EC0;&#x4E48;&#x597D;&#x8BB2;&#x3002;</p><p>&#x4F46;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;gensim&#x91CC;&#x8BAD;&#x7EC3;&#x51FA;&#x6765;&#x7684;&#x8BCD;&#x5411;&#x91CF;&#x7A7A;&#x95F4;&#x6CA1;&#x6709;&#x5305;&#x62EC;&#x4F4E;&#x9891;&#x8BCD;&#xFF01;&#xFF01;&#xFF01;&#xFF01;&#x800C;TensorFlow&#x7684;demo&#x91CC;&#x662F;&#x5C06;&#x4F4E;&#x9891;&#x8BCD;&#x7EDF;&#x4E00;&#x8F6C;&#x6362;&#x6210;&#x540C;&#x4E00;&#x4E2A;&#x6807;&#x5FD7;&#x4E00;&#x8D77;&#x5904;&#x7406;&#x7684;&#x3002;&#x800C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x4F4E;&#x9891;&#x8BCD;&#x7684;&#x5411;&#x91CF;&#xFF0C;&#x90A3;&#x5C31;&#x6CA1;&#x6CD5;&#x5B8C;&#x6574;&#x7684;&#x5BF9;&#x6240;&#x6709;&#x5355;&#x8BCD;&#x8FDB;&#x884C;&#x8F6C;&#x6362;&#x4E86;&#xFF0C;&#x6240;&#x4EE5;&#x7528;gensim&#x65F6;&#x8FD8;&#x8981;&#x81EA;&#x5DF1;&#x5BF9;&#x4F4E;&#x9891;&#x8BCD;&#x8FDB;&#x884C;&#x5904;&#x7406;&#xFF0C;&#x53EF;&#x4EE5;&#x4E8B;&#x5148;&#x9884;&#x5904;&#x7406;&#x6587;&#x672C;&#x4E5F;&#x53EF;&#x4EE5;&#x6700;&#x540E;&#x5C06;&#x4F4E;&#x9891;&#x8BCD;&#x8D4B;&#x503C;&#x4E3A;0&#x5411;&#x91CF;&#x3002;</p><p>&#x53E6;&#x5916;gensim&#x8BAD;&#x7EC3;&#x51FA;&#x6765;&#x7684;&#x662F;&#x4E00;&#x4E2A;model&#xFF0C;&#x4E3A;&#x4E86;&#x80FD;&#x4EE5;&#x540E;&#x4F7F;&#x7528;&#x65B9;&#x4FBF;&#xFF0C;&#x6700;&#x597D;&#x5C06;&#x5176;&#x8F6C;&#x5316;&#x4E3A;word2id&#x548C;word2vec&#x4E24;&#x4E2A;&#x6587;&#x4EF6;&#x3002;</p><p>&#x6700;&#x540E;&#x653E;&#x5F20;&#x56FE;,&#x4EC0;&#x4E48;&#x90FD;&#x6CA1;&#x4F18;&#x5316;&#xFF0C;&#x5355;&#x7EAF;&#x5206;&#x8BCD;+&#x8BCD;&#x5D4C;&#x5165;&#xFF1A;</p><p><img src="/word2vec/word2vec_3.png" alt="img"></p><p><a href="https://github.com/cenleiding/learning-Machine-Learning/tree/master/gensim_w2v" target="_blank" rel="noopener">&#x7A0B;&#x5E8F;&#x4EE3;&#x7801;</a></p><script>        document.querySelectorAll('.github-emoji')          .forEach(el => {            if (!el.dataset.src) { return; }            const img = document.createElement('img');            img.style = 'display:none !important;';            img.src = el.dataset.src;            img.addEventListener('error', () => {              img.remove();              el.style.color = 'inherit';              el.style.backgroundImage = 'none';              el.style.background = 'none';            });            img.addEventListener('load', () => {              img.remove();            });            document.body.appendChild(img);          });      </script>]]></content>
    
    <summary type="html">
    
      word2vec词嵌入
    
    </summary>
    
      <category term="机器学习" scheme="https://cenleiding.github.io/categories/%E6%9C%BA%E5%99%A8%E5%AD%A6%E4%B9%A0/"/>
    
    
      <category term="机器学习" scheme="https://cenleiding.github.io/tags/%E6%9C%BA%E5%99%A8%E5%AD%A6%E4%B9%A0/"/>
    
  </entry>
  
  <entry>
    <title>机器学习模型的评估与选择</title>
    <link href="https://cenleiding.github.io/%E6%9C%BA%E5%99%A8%E5%AD%A6%E4%B9%A0%E6%A8%A1%E5%9E%8B%E7%9A%84%E8%AF%84%E4%BC%B0%E4%B8%8E%E9%80%89%E6%8B%A9.html"/>
    <id>https://cenleiding.github.io/机器学习模型的评估与选择.html</id>
    <published>2018-10-09T12:57:37.000Z</published>
    <updated>2018-10-09T13:42:09.617Z</updated>
    
    <content type="html"><![CDATA[<p>&#x901A;&#x8FC7;&#x7B97;&#x6CD5;&#x5B66;&#x4E60;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x6570;&#x636E;&#x7684;&#x6A21;&#x578B;&#xFF0C;&#x4F46;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x600E;&#x4E48;&#x8BC4;&#x4F30;&#x8FD9;&#x4E2A;&#x6A21;&#x578B;&#x597D;&#x574F;&#xFF0C;&#x600E;&#x4E48;&#x4E0E;&#x5176;&#x4ED6;&#x6A21;&#x578B;&#x6BD4;&#x8F83;&#xFF1F;</p><h2 id="1-&#x8BEF;&#x5DEE;&#x4E0E;&#x62DF;&#x5408;"><a href="#1-&#x8BEF;&#x5DEE;&#x4E0E;&#x62DF;&#x5408;" class="headerlink" title="1.&#x8BEF;&#x5DEE;&#x4E0E;&#x62DF;&#x5408;"></a>1.&#x8BEF;&#x5DEE;&#x4E0E;&#x62DF;&#x5408;</h2><p><code>&#x9519;&#x8BEF;&#x7387; error rate</code>&#xFF1A;&#x5206;&#x7C7B;&#x9519;&#x8BEF;&#x7684;&#x6837;&#x672C;&#x6570;&#x5360;&#x603B;&#x6837;&#x672C;&#x7684;&#x6BD4;&#x4F8B;&#x3002;</p><p><code>&#x7CBE;&#x5EA6; accuracy</code>&#xFF1A; 1-&#x9519;&#x8BEF;&#x7387;&#x3002;</p><p><code>&#x8BEF;&#x5DEE; error</code>&#xFF1A;&#x66F4;&#x4E00;&#x822C;&#x7684;&#x3001;&#x5B9E;&#x9645;&#x9884;&#x6D4B;&#x8F93;&#x51FA;&#x4E0E;&#x771F;&#x5B9E;&#x8F93;&#x51FA;&#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x5F02; &#x3002;</p><p><code>&#x8BAD;&#x7EC3;&#x8BEF;&#x5DEE; training error</code> &#x3001;<code>&#x7ECF;&#x9A8C;&#x8BEF;&#x5DEE; empirical error</code>&#xFF1A;&#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#x7684;&#x8BEF;&#x5DEE;&#x3002;</p><p><code>&#x6CDB;&#x5316;&#x8BEF;&#x5DEE; generalization</code>&#xFF1A;&#x5728;&#x65B0;&#x6837;&#x672C;&#x4E0A;&#x7684;&#x8BEF;&#x5DEE;&#x3002;</p><blockquote><p>&#x6BEB;&#x65E0;&#x7591;&#x95EE;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x76EE;&#x6807;&#x5F53;&#x7136;&#x662F;&#x4F7F;<em>&#x6CDB;&#x5316;&#x8BEF;&#x5DEE;</em>&#x5C3D;&#x53EF;&#x80FD;&#x5C0F;&#x3002;&#x4F46;&#x6211;&#x4EEC;&#x5E76;&#x4E0D;&#x77E5;&#x9053;&#x65B0;&#x6837;&#x672C;&#x4F1A;&#x662F;&#x4EC0;&#x4E48;<del>(&#x5982;&#x679C;&#x77E5;&#x9053;&#x5C31;&#x7528;&#x6765;&#x8BAD;&#x7EC3;&#x4E86;)</del>,&#x56E0;&#x6B64;&#x5B9E;&#x9645;&#x4E2D;&#x6211;&#x4EEC;&#x53EA;&#x80FD;&#x5C3D;&#x53EF;&#x80FD;&#x7684;&#x4F7F;&#x8BAD;&#x7EC3;&#x8BEF;&#x5DEE;&#x51CF;&#x5C0F;&#x3002;</p></blockquote><p><code>&#x8FC7;&#x62DF;&#x5408; overfitting</code>&#xFF1A; &#x5728;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#x8868;&#x73B0;&#x5F88;&#x597D;&#xFF0C;&#x4F46;&#x5728;&#x5B9E;&#x9645;&#x4F7F;&#x7528;&#x4E2D;&#x6CDB;&#x5316;&#x6027;&#x80FD;&#x4E0D;&#x4F73;&#x3002;</p><p><code>&#x6B20;&#x62DF;&#x5408; underfitting</code> : &#x8FDE;&#x8BAD;&#x7EC3;&#x96C6;&#x4E0A;&#x90FD;&#x672A;&#x5B66;&#x4E60;&#x597D;&#x3002;</p><blockquote><p>&#x6B20;&#x62DF;&#x5408;&#x662F;&#x6BD4;&#x8F83;&#x5BB9;&#x6613;&#x514B;&#x670D;&#x7684;&#xFF0C;&#x591A;&#x8BAD;&#x7EC3;&#x51E0;&#x8F6E;&#x5C31;&#x53EF;&#x4EE5;&#x4E86;&#x3002;</p><p>&#x4F46;&#x8FC7;&#x62DF;&#x5408;&#x5374;&#x5341;&#x5206;&#x9EBB;&#x70E6;&#xFF01;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x7684;&#x95EE;&#x9898;&#x5F80;&#x5F80;&#x662F;NP&#x96BE;&#x95EE;&#x9898;&#xFF0C;&#x7B80;&#x5355;&#x7684;&#x8BF4;&#x5C31;&#x662F;&#x65E0;&#x6CD5;&#x5728;&#x591A;&#x9879;&#x5F0F;&#x65F6;&#x95F4;&#x5185;&#x83B7;&#x5F97;&#x6700;&#x4F18;&#x89E3;&#xFF0C;&#x53EA;&#x80FD;&#x83B7;&#x5F97;&#x4E00;&#x4E2A;&#x8FD1;&#x4F3C;&#x3001;&#x5C40;&#x90E8;&#x6700;&#x4F18;&#x89E3;&#x3002;&#x8FD9;&#x4E2A;&#x89E3;&#x4F1A;&#x5C3D;&#x91CF;&#x4F7F;&#x8BAD;&#x7EC3;&#x8BEF;&#x5DEE;&#x6700;&#x5C0F;&#xFF0C;&#x8FD9;&#x5C31;&#x4F1A;&#x5BFC;&#x81F4;&#x6A21;&#x578B;&#x8FC7;&#x5EA6;&#x7684;&#x5B66;&#x4E60;&#x8BAD;&#x7EC3;&#x6837;&#x672C;&#xFF0C;&#x5C06;&#x6837;&#x672C;&#x7684;&#x4E00;&#x4E9B;&#x81EA;&#x8EAB;&#x7279;&#x70B9;&#x5F53;&#x505A;&#x4E86;&#x4E00;&#x822C;&#x7279;&#x6027;&#xFF0C;&#x8FD9;&#x5C31;&#x5BFC;&#x81F4;&#x4E86;&#x8FC7;&#x62DF;&#x5408;&#x3002;&#x56E0;&#x4E3A;&#x65E0;&#x6CD5;&#x83B7;&#x5F97;&#x5168;&#x5C40;&#x6700;&#x4F18;&#x89E3;&#xFF0C;&#x56E0;&#x6B64;&#x8FC7;&#x62DF;&#x5408;&#x662F;&#x65E0;&#x6CD5;&#x907F;&#x514D;&#x7684;&#xFF01;</p></blockquote><h2 id="2-&#x8BC4;&#x4F30;&#x65B9;&#x6CD5;"><a href="#2-&#x8BC4;&#x4F30;&#x65B9;&#x6CD5;" class="headerlink" title="2.&#x8BC4;&#x4F30;&#x65B9;&#x6CD5;"></a>2.&#x8BC4;&#x4F30;&#x65B9;&#x6CD5;</h2><p>&#x4ECE;&#x4E0A;&#x9762;&#x5BF9;&#x8FC7;&#x62DF;&#x5408;&#x7684;&#x5206;&#x6790;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x5149;&#x770B;&#x8BAD;&#x7EC3;&#x8BEF;&#x5DEE;&#x662F;&#x6CA1;&#x6709;&#x4EC0;&#x4E48;&#x610F;&#x4E49;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x77E5;&#x9053;&#x6CDB;&#x5316;&#x8BEF;&#x5DEE;,&#x6765;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x8FDB;&#x884C;<strong>&#x6A21;&#x578B;&#x9009;&#x62E9;(model selection)</strong>&#x548C;<strong>&#x8C03;&#x53C2;(parameter tuning)</strong>&#x3002;&#x4E3A;&#x4E86;&#x80FD;&#x591F;&#x8BC4;&#x4F30;&#x6CDB;&#x5316;&#x8BEF;&#x5DEE;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E00;&#x4E2A;<strong>&#x6D4B;&#x8BD5;&#x96C6;(training set)</strong>&#x6765;&#x6A21;&#x62DF;&#x65B0;&#x6837;&#x672C;&#x3002;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x6D4B;&#x8BD5;&#x96C6;&#x4ECE;&#x54EA;&#x91CC;&#x6765;&#xFF1F;</p><p>&#x1F604; &#x4E3A;&#x4E86;&#x4E0E;&#x5B9E;&#x9645;&#x9047;&#x5230;&#x7684;&#x771F;&#x5B9E;&#x6D4B;&#x8BD5;&#x6570;&#x636E;&#x8FDB;&#x884C;&#x533A;&#x522B;&#xFF0C;&#x6D4B;&#x8BD5;&#x96C6;&#x5E38;&#x88AB;&#x79F0;&#x4E3A;<strong>&#x9A8C;&#x8BC1;&#x96C6;&#xFF08;validation set&#xFF09;</strong> &#x3002;</p><h3 id="&#x7559;&#x51FA;&#x6CD5;-hold-out"><a href="#&#x7559;&#x51FA;&#x6CD5;-hold-out" class="headerlink" title="&#x7559;&#x51FA;&#x6CD5; hold-out"></a>&#x7559;&#x51FA;&#x6CD5; hold-out</h3><p>&#x7B80;&#x5355;&#x66B4;&#x529B;&#xFF0C;&#x76F4;&#x63A5;&#x5C06;&#x6570;&#x636E;&#x96C6;&#x5212;&#x5206;&#x4E3A;&#x4E24;&#x4E2A;&#x4E92;&#x65A5;&#x7684;&#x96C6;&#x5408;&#xFF0C;&#x4E00;&#x4E2A;&#x4F5C;&#x4E3A;&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;&#x4E00;&#x4E2A;&#x4F5C;&#x4E3A;&#x6D4B;&#x8BD5;&#x96C6;&#x3002;</p><blockquote><p>&#x6CE8;&#x610F;&#x4E00;&#xFF1A;&#x5212;&#x5206;&#x65F6;&#x8981;&#x5C3D;&#x53EF;&#x80FD;&#x4FDD;&#x6301;&#x6570;&#x636E;&#x5206;&#x5E03;&#x7684;&#x4E00;&#x81F4;&#x6027;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<em>&#x5206;&#x5C42;&#x91C7;&#x6837;&#xFF08;stratified sampling&#xFF09;</em>&#x7684;&#x65B9;&#x5F0F;&#x3002;</p><p>&#x6CE8;&#x610F;&#x4E8C;&#xFF1A;&#x7531;&#x4E8E;&#x5B58;&#x5728;&#x591A;&#x79CD;&#x5212;&#x5206;&#x65B9;&#x5F0F;&#xFF0C;&#x56E0;&#x6B64;&#x4E00;&#x822C;&#x8FDB;&#x884C;&#x591A;&#x6B21;&#x968F;&#x673A;&#x5212;&#x5206;&#x7136;&#x540E;&#x5BF9;&#x6BCF;&#x6B21;&#x7ED3;&#x679C;&#x53D6;&#x5E73;&#x5747;&#x503C;&#x3002;</p><p>&#x6CE8;&#x610F;&#x4E09;&#xFF1A;&#x6D4B;&#x8BD5;&#x96C6;&#x5C0F;&#xFF0C;&#x4F1A;&#x5BFC;&#x81F4;&#x8BC4;&#x4F30;&#x7ED3;&#x679C;&#x65B9;&#x5DEE;&#x8F83;&#x5927;&#xFF08;&#x8FC7;&#x62DF;&#x5408;&#xFF09;&#xFF1B;&#x8BAD;&#x7EC3;&#x96C6;&#x5C0F;&#xFF0C;&#x4F1A;&#x5BFC;&#x81F4;&#x8BC4;&#x4F30;&#x7ED3;&#x679C;&#x504F;&#x5DEE;&#x8F83;&#x5927;&#xFF08;&#x6B20;&#x62DF;&#x5408;&#xFF09;&#x3002;&#x4E00;&#x822C;&#x5C06;2/3~4/5&#x7684;&#x6570;&#x636E;&#x4F5C;&#x4E3A;&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;&#x800C;&#x6D4B;&#x8BD5;&#x96C6;&#x4E00;&#x822C;&#x81F3;&#x5C11;&#x5E94;&#x542B;30&#x4E2A;&#x6837;&#x4F8B;&#x3002;</p></blockquote><h3 id="&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;-cross-validation"><a href="#&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;-cross-validation" class="headerlink" title="&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1; cross validation"></a>&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1; cross validation</h3><p>&#x5C06;&#x6570;&#x636E;&#x96C6;&#x5212;&#x5206;&#x4E3A;K&#x4E2A;&#x5927;&#x5C0F;&#x76F8;&#x4F3C;&#x7684;&#x4E92;&#x65A5;&#x5B50;&#x96C6;&#x3002;&#x6BCF;&#x4E2A;&#x5B50;&#x96C6;&#x5C3D;&#x91CF;&#x4FDD;&#x6301;&#x6570;&#x636E;&#x53D1;&#x5E03;&#x7684;&#x4E00;&#x81F4;&#x6027;&#xFF08;&#x5206;&#x5C42;&#x62BD;&#x6837;&#xFF09;&#x3002;&#x7136;&#x540E;&#x6BCF;&#x6B21;&#x7528;K-1&#x4E2A;&#x5B50;&#x96C6;&#x4F5C;&#x4E3A;&#x8BAD;&#x7EC3;&#x96C6;&#xFF0C;&#x5269;&#x4E0B;&#x90A3;&#x4E2A;&#x5B50;&#x96C6;&#x4F5C;&#x4E3A;&#x6D4B;&#x8BD5;&#x96C6;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;K&#x6B21;&#x8BAD;&#x7EC3;&#x548C;&#x6D4B;&#x8BD5;&#xFF0C;&#x6700;&#x540E;&#x8FD4;&#x56DE;&#x5747;&#x503C;&#x3002;</p><blockquote><p>&#x56E0;&#x4E3A;&#x5206;&#x4E3A; K&#x4E2A;&#xFF0C;&#x56E0;&#x6B64;&#x53C8;&#x79F0;&#x4E3A;&#x201C;K&#x6298;&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#x201D;&#x3001;&#x201C;K&#x500D;&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#x201D;&#x3002;K&#x4E00;&#x822C;&#x53D6;10&#x5DE6;&#x53F3;&#x3002;</p><p>&#x5F53;K&#x53D6;&#x6837;&#x672C;&#x5927;&#x5C0F;&#x65F6;&#xFF0C;&#x5219;&#x79F0;&#x4E3A;:&#x7559;&#x4E00;&#x6CD5;&#xFF08;Leave-One-Out,LOO&#xFF09;,&#x8FD9;&#x79CD;&#x8BC4;&#x4F30;&#x7ED3;&#x679C;&#x5F80;&#x5F80;&#x8BA4;&#x4E3A;&#x6BD4;&#x8F83;&#x51C6;&#x786E;&#xFF0C;&#x4F46;&#x662F;&#x8BA1;&#x7B97;&#x5F00;&#x9500;&#x5B9E;&#x5728;&#x592A;&#x5927;&#x3002;</p></blockquote><p>&#x53C8;&#x7531;&#x4E8E;&#x5B58;&#x5728;&#x591A;&#x79CD;&#x5212;&#x5206;&#x65B9;&#x5F0F;&#xFF0C;&#x56E0;&#x6B64;&#x901A;&#x5E38;&#x8981;&#x968F;&#x673A;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x5212;&#x5206;&#x65B9;&#x5F0F;&#x91CD;&#x590D;P&#x6B21;&#xFF0C;&#x6700;&#x7EC8;&#x7ED3;&#x679C;&#x4E3A;&#x8FD9;p&#x6B21;K&#x6298;&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#x7ED3;&#x679C;&#x7684;&#x5747;&#x503C;&#x3002;</p><h3 id="&#x81EA;&#x52A9;&#x6CD5;&#xFF08;&#x53EF;&#x91CD;&#x590D;&#x91C7;&#x6837;&#x3001;&#x6709;&#x653E;&#x56DE;&#x91C7;&#x6837;&#xFF09;-bootstrapping"><a href="#&#x81EA;&#x52A9;&#x6CD5;&#xFF08;&#x53EF;&#x91CD;&#x590D;&#x91C7;&#x6837;&#x3001;&#x6709;&#x653E;&#x56DE;&#x91C7;&#x6837;&#xFF09;-bootstrapping" class="headerlink" title="&#x81EA;&#x52A9;&#x6CD5;&#xFF08;&#x53EF;&#x91CD;&#x590D;&#x91C7;&#x6837;&#x3001;&#x6709;&#x653E;&#x56DE;&#x91C7;&#x6837;&#xFF09; bootstrapping"></a>&#x81EA;&#x52A9;&#x6CD5;&#xFF08;&#x53EF;&#x91CD;&#x590D;&#x91C7;&#x6837;&#x3001;&#x6709;&#x653E;&#x56DE;&#x91C7;&#x6837;&#xFF09; bootstrapping</h3><blockquote><p>&#x4E0A;&#x9762;&#x7684;&#x4E24;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x90FD;&#x4F1A;&#x5BFC;&#x81F4;&#x8BAD;&#x7EC3;&#x96C6;&#x5C0F;&#x4E8E;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x8FD9;&#x4F1A;&#x4EA7;&#x751F;&#x8BC4;&#x4F30;&#x504F;&#x5DEE;&#xFF0C;&#x800C;&#x81EA;&#x52A9;&#x6CD5;&#x80FD;&#x591F;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x3002;</p></blockquote><p>&#x81EA;&#x52A9;&#x6CD5;&#x4EE5;<em>&#x81EA;&#x52A9;&#x91C7;&#x6837;&#x6CD5;</em>&#x4E3A;&#x57FA;&#x7840;&#x3002;&#x7ED9;&#x5B9A;&#x5305;&#x542B;m&#x4E2A;&#x6837;&#x672C;&#x7684;&#x6570;&#x636E;&#x96C6;D&#xFF0C;&#x91C7;&#x7528;&#x751F;&#x6210;&#x6570;&#x636E;&#x96C6;D&#x2018;&#xFF1A;&#x6BCF;&#x6B21;&#x4ECE;D&#x4E2D;&#x968F;&#x673A;&#x53D6;&#x4E00;&#x4E2A;&#x6837;&#x672C;&#x653E;&#x5165;D&#x2019;&#xFF0C;&#x5E76;&#x653E;&#x56DE;D&#xFF0C;&#x4F7F;D&#x59CB;&#x7EC8;&#x4E0D;&#x53D8;&#x3002;&#x91CD;&#x590D;m&#x6B21;&#x540E;&#xFF0C;&#x5C31;&#x4F1A;&#x83B7;&#x5F97;&#x5305;&#x542B;m&#x4E2A;&#x6837;&#x672C;&#x7684;&#x6570;&#x636E;&#x96C6;D&#x2018;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x4F30;&#x8BA1;&#x4E00;&#x4E0B;D&#x4E2D;&#x672A;&#x88AB;&#x91C7;&#x6837;&#x5230;&#x7684;&#x6837;&#x672C;&#x6570;&#xFF1A;&#xFF08;1-1/m&#xFF09;^m&#x53D6;&#x6781;&#x9650;&#x7EA6;&#x4E3A;0.368&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x6709;36.8%&#x7684;&#x6570;&#x636E;&#x672A;&#x88AB;&#x91C7;&#x6837;&#x5230;&#x3002;&#x4E8E;&#x662F;&#x6211;&#x4EEC;&#x5C06;D&#x2019;&#x4F5C;&#x4E3A;&#x8BAD;&#x7EC3;&#x6837;&#x672C;&#xFF0C;D\D&#x2019;&#x4F5C;&#x4E3A;&#x6D4B;&#x8BD5;&#x6837;&#x672C;&#xFF0C;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x7684;&#x8BAD;&#x7EC3;&#x96C6;&#x5927;&#x5C0F;&#x4EFB;&#x4E3A;m&#xFF0C;&#x5728;&#x8FD9;&#x65B9;&#x9762;&#x4E0D;&#x4F1A;&#x5F15;&#x5165;&#x8BC4;&#x4F30;&#x504F;&#x5DEE;&#x3002;</p><blockquote><p><strong>&#x6CE8;&#x610F;&#xFF01;</strong>&#x81EA;&#x52A9;&#x6CD5;&#x5728;&#x6570;&#x636E;&#x96C6;&#x8F83;&#x5C0F;&#xFF0C;&#x96BE;&#x4EE5;&#x6709;&#x6548;&#x5212;&#x5206;&#x8BAD;&#x7EC3;\&#x6D4B;&#x8BD5;&#x96C6;&#x65F6;&#x5F88;&#x6709;&#x7528;&#x3002;</p><p>&#x4F46;&#x5F53;&#x6570;&#x636E;&#x96C6;&#x8DB3;&#x591F;&#x5927;&#x65F6;&#xFF0C;&#x7559;&#x51FA;&#x6CD5;&#x548C;&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#x6CD5;&#x66F4;&#x5E38;&#x7528;&#x3002;&#x56E0;&#x4E3A;&#x81EA;&#x52A9;&#x6CD5;&#x4F1A;&#x6539;&#x53D8;&#x6570;&#x636E;&#x96C6;&#x53D1;&#x5E03;&#xFF0C;&#x4E5F;&#x4F1A;&#x5F15;&#x5165;&#x504F;&#x5DEE;&#x3002;</p></blockquote><h2 id="3-&#x6027;&#x80FD;&#x5EA6;&#x91CF;"><a href="#3-&#x6027;&#x80FD;&#x5EA6;&#x91CF;" class="headerlink" title="3.&#x6027;&#x80FD;&#x5EA6;&#x91CF;"></a>3.&#x6027;&#x80FD;&#x5EA6;&#x91CF;</h2><p>&#x5728;&#x4E0A;&#x9762;&#x8BC4;&#x4F30;&#x65B9;&#x6CD5;&#x4E2D;&#x5BF9;&#x4E8E;&#x6570;&#x636E;&#x96C6;&#x7684;&#x5EA6;&#x91CF;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x6CDB;&#x5316;&#x8BEF;&#x5DEE;&#x3002;&#x4F46;&#x5728;&#x5B9E;&#x9645;&#x4F7F;&#x7528;&#x4E2D;&#x53EA;&#x4F7F;&#x7528;&#x6CDB;&#x5316;&#x8BEF;&#x5DEE;&#x5F80;&#x5F80;&#x662F;&#x4E0D;&#x591F;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x66F4;&#x4E3A;&#x5168;&#x9762;&#x7684;&#x6027;&#x80FD;&#x5EA6;&#x91CF;&#x6807;&#x51C6;&#x3002;</p><h3 id="3-1&#x6DF7;&#x6DC6;&#x77E9;&#x9635;-confusion-matrix"><a href="#3-1&#x6DF7;&#x6DC6;&#x77E9;&#x9635;-confusion-matrix" class="headerlink" title="3.1&#x6DF7;&#x6DC6;&#x77E9;&#x9635;(confusion matrix)"></a>3.1&#x6DF7;&#x6DC6;&#x77E9;&#x9635;(confusion matrix)</h3><p><img src="/&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6A21;&#x578B;&#x7684;&#x8BC4;&#x4F30;&#x4E0E;&#x9009;&#x62E9;/&#x6A21;&#x578B;&#x8BC4;&#x4F30;&#x4E0E;&#x9009;&#x62E9;.png" alt="&#x6DF7;&#x6DC6;&#x77E9;&#x9635;"></p><p>True&#x3001;False:&#x9884;&#x6D4B;&#x7684;&#x7ED3;&#x679C;&#x662F;&#x5426;&#x6B63;&#x786E;               Positive&#x3001;Negative&#xFF1A;&#x9884;&#x6D4B;&#x7684;&#x7ED3;&#x679C;</p><blockquote><p>&#x6DF7;&#x6DC6;&#x77E9;&#x9635;&#x901A;&#x8FC7;&#x4E0D;&#x540C;&#x7684;&#x7EC4;&#x5408;&#x53EF;&#x4EE5;&#x5F62;&#x6210;&#x8FD9;&#x79CD;&#x53C2;&#x6570;&#x6307;&#x6807;</p></blockquote><p><strong>1.&#x6B63;&#x786E;&#x7387; precision</strong></p><p>$Precision=\frac{TP}{TP+FP}$</p><p><strong>2.&#x771F;&#x9633;&#x6027;&#x7387;(True Positive Rate TPR),&#x7075;&#x654F;&#x5EA6;(Sensitivity),&#x53EC;&#x56DE;&#x7387;(Recall)</strong></p><p>$Sensitivity=Recall=TPR=\frac{TP}{TP+FN}$</p><p><strong>3.&#x771F;&#x9634;&#x6027;&#x7387;(True Negative Rate TNR),&#x7279;&#x5F02;&#x5EA6;(Specificity)</strong></p><p>$Specificity=TNR=\frac{TN}{FP+TN}$</p><p><strong>4.&#x5047;&#x9634;&#x6027;(False Negative Rate FNR),&#x6F0F;&#x8BCA;&#x7387;</strong></p><p>$FNR=\frac{FN}{TP+FN}$</p><p><strong>5.&#x5047;&#x9633;&#x6027;(False Positive Rate FPR),&#x8BEF;&#x8BCA;&#x7387;</strong></p><p>$FPR=\frac{FP}{FP+TN}$</p><p><strong>6.&#x9633;&#x6027;&#x4F3C;&#x7136;&#x6BD4;(Positive Likelihood Ratio LR+)</strong></p><p>$LR+ =\frac{TPR}{FPR}=\frac{Sensitivity}{1-Specificity}$</p><p><strong>7.&#x9634;&#x6027;&#x4F3C;&#x7136;&#x6BD4;(Negative Likelihood Ratio LR-)</strong></p><p>$LR- =\frac{FNR}{TNR}=\frac{1-Sensitivity}{Specificity}$</p><p><strong>8.Youden &#x6307;&#x6570; </strong></p><p>$Youden index=Sensitivity+Specificity-1=TPR-FPR$</p><hr><h3 id="3-2&#x67E5;&#x51C6;&#x7387;-Precision-&#x53EC;&#x56DE;&#x7387;-Recall-F&#x503C;"><a href="#3-2&#x67E5;&#x51C6;&#x7387;-Precision-&#x53EC;&#x56DE;&#x7387;-Recall-F&#x503C;" class="headerlink" title="3.2&#x67E5;&#x51C6;&#x7387;(Precision),&#x53EC;&#x56DE;&#x7387;(Recall),F&#x503C;"></a>3.2&#x67E5;&#x51C6;&#x7387;(Precision),&#x53EC;&#x56DE;&#x7387;(Recall),F&#x503C;</h3><blockquote><p>P&#x503C;&#xFF0C;R&#x503C;&#xFF0C;F&#x503C;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x6700;&#x4E3A;&#x5E38;&#x7528;&#x7684;&#x6307;&#x6807;&#x4E86;</p></blockquote><p>$P=\frac{TP}{TP+FP}$       </p><p>$ R=\frac{TP}{TP+FN}$       </p><p>$F_\beta=\frac{(1+\beta^2)\times P\times R}{(\beta^2\times P)+R} (\beta&gt;0)$</p><p><strong>P&#x503C;&#xFF1A;</strong>&#x9884;&#x6D4B;&#x4E3A;&#x771F;&#x7684;&#x7ED3;&#x679C;&#x4E2D;&#xFF0C;&#x9884;&#x6D4B;&#x6B63;&#x786E;&#x7684;&#x6982;&#x7387;&#x3002;</p><p><strong>R&#x503C;&#xFF1A;</strong>&#x6B63;&#x771F;&#x4E3A;&#x771F;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x6210;&#x529F;&#x9884;&#x6D4B;&#x7684;&#x6982;&#x7387;&#x3002;</p><blockquote><p>&#x6211;&#x4EEC;&#x7684;&#x76EE;&#x6807;&#x5F53;&#x7136;&#x662F;P&#x503C;&#x548C;R&#x503C;&#x8D8A;&#x9AD8;&#x8D8A;&#x597D;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E24;&#x8005;&#x5374;&#x662F;&#x77DB;&#x76FE;&#x7684;&#x3002;</p><p>&#x9AD8;R&#x4F4E;P&#xFF1A;&#x5B81;&#x53EF;&#x9519;&#x6740;&#x4E0D;&#x53EF;&#x653E;&#x8FC7;&#xFF0C;<del>&#x53EA;&#x8981;&#x5B83;&#x662F;&#x90A3;&#x6211;&#x4E00;&#x5B9A;&#x8BF4;&#x662F;</del> &#x3002;&#x6BD4;&#x5982;&#x5BF9;&#x4E8E;&#x764C;&#x75C7;&#x7684;&#x9884;&#x6D4B;&#x5B81;&#x53EF;&#x8BEF;&#x5DEE;&#x4E5F;&#x4E0D;&#x80FD;&#x6F0F;&#x8BCA;&#x3002;</p><p>&#x9AD8;P&#x4F4E;R&#xFF1A;&#x5B81;&#x53EF;&#x653E;&#x8FC7;&#x4E0D;&#x53EF;&#x9519;&#x6740;&#xFF0C;<del>&#x6211;&#x8BF4;&#x4ED6;&#x662F;&#x90A3;&#x4ED6;&#x5C31;&#x662F;</del>&#x3002;&#x6BD4;&#x5982;&#x4EBA;&#x9053;&#x4E3B;&#x4E49;&#x7684;&#x5224;&#x65AD;&#x574F;&#x4EBA;&#xFF0C;&#x53EA;&#x8981;&#x5224;&#x65AD;&#x662F;&#x574F;&#x4EBA;&#x90A3;&#x5C31;&#x4E00;&#x5B9A;&#x662F;&#x3002;</p></blockquote><p>&#x4F46;&#x662F;&#x5230;&#x5E95;&#x5E94;&#x8BE5;&#x600E;&#x4E48;&#x53D6;P,R&#x503C;&#x7684;&#x5927;&#x5C0F;&#xFF0C;&#x5B9E;&#x5728;&#x9EBB;&#x70E6;&#xFF0C;&#x4E8E;&#x662F;&#x5C31;&#x6709;&#x4E86;F&#x503C;&#x3002;</p><p><strong>F&#x503C;&#xFF1A;</strong> &#x53C2;&#x6570;=1   F1&#x4E3A;P&#x548C;R&#x7684;&#x8C03;&#x548C;&#x5E73;&#x5747;&#x6570;&#xFF0C;&#x4E24;&#x8005;&#x4E00;&#x6837;&#x91CD;&#x8981;&#x3002;</p><p>&#x200B;           &#x53C2;&#x6570;&lt;1   &#x4FA7;&#x91CD;&#x4E8E;R&#x503C;</p><p>&#x200B;           &#x53C2;&#x6570;&gt;1   &#x4FA7;&#x91CD;&#x4E8E;P&#x503C;</p><blockquote><p>&#x4F46;&#x662F;&#x6709;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x4F1A;&#x6709;&#x591A;&#x4E2A;&#x6DF7;&#x6DC6;&#x77E9;&#x9635;&#xFF0C;&#x6BD4;&#x5982;&#x8FDB;&#x884C;&#x4E86;&#x591A;&#x6B21;&#x8BAD;&#x7EC3;/&#x6D4B;&#x8BD5;&#x3002;&#x8FD9;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x53EA;&#x8981;&#x5BF9;P,R,F&#x503C;&#x7A0D;&#x52A0;&#x4FEE;&#x6539;&#x5C31;&#x884C;&#x4E86;&#x3002;</p></blockquote><p><strong>&#x5B8F; macro:</strong> &#x5148;&#x6C42;&#x51FA;&#x5404;&#x4E2A;P,R&#x503C;&#x3002;&#x7136;&#x540E;&#x6C42;&#x5E73;&#x5747;P,R&#x503C;&#x3002;&#x6700;&#x540E;&#x6C42;F&#x503C;&#x3002;</p><p>$macro-P=\frac{1}{n}\sum\limits_{i=1}^{n} P_i$        </p><p>$macro-R=\frac{1}{n}\sum\limits_{i=1}^{n} R_i$    </p><p>$macro-F_1=\frac{2\times macro-P\times MACRO-R}{macro-P+macro-R}$</p><p><strong>&#x5FAE; micro&#xFF1A;</strong>&#x5148;&#x6C42;&#x5E73;&#x5747;&#x518D;&#x6C42;P,R,F</p><p>$micro-P=\frac{\overline{TP}}{\overline{TP}+\overline{FP}}$            </p><p>$micro-R=\frac{\overline{TP}}{\overline{TP}+\overline{FN}}$            </p><p>$micro-F_1=\frac{2\times micro-P\times micro-R}{micro-P+micro-R}$</p><hr><h3 id="3-3ROC&#x4E0E;AUC"><a href="#3-3ROC&#x4E0E;AUC" class="headerlink" title="3.3ROC&#x4E0E;AUC"></a>3.3ROC&#x4E0E;AUC</h3><blockquote><p><strong>&#x591A;&#x7528;&#x4E8E;&#x5EA6;&#x91CF;&#x5206;&#x7C7B;&#x7B97;&#x6CD5;&#x3002;</strong></p><p><strong>&#x4F18;&#x52BF;&#xFF1A;</strong>&#x5F53;&#x6D4B;&#x8BD5;&#x96C6;&#x4E2D;&#x7684;&#x6B63;&#x8D1F;&#x6837;&#x672C;&#x7684;&#x5206;&#x5E03;&#x53D8;&#x5316;&#x7684;&#x65F6;&#x5019;&#xFF0C;ROC&#x66F2;&#x7EBF;&#x80FD;&#x591F;&#x4FDD;&#x6301;&#x4E0D;&#x53D8;(P-R&#x66F2;&#x7EBF;&#x4F1A;&#x53D8;&#x5316;&#x660E;&#x663E;)&#x3002;</p><p>&#x5728;&#x5B9E;&#x9645;&#x7684;&#x6570;&#x636E;&#x96C6;&#x4E2D;&#x7ECF;&#x5E38;&#x4F1A;&#x51FA;&#x73B0;&#x7C7B;&#x4E0D;&#x5E73;&#x8861;(class imbalance)&#x73B0;&#x8C61;&#xFF0C;&#x5373;&#x8D1F;&#x6837;&#x672C;&#x6BD4;&#x6B63;&#x6837;&#x672C;&#x591A;&#x5F88;&#x591A;(&#x6216;&#x8005;&#x76F8;&#x53CD;)&#xFF0C;&#x800C;&#x4E14;&#x6D4B;&#x8BD5;&#x6570;&#x636E;&#x4E2D;&#x7684;&#x6B63;&#x8D1F;&#x6837;&#x672C;&#x7684;&#x5206;&#x5E03;&#x4E5F;&#x53EF;&#x80FD;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x53D8;&#x5316;&#x3002; </p></blockquote><p><strong>ROC</strong>(Receiver Operating Characteristic)&#x53CD;&#x6620;&#x654F;&#x611F;&#x6027;&#x548C;&#x7279;&#x5F02;&#x6027;&#x8FDE;&#x7EED;&#x53D8;&#x91CF;&#x7684;&#x7EFC;&#x5408;&#x6307;&#x6807;&#xFF0C;&#x66F2;&#x7EBF;&#x4E0A;&#x6BCF;&#x4E2A;&#x70B9;&#x53CD;&#x6620;&#x7740;&#x5BF9;&#x540C;&#x4E00;&#x4FE1;&#x53F7;&#x523A;&#x6FC0;&#x7684;&#x611F;&#x53D7;&#x6027;&#x3002;</p><p><img src="/&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6A21;&#x578B;&#x7684;&#x8BC4;&#x4F30;&#x4E0E;&#x9009;&#x62E9;/&#x6A21;&#x578B;&#x8BC4;&#x4F30;&#x4E0E;&#x9009;&#x62E9;_1.png" alt="ROC"></p><p><strong>&#x6A2A;&#x8F74;&#xFF1A;</strong> &#x5047;&#x9633;&#x6027; $FPR=\frac{FP}{FP+TN}$   &#x9884;&#x6D4B;&#x4E3A;&#x6B63;&#x4F46;&#x5B9E;&#x9645;&#x4E3A;&#x8D1F;&#x7684;&#x6837;&#x672C;&#x5360;&#x6240;&#x6709;&#x8D1F;&#x4F8B;&#x6837;&#x672C;&#x7684;&#x6BD4;&#x4F8B;</p><p><strong>&#x7EB5;&#x8F74;&#xFF1A;</strong> &#x771F;&#x9633;&#x6027;  $TPR=\frac{TP}{TP+FN}$   &#x9884;&#x6D4B;&#x4E3A;&#x6B63;&#x4E14;&#x5B9E;&#x9645;&#x4E3A;&#x6B63;&#x7684;&#x6837;&#x672C;&#x5360;&#x6240;&#x6709;&#x6B63;&#x4F8B;&#x6837;&#x672C; &#x7684;&#x6BD4;&#x4F8B;</p><p>&#x5BF9;&#x4E8E;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x6539;&#x53D8;&#x6700;&#x540E;&#x7684;&#x5206;&#x7C7B;&#x9608;&#x503C;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x83B7;&#x5F97;&#x4E0D;&#x540C;&#x5927;&#x5C0F;&#x7684;FPR&#x548C;TPR&#xFF0C;&#x7528;&#x4E8E;&#x753B;&#x51FA;ROC&#x56FE;&#x3002;</p><blockquote><p><strong>&#x7406;&#x60F3;&#x76EE;&#x6807;&#xFF1A;</strong>TPR=1&#xFF0C;FPR=0&#xFF0C;&#x5373;&#x56FE;&#x4E2D;(0,1)&#x70B9;&#xFF0C;&#x6545;ROC&#x66F2;&#x7EBF;&#x8D8A;&#x9760;&#x62E2;(0,1)&#x70B9;&#x8D8A;&#x597D;&#x3002;</p><p>&#x4F46;&#x662F;&#x5F80;&#x5F80;&#x5E76;&#x4E0D;&#x80FD;&#x5F88;&#x597D;&#x7684;&#x5224;&#x65AD;&#x51FA;&#xFF0C;&#x4E24;&#x4E2A;ROC&#x56FE;&#xFF0C;&#x54EA;&#x4E2A;&#x66F4;&#x597D;&#xFF0C;&#x66F4;&#x63A5;&#x8FD1;(0,1)&#x70B9;&#x3002;</p><p>&#x4E8E;&#x662F;&#x4FBF;&#x6709;&#x4E86;AUC&#x3002;</p></blockquote><p><strong>AUC</strong> (Area under the curve)&#x4E3A;ROC&#x66F2;&#x7EBF;&#x4E0B;&#x7684;&#x9762;&#x79EF;&#xFF0C;&#x663E;&#x7136;&#x8FD9;&#x4E2A;&#x9762;&#x79EF;&#x7684;&#x6570;&#x503C;&#x4E0D;&#x4F1A;&#x5927;&#x4E8E;1&#x3002;&#x53C8;&#x7531;&#x4E8E;ROC&#x66F2;&#x7EBF;&#x4E00;&#x822C;&#x90FD;&#x5904;&#x4E8E;y=x&#x8FD9;&#x6761;&#x76F4;&#x7EBF;&#x7684;&#x4E0A;&#x65B9;&#xFF0C;&#x6240;&#x4EE5;AUC&#x7684;&#x53D6;&#x503C;&#x8303;&#x56F4;&#x4E00;&#x822C;&#x5728;0.5&#x548C;1&#x4E4B;&#x95F4;(&#x5C0F;&#x4E8E;0.5&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x5206;&#x7C7B;&#x5668;&#x8FD8;&#x4E0D;&#x5982;&#x6295;&#x786C;&#x5E01;&#x2026;&#x2026;)&#x3002;<strong>AUC&#x503C;&#x8D8A;&#x5927;&#x7684;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x6B63;&#x786E;&#x7387;&#x8D8A;&#x9AD8;</strong>&#x3002;</p><p>&#x5BF9;&#x4E8E;AUC&#x7684;&#x8BA1;&#x7B97;&#x6709;&#x591A;&#x79CD;&#x65B9;&#x6CD5;(<a href="https://blog.csdn.net/qq_22238533/article/details/78666436" target="_blank" rel="noopener">&#x53C2;&#x8003;</a>)&#xFF1A;</p><p>1.&#x76F4;&#x63A5;&#x8BA1;&#x7B97;,&#x77E5;&#x9053;&#x5750;&#x6807;{(x1,y1),(x2,y2)&#x2026;&#x2026;(xm,ym)}</p><p>$AUC=\frac{1}{2}\sum\limits_{i=1}^{m-1}(x_i+1-x_i)*(y_i+y_{i+1})$</p><p>2.&#x5728;&#x6709;M&#x4E2A;&#x6B63;&#x6837;&#x672C;,N&#x4E2A;&#x8D1F;&#x6837;&#x672C;&#x7684;&#x6570;&#x636E;&#x96C6;&#x91CC;&#x3002;&#x4E00;&#x5171;&#x6709;M<em>N&#x5BF9;&#x6837;&#x672C;&#xFF08;&#x4E00;&#x5BF9;&#x6837;&#x672C;&#x5373;&#xFF0C;&#x4E00;&#x4E2A;&#x6B63;&#x6837;&#x672C;&#x4E0E;&#x4E00;&#x4E2A;&#x8D1F;&#x6837;&#x672C;&#xFF09;&#x3002;&#x7EDF;&#x8BA1;&#x8FD9;M</em>N&#x5BF9;&#x6837;&#x672C;&#x91CC;&#xFF0C;&#x6B63;&#x6837;&#x672C;&#x7684;&#x9884;&#x6D4B;&#x6982;&#x7387;&#x5927;&#x4E8E;&#x8D1F;&#x6837;&#x672C;&#x7684;&#x9884;&#x6D4B;&#x6982;&#x7387;&#x7684;&#x4E2A;&#x6570;&#x3002;<strong>&#x6CE8;&#x610F;&#xFF1A;&#x8FD9;&#x4E2A;&#x201C;&#x9884;&#x6D4B;&#x6982;&#x7387;&#x201D;&#x4E0D;&#x4E00;&#x5B9A;&#x662F;&#x771F;&#x7684;&#x6982;&#x7387;&#xFF0C;&#x53EA;&#x8981;&#x80FD;&#x6BD4;&#x5927;&#x5C0F;&#x5373;&#x53EF;</strong></p><p><img src="/&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6A21;&#x578B;&#x7684;&#x8BC4;&#x4F30;&#x4E0E;&#x9009;&#x62E9;/&#x516C;&#x5F0F;_1.png" alt=""></p><p>&#x6BD4;&#x5982;&#x73B0;&#x5728;&#x6709;2&#x4E2A;&#x6B63;&#x4F8B;&#x548C;&#x4E24;&#x4E2A;&#x53CD;&#x4F8B;&#xFF1A;</p><table><thead><tr><th>ID</th><th>label</th><th>pro</th></tr></thead><tbody><tr><td>A</td><td>0</td><td>0.1</td></tr><tr><td>B</td><td>0</td><td>0.4</td></tr><tr><td>C</td><td>1</td><td>0.4</td></tr><tr><td>D</td><td>1</td><td>0.8</td></tr></tbody></table><p>&#x5171;4&#x79CD;&#x7EC4;&#x5408;&#xFF1A;{C,A},{C,B},{D,A},{D,B}.            </p><p>&#x7ED3;&#x679C;&#x4E3A;&#xFF1A;$AUC=\frac{1+1+1+0.5}{4}=0.875$</p><p>3.&#x7528;rank&#x6CD5;,M&#x4E2A;&#x6B63;&#x6837;&#x672C;,N&#x4E2A;&#x8D1F;&#x6837;&#x672C;.&#x6309;&#x7167;&#x6982;&#x7387;&#x6392;&#x4E2A;&#x5E8F;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x6B63;&#x4F8B;&#x7684;&#x5E8F;&#x53F7;&#x76F8;&#x52A0;(&#x91CD;&#x53E0;&#x53D6;&#x5E73;&#x5747;)&#xFF0C;&#x51CF;&#x53BB;&#x5E38;&#x6570;&#x9879;&#xFF0C;&#x9664;&#x4EE5;&#x5E38;&#x6570;&#x9879;&#x5373;&#x53EF;&#x3002;</p><p>$AUC=\frac{\sum_{ins_i\in{positiveclass}}rank_ins_i-\frac{M\times(M+1)}{2}}{M\times N}$</p><p>&#x5982;&#xFF1A;</p><table><thead><tr><th>ID</th><th>label</th><th>pro</th><th>rank</th></tr></thead><tbody><tr><td>A</td><td>0</td><td>0.1</td><td>1</td></tr><tr><td>B</td><td>0</td><td>0.4</td><td>2</td></tr><tr><td>C</td><td>1</td><td>0.4</td><td>3</td></tr><tr><td>D</td><td>1</td><td>0.8</td><td>4</td></tr></tbody></table><p>&#x7ED3;&#x679C;&#xFF1A;$AUC=\frac{4+(2+3)/2-2\times (2+1)/2}{2\times 2}=0.875$</p><p>4.&#x5B9E;&#x9645;&#x4F7F;&#x7528;&#x65F6;&#x76F4;&#x63A5;&#x7528;&#x522B;&#x4EBA;&#x7684;&#x5B9E;&#x73B0;~</p><figure class="highlight python"><table><tbody><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">import</span> numpy <span class="keyword">as</span> np</span><br><span class="line"><span class="keyword">from</span> sklearn.metrics <span class="keyword">import</span> roc_auc_score</span><br><span class="line">y_true = np.array([<span class="number">0</span>,<span class="number">0</span>,<span class="number">1</span>,<span class="number">1</span>])</span><br><span class="line">y_scores = np.array([<span class="number">0.1</span>,<span class="number">0.4</span>,<span class="number">0.4</span>,<span class="number">0.8</span>])</span><br><span class="line"><span class="keyword">print</span> <span class="string">&quot;y_true is &quot;</span>,y_true</span><br><span class="line"><span class="keyword">print</span> <span class="string">&quot;y_scores is &quot;</span>,y_scores</span><br><span class="line"><span class="keyword">print</span> <span class="string">&quot;AUC is&quot;</span>,roc_auc_score(y_true, y_scores)</span><br></pre></td></tr></tbody></table></figure><h3 id="3-4-&#x4EE3;&#x4EF7;&#x654F;&#x611F;&#x9519;&#x8BEF;&#x7387;&#x4E0E;&#x4EE3;&#x4EF7;&#x66F2;&#x7EBF;"><a href="#3-4-&#x4EE3;&#x4EF7;&#x654F;&#x611F;&#x9519;&#x8BEF;&#x7387;&#x4E0E;&#x4EE3;&#x4EF7;&#x66F2;&#x7EBF;" class="headerlink" title="3.4 &#x4EE3;&#x4EF7;&#x654F;&#x611F;&#x9519;&#x8BEF;&#x7387;&#x4E0E;&#x4EE3;&#x4EF7;&#x66F2;&#x7EBF;"></a>3.4 &#x4EE3;&#x4EF7;&#x654F;&#x611F;&#x9519;&#x8BEF;&#x7387;&#x4E0E;&#x4EE3;&#x4EF7;&#x66F2;&#x7EBF;</h3><p>&#x8BE5;&#x65B9;&#x6CD5;&#x5BF9;FN&#x548C;FP&#x5206;&#x914D;&#x4E86;&#x4E00;&#x4E2A;&#x4EE3;&#x4EF7;&#xFF0C;<del>&#x1F622;&#x5177;&#x4F53;&#x5C31;&#x4E0D;&#x505A;&#x4E86;&#x89E3;&#x4E86;</del></p><h2 id="4-&#x6BD4;&#x8F83;&#x68C0;&#x9A8C;"><a href="#4-&#x6BD4;&#x8F83;&#x68C0;&#x9A8C;" class="headerlink" title="4 &#x6BD4;&#x8F83;&#x68C0;&#x9A8C;"></a>4 &#x6BD4;&#x8F83;&#x68C0;&#x9A8C;</h2><p>&#x7167;&#x7406;&#x6765;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x5B66;&#x4F1A;&#x4E86;&#x8BC4;&#x4F30;&#x65B9;&#x6CD5;&#x548C;&#x6027;&#x80FD;&#x5EA6;&#x91CF;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x80FD;&#x591F;&#x6109;&#x5FEB;&#x7684;&#x8FDB;&#x884C;&#x5BF9;&#x5B66;&#x4E60;&#x5668;&#x7684;&#x4F18;&#x52A3;&#x6BD4;&#x8F83;&#x4E86;&#x3002;&#x4F46;&#x73B0;&#x5B9E;&#x5E76;&#x4E0D;&#x50CF;&#x8FD9;&#x6837;&#x7B80;&#x5355;&#x3002;&#x5BF9;&#x6B64;&#x897F;&#x74DC;&#x4E66;&#x7ED9;&#x51FA;&#x4E86;&#x4E09;&#x4E2A;&#x56E0;&#x7D20;&#xFF1A;</p><blockquote><p>1.&#x6211;&#x4EEC;&#x5F97;&#x5230;&#x7684;&#x53EA;&#x662F;&#x6D4B;&#x8BD5;&#x96C6;&#x4E0A;&#x7684;&#x6027;&#x80FD;&#x5EA6;&#x91CF;&#x5E76;&#x4E0D;&#x80FD;&#x7B49;&#x540C;&#x4E8E;&#x6B63;&#x771F;&#x7684;&#x6CDB;&#x5316;&#x6027;&#x80FD;&#x3002;</p></blockquote><blockquote><p>2.&#x6D4B;&#x8BD5;&#x96C6;&#x7684;&#x9009;&#x62E9;&#x4F1A;&#x5BF9;&#x7ED3;&#x679C;&#x5E26;&#x6765;&#x5F88;&#x5927;&#x7684;&#x5F71;&#x54CD;&#x3002;</p></blockquote><blockquote><p>3.&#x7B97;&#x6CD5;&#x672C;&#x8EAB;&#x5C31;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x968F;&#x673A;&#x6027;&#xFF0C;&#x5373;&#x4F7F;&#x53C2;&#x6570;&#x76F8;&#x540C;&#x4E5F;&#x4F1A;&#x5F97;&#x51FA;&#x4E0D;&#x540C;&#x7684;&#x7ED3;&#x679C;&#x3002;</p></blockquote><p>&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x600E;&#x4E48;&#x529E;&#xFF1F;&#xFF08;&#x63A5;&#x4E0B;&#x6765;&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#x4EE5;&#x9519;&#x8BEF;&#x7387;&#x3B5;&#x4E3A;&#x4F8B;&#xFF09;</p><p><strong>&#x9996;&#x5148;&#xFF0C;&#x6211;&#x7684;&#x6C42;&#x5F97;&#x7684;&#x8FD9;&#x4E2A;&#x6D4B;&#x8BD5;&#x6837;&#x672C;&#x9519;&#x8BEF;&#x7387;&#x3B5;&#x8FD8;&#x6709;&#x6CA1;&#x6709;&#x7528;&#xFF1F;</strong></p><p>&#x5F53;&#x7136;&#x6709;&#x7528;&#xFF0C;<strong>&#x7EDF;&#x8BA1;&#x5047;&#x8BBE;&#x68C0;&#x9A8C;&#xFF08;hypothesis test&#xFF09;</strong>&#x4E3A;&#x6211;&#x4EEC;&#x63D0;&#x4F9B;&#x4E86;&#x91CD;&#x8981;&#x4F9D;&#x636E;&#x3002;</p><p><code>&#x5047;&#x8BBE;&#x68C0;&#x9A8C;&#x7684;&#x5B9A;&#x4E49;&#x662F;&#xFF1A;&#x5728;&#x603B;&#x4F53;&#x7684;&#x5206;&#x5E03;&#x51FD;&#x6570;&#x5B8C;&#x5168;&#x672A;&#x77E5;&#x6216;&#x5DF2;&#x77E5;&#x5176;&#x5F62;&#x5F0F;&#xFF0C;&#x4F46;&#x4E0D;&#x77E5;&#x5176;&#x53C2;&#x6570;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x4E3A;&#x4E86;&#x63A8;&#x65AD;&#x603B;&#x4F53;&#x7684;&#x67D0;&#x4E9B;&#x672A;&#x77E5;&#x7279;&#x6027;&#xFF0C;&#x63D0;&#x51FA;&#x67D0;&#x4E9B;&#x5173;&#x4E8E;&#x603B;&#x4F53;&#x7684;&#x5047;&#x8BBE;&#x3002;&#x6211;&#x4EEC;&#x8981;&#x6839;&#x636E;&#x6837;&#x672C;&#x5BF9;&#x6240;&#x63D0;&#x51FA;&#x7684;&#x5047;&#x8BBE;&#x4F5C;&#x51FA;&#x662F;&#x63A5;&#x53D7;&#x8FD8;&#x662F;&#x62D2;&#x7EDD;&#x7684;&#x51B3;&#x7B56;&#x3002;</code></p><p>&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x5F97;&#x5230;&#x4E86;&#x5047;&#x8BBE;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x505A;&#x7684;&#x662F;&#x77E5;&#x9053;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E2A;&#x5047;&#x8BBE;&#xFF0C;&#x6211;&#x4EEC;&#x63A5;&#x53D7;&#x7684;&#x6982;&#x7387;&#x662F;&#x591A;&#x5C11;&#xFF0C;&#x62D2;&#x7EDD;&#x7684;&#x6982;&#x7387;&#x662F;&#x591A;&#x5C11;&#x3002;&#x5F88;&#x660E;&#x663E;&#x5F53;&#x7136;&#x662F;&#x63A5;&#x53D7;&#x7684;&#x6982;&#x7387;&#x8D8A;&#x9AD8;&#x8D8A;&#x597D;&#xFF0C;&#x8FD9;&#x6837;&#x624D;&#x80FD;&#x7528;&#x6211;&#x4EEC;&#x7684;&#x8FD9;&#x4E2A;&#x5047;&#x8BBE;&#x53BB;&#x8FD1;&#x4F3C;&#x6B63;&#x771F;&#x60C5;&#x51B5;&#x554A;&#x3002;</p><p><strong>&#x90A3;&#x4E48;&#x95EE;&#x9898;&#x53C8;&#x6765;&#x4E86;&#xFF0C;&#x8FD9;&#x4E2A;&#x63A5;&#x53D7;&#x6982;&#x7387;&#x600E;&#x4E48;&#x6C42;&#xFF1F;</strong></p><p>&#x4E3A;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x53C8;&#x8981;&#x63A8;&#x51FA;&#x4E24;&#x4E2A;&#x6982;&#x5FF5;&#xFF1A;<strong>&#x7F6E;&#x4FE1;&#x5EA6;&#xFF08;confidence&#xFF09;=1-&#x3B1;</strong>  &#x548C;  <strong>&#x7F6E;&#x4FE1;&#x533A;&#x95F4;</strong></p><blockquote><p>&#x6BD4;&#x5982;&#xFF0C;&#x5728;&#x7F6E;&#x4FE1;&#x5EA6;0.95&#x4E0A;&#x7684;&#x7F6E;&#x4FE1;&#x533A;&#x95F4;X&#x3002;&#x610F;&#x5473;&#x7740;&#x771F;&#x5B9E;&#x503C;&#x843D;&#x5728;X&#x4E0A;&#x7684;&#x6982;&#x7387;&#x4E3A;95%</p></blockquote><p>&#x6211;&#x4EEC;&#x4E00;&#x822C;&#x90FD;&#x662F;&#x786E;&#x5B9A;&#x7F6E;&#x4FE1;&#x5EA6;&#xFF0C;&#x7136;&#x540E;&#x6C42;&#x51FA;&#x76F8;&#x5E94;&#x7684;&#x7F6E;&#x4FE1;&#x533A;&#x95F4;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x6211;&#x4EEC;&#x5F97;&#x5C06;&#x9519;&#x8BEF;&#x7387;&#x3B5;&#x53D8;&#x6362;&#x4E3A;&#x4E00;&#x4E2A;&#x8303;&#x56F4;&#x8868;&#x793A;&#x3002;</p><p><strong>&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x7684;&#x4EFB;&#x52A1;&#x53D8;&#x6210;&#x4E86;&#x600E;&#x4E48;&#x5C06;&#x4E00;&#x4E2A;&#x6570;&#x503C;&#x53D8;&#x6210;&#x4E00;&#x4E2A;&#x8303;&#x56F4;&#xFF0C;&#x5E76;&#x4E14;&#x8FD8;&#x8981;&#x8003;&#x8651;&#x5176;&#x53D1;&#x751F;&#x6982;&#x7387;&#xFF1F;</strong></p><p>&#x4E3A;&#x6B64;&#x8FD9;&#x91CC;&#x5C06;&#x8BB2;&#x8FF0;&#x51E0;&#x79CD;&#x897F;&#x74DC;&#x4E66;&#x91CC;&#x63D0;&#x5230;&#x7684;&#x68C0;&#x9A8C;&#x65B9;&#x6CD5;&#x3002;</p><h3 id="4-1-&#x4E8C;&#x9879;&#x68C0;&#x9A8C;-binomial-test"><a href="#4-1-&#x4E8C;&#x9879;&#x68C0;&#x9A8C;-binomial-test" class="headerlink" title="4.1 &#x4E8C;&#x9879;&#x68C0;&#x9A8C; binomial test"></a>4.1 &#x4E8C;&#x9879;&#x68C0;&#x9A8C; binomial test</h3><blockquote><p><strong>&#x4F7F;&#x7528;&#x573A;&#x666F;&#xFF1A;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x9519;&#x8BEF;&#x7387;&#x3B5;</strong></p></blockquote><p><img src="/&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6A21;&#x578B;&#x7684;&#x8BC4;&#x4F30;&#x4E0E;&#x9009;&#x62E9;/&#x6A21;&#x578B;&#x8BC4;&#x4F30;&#x4E0E;&#x9009;&#x62E9;_2.jpg" alt="binomial"></p><p>&#x5728;&#x6D4B;&#x8BD5;&#x6837;&#x672C;m&#x72EC;&#x7ACB;&#x91C7;&#x6837;&#x7684;&#x6761;&#x4EF6;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6C42;&#x51FA;&#xFF0C;&#x6CDB;&#x5316;&#x9519;&#x8BEF;&#x7387;&#x4E3A;&#x3B5;&#x7684;&#x5B66;&#x4E60;&#x5668;&#x88AB;&#x6D4B;&#x51FA;&#x6D4B;&#x8BD5;&#x9519;&#x8BEF;&#x7387;&#x4E3A;&#x3B5;&#x2018;&#x7684;&#x6982;&#x7387;&#x662F;&#x591A;&#x5C11;&#x3002;</p><p>$P(\epsilon&#x2019;;\epsilon)=\epsilon^{\epsilon&#x2019;\times m}(1-\epsilon)^{m-\epsilon&#x2019;\times m}$</p><p>&#x5F88;&#x660E;&#x663E;&#x7684;&#xFF0C;&#x5F53;&#x3B5;=&#x3B5;&#x2018;&#x65F6;&#xFF0C;&#x6982;&#x7387;&#x662F;&#x6700;&#x5927;&#x7684;&#xFF0C;&#x800C;&#x4E14;&#x8FD8;&#x7B26;&#x5408;&#x4E8C;&#x9879;&#x53D1;&#x5E03;&#x3002;</p><p>&#x8FD9;&#x65F6;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x3B5;&lt;=&#x3B5;0,&#x5E76;&#x8BBE;&#x7F6E;&#x7F6E;&#x4FE1;&#x5EA6;1-&#x3B1;&#x3002;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6C42;&#x51FA;&#x5728;&#x8FD9;&#x4E2A;&#x6761;&#x4EF6;&#x4E0B;&#xFF0C;&#x6D4B;&#x8BD5;&#x9519;&#x8BEF;&#x7387;&#x3B5;&#x2018;&#x3002;</p><p>$\epsilon&#x2019;=(max \epsilon) s.t (\sum\limits_{i=\epsilon0\times m+1}^{m}\epsilon^i(1-\epsilon)^{m-i})&lt;\alpha (s.t &#x662F; subject to &#x7684;&#x7F29;&#x5199;&#xFF0C;&#x4F7F;&#x5DE6;&#x8FB9;&#x5F0F;&#x5B50;&#x5728;&#x53F3;&#x8FB9;&#x6761;&#x4EF6;&#x6EE1;&#x8DB3;&#x65F6;&#x6210;&#x7ACB;)$</p><p>&#x4ED6;&#x76F4;&#x63A5;&#x7406;&#x89E3;&#x5C31;&#x662F;&#xFF1A;&#x5728;&#x3B5;0&#x786E;&#x5B9A;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5BFB;&#x627E;&#x4E00;&#x4E2A;&#x6700;&#x5927;&#x7684;&#x6EE1;&#x8DB3;&#x53F3;&#x8FB9;&#x5F0F;&#x5B50;&#x7684;&#x3B5;&#x5373;&#x4E3A;&#x3B5;&#x2019;&#x3002;</p><p>&#x901A;&#x4FD7;&#x4E00;&#x70B9;&#x7406;&#x89E3;&#x5C31;&#x662F;&#xFF1A;&#x56E0;&#x4E3A;&#x3B5;&#x662F;&#x5C0F;&#x4E8E;&#x3B5;0&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x5F53;&#x8BEF;&#x5206;&#x6837;&#x672C;&#x6570;&#x5927;&#x4E8E;(&#x3B5;0+m)&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#x3002;&#x800C;&#x6211;&#x4EEC;&#x6D4B;&#x51FA;&#x7684;&#x3B5;&#x2018;&#x6EE1;&#x8DB3;&#x4E8C;&#x9879;&#x53D1;&#x5E03;&#xFF0C;&#x662F;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x8BEF;&#x5206;&#x6837;&#x672C;&#x5927;&#x4E8E;(&#x3B5;0+m)&#x7684;&#x60C5;&#x51B5;&#x7684;&#xFF0C;&#x4E8E;&#x662F;&#x6211;&#x4EEC;&#x8981;&#x9650;&#x5236;&#x8FD9;&#x4E2A;&#x60C5;&#x51B5;&#x51FA;&#x73B0;&#x7684;&#x6982;&#x7387;&#x5C0F;&#x4E8E;&#x67D0;&#x4E2A;&#x503C;&#x3B1;&#x3002;</p><p>&#x5B9E;&#x9645;&#x4F7F;&#x7528;&#x65F6;&#xFF1A;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x77E5;&#x9053;&#x4E86;&#x3B5;&#x2019;&#xFF0C;&#x53EF;&#x4EE5;&#x53CD;&#x8FC7;&#x6765;&#x6C42;&#x51FA;&#x5F53;&#x7B49;&#x4E8E;&#x3B1;&#x65F6;&#xFF0C;&#x76F8;&#x5E94;&#x7684;&#x3B5;0&#x4E3A;&#x591A;&#x5C11;&#x3002;</p><p>&#x8FD9;&#x6837;&#x5C31;&#x5B9E;&#x73B0;&#x4E86;&#x4ECE;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x6D4B;&#x8BD5;&#x9519;&#x8BEF;&#x7387;&#x3B5;&#x2018;&#xFF0C;&#x8F6C;&#x6362;&#x4E3A;&#x4E00;&#x4E2A;&#x8303;&#x56F4;&#x7684;&#x6CDB;&#x5316;&#x9519;&#x8BEF;&#x7387;&#x3B5;&#x3002;</p><h3 id="4-2-t&#x68C0;&#x9A8C;-t-tets"><a href="#4-2-t&#x68C0;&#x9A8C;-t-tets" class="headerlink" title="4.2 t&#x68C0;&#x9A8C; t-tets"></a>4.2 t&#x68C0;&#x9A8C; t-tets</h3><blockquote><p><strong>&#x4F7F;&#x7528;&#x573A;&#x666F;&#xFF1A;&#x6709;&#x591A;&#x4E2A;&#x9519;&#x8BEF;&#x7387;&#x7684;&#x503C;</strong></p></blockquote><p><img src="/&#x673A;&#x5668;&#x5B66;&#x4E60;&#x6A21;&#x578B;&#x7684;&#x8BC4;&#x4F30;&#x4E0E;&#x9009;&#x62E9;/&#x6A21;&#x578B;&#x8BC4;&#x4F30;&#x4E0E;&#x9009;&#x62E9;_3.jpg" alt="img"></p><blockquote><p><strong>&#x5148;&#x4E86;&#x89E3;&#x4E00;&#x4E0B;&#x4EC0;&#x4E48;&#x662F;t&#x53D1;&#x5E03;&#xFF1A;</strong></p></blockquote><p><strong>&#x5B66;&#x751F;t-&#x5206;&#x5E03;</strong>&#xFF08;Student&#x2019;s <em>t</em>-distribution&#xFF09;&#x53EF;&#x7B80;&#x79F0;&#x4E3A;<strong>t&#x5206;&#x5E03;</strong>&#xFF1A;$T=\frac{\overline{X_n}-\mu}{S_n/\sqrt{n}}=\frac{&#x6837;&#x672C;&#x5747;&#x503C;-&#x6574;&#x4F53;&#x671F;&#x671B;}{&#x6837;&#x672C;&#x6807;&#x51C6;&#x5DEE;/\sqrt{&#x6837;&#x672C;&#x6570;}}=n-1&#x81EA;&#x7531;&#x5EA6;&#x7684;t&#x5206;&#x5E03;$</p><blockquote><p>T&#x5206;&#x5E03;&#xFF0C;&#x662F;&#x4E00;&#x79CD;&#x6B63;&#x592A;&#x5206;&#x5E03;&#x7684;&#x8FD1;&#x4F3C;&#x5206;&#x5E03;&#xFF0C;&#x5F53;&#x81EA;&#x7531;&#x5EA6;&#x8D8B;&#x4E8E;&#x65E0;&#x7A77;&#x65F6;&#xFF0C;&#x5373;&#x4E3A;&#x6807;&#x51C6;&#x6B63;&#x592A;&#x5206;&#x5E03;&#x3002;&#x90A3;&#x4E3A;&#x4EC0;&#x4E48;&#x4E0D;&#x7528;&#x6B63;&#x592A;&#x5206;&#x5E03;&#x5462;&#xFF1F;&#x56E0;&#x4E3A;&#x6211;&#x4EEC;&#x5F80;&#x5F80;&#x5F97;&#x4E0D;&#x5230;&#x6B63;&#x771F;&#x6570;&#x636E;&#x6837;&#x672C;&#x7684;&#x671F;&#x671B;&#x548C;&#x65B9;&#x5DEE;&#xFF0C;&#x7528;&#x4E0D;&#x4E86;&#x6B63;&#x592A;&#xFF0C;&#x53EA;&#x80FD;&#x7528;&#x6837;&#x672C;&#x7684;&#x6807;&#x51C6;&#x5DEE;&#x548C;&#x671F;&#x671B;&#x6765;&#x6784;&#x5EFA;T&#x5206;&#x5E03;&#x3002;</p><p>&#x6240;&#x4EE5;&#xFF0C;<strong>T&#x5206;&#x5E03;&#x7528;&#x4E8E;&#x6839;&#x636E;&#x5C0F;&#x6837;&#x672C;&#x6765;&#x4F30;&#x8BA1;&#x5448;&#x6B63;&#x6001;&#x5206;&#x5E03;&#x4E14;&#x65B9;&#x5DEE;&#x672A;&#x77E5;&#x7684;&#x603B;&#x4F53;&#x7684;&#x5747;&#x503C;&#x3002;&#x5982;&#x679C;&#x603B;&#x4F53;&#x65B9;&#x5DEE;&#x5DF2;&#x77E5;&#xFF08;&#x4F8B;&#x5982;&#x5728;&#x6837;&#x672C;&#x6570;&#x91CF;&#x8DB3;&#x591F;&#x591A;&#x65F6;&#xFF09;&#xFF0C;&#x5219;&#x5E94;&#x8BE5;&#x7528;&#x6B63;&#x6001;&#x5206;&#x5E03;&#x6765;&#x4F30;&#x8BA1;&#x603B;&#x4F53;&#x5747;&#x503C;&#x3002;</strong></p></blockquote><script>        document.querySelectorAll('.github-emoji')          .forEach(el => {            if (!el.dataset.src) { return; }            const img = document.createElement('img');            img.style = 'display:none !important;';            img.src = el.dataset.src;            img.addEventListener('error', () => {              img.remove();              el.style.color = 'inherit';              el.style.backgroundImage = 'none';              el.style.background = 'none';            });            img.addEventListener('load', () => {              img.remove();            });            document.body.appendChild(img);          });      </script>]]></content>
    
    <summary type="html">
    
      对机器学习模型的评估与选择
    
    </summary>
    
      <category term="机器学习" scheme="https://cenleiding.github.io/categories/%E6%9C%BA%E5%99%A8%E5%AD%A6%E4%B9%A0/"/>
    
    
      <category term="机器学习" scheme="https://cenleiding.github.io/tags/%E6%9C%BA%E5%99%A8%E5%AD%A6%E4%B9%A0/"/>
    
  </entry>
  
  <entry>
    <title>机器学习概念随笔</title>
    <link href="https://cenleiding.github.io/%E6%9C%BA%E5%99%A8%E5%AD%A6%E4%B9%A0%E6%A6%82%E5%BF%B5%E9%9A%8F%E7%AC%94.html"/>
    <id>https://cenleiding.github.io/机器学习概念随笔.html</id>
    <published>2018-10-09T12:51:59.000Z</published>
    <updated>2018-10-10T13:13:13.782Z</updated>
    
    <content type="html"><![CDATA[<p>&#x5C31;&#x5F53;&#x88AB;&#x5355;&#x8BCD;&#x4E86;  &#x1F604;</p><h2 id="&#x57FA;&#x672C;&#x672F;&#x8BED;"><a href="#&#x57FA;&#x672C;&#x672F;&#x8BED;" class="headerlink" title="&#x57FA;&#x672C;&#x672F;&#x8BED;"></a>&#x57FA;&#x672C;&#x672F;&#x8BED;</h2><p><strong>&#x673A;&#x5668;&#x5B66;&#x4E60;&#xFF08;machine learning&#xFF09;</strong> &#x7684;&#x76EE;&#x6807;&#x662F;&#x901A;&#x8FC7; <strong>&#x5B66;&#x4E60;\&#x8BAD;&#x7EC3;&#x7B97;&#x6CD5;&#xFF08;learning\training algorithm&#xFF09;</strong>&#x83B7;&#x5F97;&#x6570;&#x636E;&#x7684; <strong>&#x6A21;&#x578B;&#xFF08;model&#xFF09;</strong> ,&#x8FD9;&#x4E2A;&#x6A21;&#x578B;&#x5BF9;&#x5E94;&#x4E86;&#x6570;&#x636E;&#x7684;&#x67D0;&#x79CD;&#x89C4;&#x5219;&#x56E0;&#x6B64;&#x4E5F;&#x53EB;<strong>&#x5047;&#x8BBE;&#xFF08;hypothesis&#xFF09;</strong>&#x3002;</p><p>&#x6A21;&#x578B;&#x7528;&#x4E8E;<strong>&#x9884;&#x6D4B;&#xFF08;prediction&#xFF09;</strong>&#x6570;&#x636E;&#xFF0C;&#x5176;&#x9002;&#x7528;&#x4E8E;&#x65B0;&#x6570;&#x636E;&#x7684;&#x80FD;&#x529B;&#x53EB;<strong>&#x6CDB;&#x5316;&#xFF08;generalization&#xFF09;&#x80FD;&#x529B;</strong> &#x3002;</p><p>&#x83B7;&#x5F97;&#x6A21;&#x578B;&#x7684;&#x8FC7;&#x7A0B;&#x662F;&#x4E00;&#x4E2A;&#x5F52;&#x7EB3;&#x8FC7;&#x7A0B;&#xFF0C;&#x4E5F;&#x79F0;&#x4E3A;<strong>&#x5F52;&#x7EB3;&#x5B66;&#x4E60;&#xFF08;inductive learning&#xFF09;</strong></p><p>&#x5B66;&#x4E60;&#x8FC7;&#x7A0B;&#x53EF;&#x4EE5;&#x770B;&#x505A;&#x4E00;&#x4E2A;&#x5728;&#x6240;&#x6709;&#x5047;&#x8BBE;&#x7EC4;&#x6210;&#x7684;&#x7A7A;&#x95F4;&#x4E2D;&#x641C;&#x7D22;&#x4E00;&#x4E2A;<strong>&#x5339;&#x914D;&#xFF08;fit&#xFF09;</strong> &#x8BAD;&#x7EC3;&#x96C6;&#x7684;&#x5047;&#x8BBE;&#xFF0C;&#x4F46;&#x7531;&#x4E8E;&#x8BAD;&#x7EC3;&#x96C6;&#x6709;&#x9650;&#xFF0C;&#x5F80;&#x5F80;&#x4F1A;&#x83B7;&#x5F97;&#x591A;&#x4E2A;&#x5339;&#x914D;&#x7684;&#x5047;&#x8BBE;&#xFF0C;&#x8FD9;&#x4E2A;&#x5047;&#x8BBE;&#x96C6;&#x5408;&#x79F0;&#x4E3A;<strong>&#x7248;&#x672C;&#x7A7A;&#x95F4;&#xFF08;version space&#xFF09;</strong> &#x3002;&#x4E3A;&#x4E86;&#x83B7;&#x5F97;&#x201C;&#x6700;&#x597D;&#x201D;&#x7684;&#x5047;&#x8BBE;&#xFF0C;&#x9700;&#x8981;&#x5BF9;&#x67D0;&#x7C7B;&#x578B;&#x7684;&#x5047;&#x8BBE;&#x6709;&#x6240;&#x504F;&#x597D;&#xFF0C;&#x79F0;&#x4E3A;<strong>&#x5F52;&#x7EB3;&#x504F;&#x597D;&#xFF08;inductive bias&#xFF09;</strong> &#x3002;</p><hr><p>&#x6570;&#x636E;&#x7684;&#x96C6;&#x5408;&#x79F0;&#x4E3A;<strong>&#x6570;&#x636E;&#x96C6;&#xFF08;data set&#xFF09;</strong> &#xFF0C;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;<strong>&#x8BAD;&#x7EC3;&#x96C6;&#xFF08;training set&#xFF09;</strong>&#x3001;<strong>&#x6D4B;&#x8BD5;&#x96C6;&#xFF08;testing set&#xFF09;</strong>&#x3001;<strong>&#x4EA4;&#x53C9;&#x9A8C;&#x8BC1;&#x96C6;&#xFF08;cross validation set&#xFF09;</strong></p><p>&#x6570;&#x636E;&#x96C6;&#x4E2D;&#x6BCF;&#x4E00;&#x6761;&#x8BB0;&#x5F55;&#x79F0;&#x4E3A; <strong>&#x793A;&#x4F8B;&#xFF08;instance&#xFF09;</strong>&#x6216; <strong>&#x6837;&#x672C;&#xFF08;sample&#xFF09;</strong> </p><p>&#x5982;&#x679C;&#x8BB0;&#x5F55;&#x4E2D;&#x542B;&#x6709;&#x6307;&#x793A;&#x7ED3;&#x679C;&#x7684; <strong>&#x6807;&#x7B7E;&#x3001;&#x6807;&#x8BB0;&#xFF08;label&#xFF09;</strong> &#xFF0C;&#x90A3;&#x8FD9;&#x4E2A;&#x6837;&#x672C;&#x79F0;&#x4E3A; <strong>&#x6837;&#x4F8B;&#xFF08;example&#xFF09;</strong></p><p>&#x6BCF;&#x4E00;&#x4E2A;&#x4E8B;&#x9879;&#x79F0;&#x4E3A;<strong>&#x5C5E;&#x6027;&#xFF08;attribute&#xFF09;</strong>&#x6216; <strong>&#x7279;&#x5F81;&#xFF08;feature&#xFF09;</strong>  &#xFF0C;&#x5176;&#x6570;&#x91CF;&#x79F0;&#x4E3A;&#x6837;&#x672C;&#x7684;<strong>&#x7EF4;&#x6570;&#xFF08;dimensionality&#xFF09;</strong></p><p>&#x6240;&#x6709;&#x5C5E;&#x6027;&#x5F62;&#x6210;&#x7684;&#x591A;&#x7EF4;&#x7A7A;&#x95F4;&#x79F0;&#x4E3A;<strong>&#x5C5E;&#x6027;&#x7A7A;&#x95F4;&#xFF08;attribute space&#xFF09;</strong> &#x6216; <strong>&#x6837;&#x672C;&#x7A7A;&#x95F4;&#xFF08;sample space&#xFF09;</strong> &#x6216; <strong>&#x8F93;&#x5165;&#x7A7A;&#x95F4;</strong></p><p>&#x6240;&#x6709;&#x6807;&#x7B7E;&#x7684;&#x96C6;&#x5408;&#x79F0;&#x4E3A;<strong>&#x6807;&#x8BB0;&#x7A7A;&#x95F4;&#xFF08;label space&#xFF09;</strong> &#x6216; <strong>&#x8F93;&#x51FA;&#x7A7A;&#x95F4;</strong></p><p>&#x5728;&#x8FD9;&#x4E2A;&#x7A7A;&#x95F4;&#x4E2D;&#x6BCF;&#x4E2A;&#x6837;&#x672C;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x5750;&#x6807;&#xFF0C;&#x548C;&#x539F;&#x70B9;&#x7EC4;&#x6210;&#x4E00;&#x4E2A;&#x5750;&#x6807;&#x5411;&#x91CF;&#xFF0C;&#x79F0;&#x4E3A;<strong>&#x7279;&#x5F81;&#x5411;&#x91CF;&#xFF08;feature vector&#xFF09;</strong></p><hr><p>&#x6839;&#x636E;&#x662F;&#x5426;&#x6709;&#x6807;&#x8BB0;&#x4FE1;&#x606F;&#xFF0C;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#x6709;&#x6807;&#x8BB0;&#x7684;<strong>&#x76D1;&#x7763;&#x5B66;&#x4E60;&#xFF08;supervised learning&#xFF09;</strong>&#x548C;&#x65E0;&#x6807;&#x8BB0;&#x7684;<strong>&#x65E0;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#xFF08;unsupervised learning&#xFF09;</strong>&#x3002;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x6709;&#x5206;&#x7C7B;&#x3001;&#x56DE;&#x5F52;&#x3002;&#x975E;&#x76D1;&#x7763;&#x5B66;&#x4E60;&#x6709;<strong>&#x805A;&#x7C7B;&#xFF08;clustering&#xFF09;</strong>&#x3002;</p><p>&#x6839;&#x636E;&#x9884;&#x6D4B;&#x503C;&#x7684;&#x7C7B;&#x578B;&#xFF0C;&#x673A;&#x5668;&#x5B66;&#x4E60;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#x79BB;&#x6563;&#x503C;&#x7684;<strong>&#x5206;&#x7C7B;&#xFF08;classification&#xFF09;</strong>&#x4EFB;&#x52A1;&#x548C;&#x8FDE;&#x7EED;&#x503C;&#x7684;<strong>&#x56DE;&#x5F52;&#xFF08;regression&#xFF09;</strong>&#x4EFB;&#x52A1;</p><p>&#x5206;&#x7C7B;&#x95EE;&#x9898;&#x53C8;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;<strong>&#x4E8C;&#x5206;&#x7C7B;&#xFF08;binary classification&#xFF09;</strong> &#x548C; <strong>&#x591A;&#x5206;&#x7C7B;&#xFF08;multi-class classification&#xFF09;</strong></p><hr><h3 id="epoch-batch-step-iteration"><a href="#epoch-batch-step-iteration" class="headerlink" title="epoch batch step iteration"></a>epoch batch step iteration</h3><p><strong>epoch</strong>&#xFF1A; &#x8868;&#x793A;&#x8FC7;&#x4E86;&#x4E00;&#x904D;&#x8BAD;&#x7EC3;&#x96C6;&#x3002;</p><p><strong>batch</strong>&#xFF1A; batch-size &#x6BCF;&#x6B21;&#x8FED;&#x4EE3;&#x6240;&#x7528;&#x7684;&#x6837;&#x672C;&#x6570;&#x3002;</p><p><strong>step&#xFF0C;iteration</strong>&#xFF1A; &#x8FED;&#x4EE3;&#x7684;&#x6B21;&#x6570;&#x3002;</p><p>&#x6BD4;&#x5982;&#x73B0;&#x5728;&#x6709;1000&#x4E2A;&#x6837;&#x672C;&#x3002;&#x6211;&#x51B3;&#x5B9A;&#x8981;&#x5BF9;&#x6574;&#x4E2A;&#x6837;&#x672C;&#x8BAD;&#x7EC3;10&#x6B21;&#xFF08;epoch=10&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x6BCF;&#x6B21;&#x5206;&#x4E3A;10&#x6B21;&#x5C0F;&#x7684;&#x8BAD;&#x7EC3;&#xFF08;step=10&#xFF0C;&#x56E0;&#x4E3A;&#x5F53;&#x6570;&#x636E;&#x91CF;&#x5F88;&#x5927;&#x65F6;&#x65E0;&#x6CD5;&#x4E00;&#x4E0B;&#x5B50;&#x8BAD;&#x7EC3;&#x6240;&#x6709;&#x7684;&#x6570;&#x636E;&#xFF09;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x6BCF;&#x6B21;&#x5C0F;&#x8BAD;&#x7EC3;&#x8981;&#x5904;&#x7406;10&#x4E2A;&#x6837;&#x672C;&#xFF08;batch-size&#xFF09;&#x3002;</p><p>&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#x4E00;&#x4E2A;epoch&#x5E76;&#x4E0D;&#x610F;&#x5473;&#x7740;&#x8981;&#x5B8C;&#x5168;&#x904D;&#x5386;&#x5B8C;&#x6240;&#x6709;&#x7684;&#x6837;&#x672C;&#xFF0C;&#x5F53;&#x6837;&#x672C;&#x5341;&#x5206;&#x5927;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x53EA;&#x5BF9;&#x4E00;&#x90E8;&#x5206;&#x6837;&#x672C;&#x8FDB;&#x884C;&#x91C7;&#x6837;&#x3002;</p><hr><h2 id="&#x62D3;&#x5C55;&#x672F;&#x8BED;"><a href="#&#x62D3;&#x5C55;&#x672F;&#x8BED;" class="headerlink" title="&#x62D3;&#x5C55;&#x672F;&#x8BED;"></a>&#x62D3;&#x5C55;&#x672F;&#x8BED;</h2><p><strong>&#x5965;&#x5361;&#x59C6;&#x5243;&#x5200;&#xFF08;Occam&#x2019;s razor&#xFF09;</strong> &#xFF1A; &#x82E5;&#x6709;&#x591A;&#x4E2A;&#x5047;&#x8BBE;&#x548C;&#x89C2;&#x5BDF;&#x4E00;&#x81F4;&#xFF0C;&#x5219;&#x9009;&#x62E9;&#x6700;&#x7B80;&#x5355;&#x7684;&#x90A3;&#x4E2A;&#x3002;</p><p><strong>&#x6CA1;&#x6709;&#x514D;&#x8D39;&#x7684;&#x5348;&#x9910; NFL&#xFF08;No Free Lunch Theorem&#xFF09;&#x5B9A;&#x7406;</strong> &#xFF1A;&#x5728;&#x6240;&#x6709;&#x95EE;&#x9898;&#x51FA;&#x73B0;&#x7684;&#x673A;&#x4F1A;&#x76F8;&#x540C;&#x3001;&#x6216;&#x6240;&#x6709;&#x95EE;&#x9898;&#x540C;&#x7B49;&#x91CD;&#x8981;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C; &#x6240;&#x6709;&#x7684;&#x7B97;&#x6CD5;&#xFF0C;&#x5B83;&#x4EEC;&#x7684;&#x671F;&#x671B;&#x6027;&#x80FD;&#x90FD;&#x662F;&#x76F8;&#x540C;&#x7684; &#xFF01;&#xFF01; &#x56E0;&#x6B64;&#x8131;&#x79BB;&#x5177;&#x4F53;&#x95EE;&#x9898;&#x7A7A;&#x8C08;&#x4EC0;&#x4E48;&#x7B97;&#x6CD5;&#x66F4;&#x597D;&#x6BEB;&#x65E0;&#x610F;&#x4E49;&#xFF0C;&#x7B97;&#x6CD5;&#x4F18;&#x52A3;&#x5FC5;&#x987B;&#x9488;&#x5BF9;&#x5177;&#x4F53;&#x7684;&#x95EE;&#x9898;&#x3002;</p><hr><p>&#x968F;&#x65F6;&#x8865;&#x5145;~</p><script>        document.querySelectorAll('.github-emoji')          .forEach(el => {            if (!el.dataset.src) { return; }            const img = document.createElement('img');            img.style = 'display:none !important;';            img.src = el.dataset.src;            img.addEventListener('error', () => {              img.remove();              el.style.color = 'inherit';              el.style.backgroundImage = 'none';              el.style.background = 'none';            });            img.addEventListener('load', () => {              img.remove();            });            document.body.appendChild(img);          });      </script>]]></content>
    
    <summary type="html">
    
      对于机器学习的一些概念的小笔记
    
    </summary>
    
      <category term="机器学习" scheme="https://cenleiding.github.io/categories/%E6%9C%BA%E5%99%A8%E5%AD%A6%E4%B9%A0/"/>
    
    
      <category term="机器学习" scheme="https://cenleiding.github.io/tags/%E6%9C%BA%E5%99%A8%E5%AD%A6%E4%B9%A0/"/>
    
  </entry>
  
  <entry>
    <title>决策树 DecisionTree</title>
    <link href="https://cenleiding.github.io/DecisionTree.html"/>
    <id>https://cenleiding.github.io/DecisionTree.html</id>
    <published>2018-10-07T07:07:16.000Z</published>
    <updated>2018-10-09T12:44:28.236Z</updated>
    
    <content type="html"><![CDATA[<h2 id="1-&#x4EC0;&#x4E48;&#x662F;&#x51B3;&#x7B56;&#x6811;&#xFF1F;"><a href="#1-&#x4EC0;&#x4E48;&#x662F;&#x51B3;&#x7B56;&#x6811;&#xFF1F;" class="headerlink" title="1.&#x4EC0;&#x4E48;&#x662F;&#x51B3;&#x7B56;&#x6811;&#xFF1F;"></a>1.&#x4EC0;&#x4E48;&#x662F;&#x51B3;&#x7B56;&#x6811;&#xFF1F;</h2><p><img src="/DecisionTree/DT_1.jpg" alt="&#x897F;&#x74DC;&#x51B3;&#x7B56;&#x6811;"></p><p>&#x51B3;&#x7B56;&#x6811;&#x5F88;&#x597D;&#x7406;&#x89E3;&#xFF0C;&#x5C31;&#x662F;&#x6A21;&#x62DF;&#x4E86;&#x4EBA;&#x4EEC;&#x5E73;&#x65F6;&#x7684;&#x601D;&#x8003;&#x65B9;&#x5F0F;&#xFF0C;&#x6839;&#x636E;&#x4E8B;&#x52A1;&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x4E00;&#x5C42;&#x5C42;&#x7684;&#x5BF9;&#x4E8B;&#x52A1;&#x7684;&#x5C5E;&#x6027;&#x8FDB;&#x884C;&#x5206;&#x6790;&#x5212;&#x5206;&#xFF0C;&#x6700;&#x540E;&#x5B9E;&#x73B0;&#x5BF9;&#x4E8B;&#x52A1;&#x7684;&#x5F52;&#x7C7B;&#x3002;</p><p><code>&#x7B97;&#x6CD5;&#x7528;&#x9014;</code> &#xFF1A;&#x5206;&#x7C7B;&#x95EE;&#x9898;&#xFF0C;&#x6570;&#x636E;&#x6316;&#x6398;</p><p><code>&#x4F18;&#x70B9;</code> &#xFF1A;&#x8BA1;&#x7B97;&#x590D;&#x6742;&#x5EA6;&#x4E0D;&#x9AD8;&#xFF0C;<em>&#x6613;&#x4E8E;&#x7406;&#x89E3;&#x6570;&#x636E;&#x4E2D;&#x8574;&#x542B;&#x7684;&#x77E5;&#x8BC6;&#x4FE1;&#x606F;</em>&#x3002;</p><p><code>&#x7F3A;&#x70B9;</code> &#xFF1A;&#x5BB9;&#x6613;&#x51FA;&#x73B0;&#x8FC7;&#x62DF;&#x5408;</p><p><code>&#x9002;&#x7528;&#x6570;&#x636E;&#x7C7B;&#x578B;</code> &#xFF1A;&#x6570;&#x503C;&#x578B;&#x3001;&#x6807;&#x79F0;&#x578B; </p><h2 id="2-&#x5C5E;&#x6027;&#x5212;&#x5206;"><a href="#2-&#x5C5E;&#x6027;&#x5212;&#x5206;" class="headerlink" title="2.&#x5C5E;&#x6027;&#x5212;&#x5206;"></a>2.&#x5C5E;&#x6027;&#x5212;&#x5206;</h2><p> <strong>&#x5173;&#x952E;&#xFF1A;&#x5411;&#x7740;&#x6570;&#x636E;&#x96C6;&#x7EAF;&#x5EA6;&#x53D8;&#x9AD8;&#x7684;&#x65B9;&#x5411;&#x5212;&#x5206;&#x7279;&#x5F81;&#x3002;</strong></p><blockquote><h3 id="&#x600E;&#x4E48;&#x5224;&#x65AD;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x96C6;&#x7684;&#x7EAF;&#x5EA6;&#xFF0C;&#x6DF7;&#x4E71;&#x5EA6;&#xFF1F;"><a href="#&#x600E;&#x4E48;&#x5224;&#x65AD;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x96C6;&#x7684;&#x7EAF;&#x5EA6;&#xFF0C;&#x6DF7;&#x4E71;&#x5EA6;&#xFF1F;" class="headerlink" title="&#x600E;&#x4E48;&#x5224;&#x65AD;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x96C6;&#x7684;&#x7EAF;&#x5EA6;&#xFF0C;&#x6DF7;&#x4E71;&#x5EA6;&#xFF1F;"></a>&#x600E;&#x4E48;&#x5224;&#x65AD;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x96C6;&#x7684;&#x7EAF;&#x5EA6;&#xFF0C;&#x6DF7;&#x4E71;&#x5EA6;&#xFF1F;</h3></blockquote><p>&#x7EAF;&#x5EA6;&#x3001;&#x6DF7;&#x4E71;&#x5EA6;&#x5176;&#x5B9E;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x96C6;&#x7684;&#x4FE1;&#x606F;&#x91CF;&#x7684;&#x8868;&#x73B0;&#x5F62;&#x5F0F;&#x3002;&#x4FE1;&#x606F;&#x91CF;&#x8D8A;&#x5927;&#x90A3;&#x4E48;&#x5C31;&#x8D8A;&#x6DF7;&#x4E71;&#xFF0C;&#x8D8A;&#x4E0D;&#x7EAF;&#x3002;  </p><p>&#x800C;&#x600E;&#x4E48;&#x7528;&#x4E00;&#x4E2A;&#x6570;&#x503C;&#x53BB;&#x8861;&#x91CF;&#x4FE1;&#x606F;&#x91CF;&#xFF1F;&#x4E3A;&#x6B64;&#x9999;&#x519C;&#x63D0;&#x51FA;&#x4E86;<em>&#x4FE1;&#x606F;&#x71B5;</em></p><p><strong>&#x4FE1;&#x606F;&#x71B5; information entropy</strong></p><p>$Ent(D)=-\sum \limits_{k=1}^{\vert y\vert}{\rho}_klog_2{\rho}_{k}$</p><p>Ent(D)&#x8D8A;&#x5C0F;&#xFF0C;&#x5219;&#x6570;&#x636E;&#x7EAF;&#x5EA6;&#x8D8A;&#x9AD8;&#xFF0C;&#x6DF7;&#x4E71;&#x5EA6;&#x8D8A;&#x5C0F;&#x3002;</p><p><strong>&#x57FA;&#x5C3C;&#x503C; Gini index</strong></p><p>$Gini(D)=\sum\limits_{k=1}^{\vert y\vert}\sum\limits_{k&#x2019;\neq k}\rho_k\rho_k&#x2019;=1-\sum\limits_{k=1}^{\vert y\vert}\rho_k^2$</p><p>Gini(D)&#x53CD;&#x6620;&#x4E86;&#x4ECE;&#x6570;&#x636E;&#x96C6;D&#x4E2D;&#x968F;&#x673A;&#x62BD;&#x53D6;&#x4E24;&#x4E2A;&#x6837;&#x672C;&#xFF0C;&#x5176;&#x7C7B;&#x522B;&#x6807;&#x8BB0;&#x4E0D;&#x4E00;&#x81F4;&#x7684;&#x6982;&#x7387;&#x3002;</p><p>Gini(D)&#x8D8A;&#x5C0F;&#xFF0C;&#x5219;&#x6570;&#x636E;&#x7EAF;&#x5EA6;&#x8D8A;&#x9AD8;&#xFF0C;&#x6DF7;&#x4E71;&#x5EA6;&#x8D8A;&#x5C0F;&#x3002;</p><blockquote><h3 id="&#x6BCF;&#x6B21;&#x51B3;&#x7B56;&#x90FD;&#x4F1A;&#x5C06;&#x6570;&#x636E;&#x96C6;&#x8FDB;&#x884C;&#x5206;&#x5272;&#x3002;&#x600E;&#x4E48;&#x8868;&#x793A;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x96C6;&#x7684;&#x6DF7;&#x4E71;&#x5EA6;&#xFF1F;"><a href="#&#x6BCF;&#x6B21;&#x51B3;&#x7B56;&#x90FD;&#x4F1A;&#x5C06;&#x6570;&#x636E;&#x96C6;&#x8FDB;&#x884C;&#x5206;&#x5272;&#x3002;&#x600E;&#x4E48;&#x8868;&#x793A;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x96C6;&#x7684;&#x6DF7;&#x4E71;&#x5EA6;&#xFF1F;" class="headerlink" title="&#x6BCF;&#x6B21;&#x51B3;&#x7B56;&#x90FD;&#x4F1A;&#x5C06;&#x6570;&#x636E;&#x96C6;&#x8FDB;&#x884C;&#x5206;&#x5272;&#x3002;&#x600E;&#x4E48;&#x8868;&#x793A;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x96C6;&#x7684;&#x6DF7;&#x4E71;&#x5EA6;&#xFF1F;"></a>&#x6BCF;&#x6B21;&#x51B3;&#x7B56;&#x90FD;&#x4F1A;&#x5C06;&#x6570;&#x636E;&#x96C6;&#x8FDB;&#x884C;&#x5206;&#x5272;&#x3002;&#x600E;&#x4E48;&#x8868;&#x793A;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x96C6;&#x7684;&#x6DF7;&#x4E71;&#x5EA6;&#xFF1F;</h3></blockquote><p>&#x5BF9;&#x4E8E;&#x591A;&#x4E2A;&#x6570;&#x636E;&#x96C6;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x7B97;&#x51FA;&#x5404;&#x81EA;&#x7684;&#x4FE1;&#x606F;&#x91CF;&#xFF0C;&#x7136;&#x540E;&#x5206;&#x914D;&#x6743;&#x91CD;&#xFF0C;&#x6C42;&#x548C;&#x5373;&#x53EF;&#x3002;</p><p><strong>&#x4FE1;&#x606F;&#x71B5;&#x6307;&#x6570;</strong></p><p>$Ent\<em>index=\sum\limits</em>{v=1}^{V}\frac{\vert D^v\vert}{ {\vert D\vert} }Ent(D^v)$</p><p><strong>&#x57FA;&#x5C3C;&#x6307;&#x6570;(Gini index)</strong></p><p>$Gini\<em>index(D,a)=\sum\limits</em>{v=1}^V\frac{\vert D^v\vert}{ {\vert D\vert} }Gini(D^v)$</p><blockquote><h3 id="&#x8868;&#x793A;&#x6570;&#x636E;&#x6DF7;&#x4E71;&#x5EA6;&#x7684;&#x65B9;&#x6CD5;&#x6709;&#x4E86;&#xFF0C;&#x90A3;&#x7B97;&#x6CD5;&#x5E94;&#x8BE5;&#x5177;&#x4F53;&#x600E;&#x4E48;&#x5E94;&#x7528;&#x5462;&#xFF1F;"><a href="#&#x8868;&#x793A;&#x6570;&#x636E;&#x6DF7;&#x4E71;&#x5EA6;&#x7684;&#x65B9;&#x6CD5;&#x6709;&#x4E86;&#xFF0C;&#x90A3;&#x7B97;&#x6CD5;&#x5E94;&#x8BE5;&#x5177;&#x4F53;&#x600E;&#x4E48;&#x5E94;&#x7528;&#x5462;&#xFF1F;" class="headerlink" title="&#x8868;&#x793A;&#x6570;&#x636E;&#x6DF7;&#x4E71;&#x5EA6;&#x7684;&#x65B9;&#x6CD5;&#x6709;&#x4E86;&#xFF0C;&#x90A3;&#x7B97;&#x6CD5;&#x5E94;&#x8BE5;&#x5177;&#x4F53;&#x600E;&#x4E48;&#x5E94;&#x7528;&#x5462;&#xFF1F;"></a>&#x8868;&#x793A;&#x6570;&#x636E;&#x6DF7;&#x4E71;&#x5EA6;&#x7684;&#x65B9;&#x6CD5;&#x6709;&#x4E86;&#xFF0C;&#x90A3;&#x7B97;&#x6CD5;&#x5E94;&#x8BE5;&#x5177;&#x4F53;&#x600E;&#x4E48;&#x5E94;&#x7528;&#x5462;&#xFF1F;</h3></blockquote><p><del>&#x867D;&#x7136;&#x6211;&#x89C9;&#x5F97;&#x76F4;&#x63A5;&#x7528;&#x8FD9;&#x4E24;&#x4E2A;&#x6307;&#x6570;&#x5C31;&#x5B8C;&#x4E8B;&#x4E86;&#xFF0C;&#x4F46;&#x4E8B;&#x5B9E;&#x5F53;&#x7136;&#x4E0D;&#x53EF;&#x80FD;&#x8FD9;&#x4E48;&#x7B80;&#x5355;</del></p><blockquote><blockquote><p><strong>ID3&#x51B3;&#x7B56;&#x6811;</strong>(Quinlan,1986)&#x4EE5;<strong>&#x4FE1;&#x606F;&#x589E;&#x76CA;</strong>&#x4E3A;&#x51C6;&#x5219;&#x6765;&#x9009;&#x62E9;&#x5212;&#x5206;&#x5C5E;&#x6027;&#x3002;</p></blockquote></blockquote><p><strong>&#x4FE1;&#x606F;&#x589E;&#x76CA;&#xFF1A;</strong> $Gain(D,a)=Ent(D)-\sum\limits_{v=1}^{V}\frac{\vert D^v\vert}{\vert D\vert}Ent(D^v)$   &#x589E;&#x76CA;&#x8D8A;&#x5927;&#x8BF4;&#x660E;&#x201C;&#x7EAF;&#x5EA6;&#x201D;&#x63D0;&#x5347;&#x8D8A;&#x5FEB;</p><p>&#x4F46;&#x53D1;&#x73B0;&#xFF0C;&#x4FE1;&#x606F;&#x589E;&#x76CA;&#x6709;&#x4E2A;&#x5F0A;&#x7AEF;&#xFF0C;&#x90A3;&#x5C31;&#x662F;<em>&#x5BF9;&#x53D6;&#x503C;&#x6570;&#x76EE;&#x8F83;&#x591A;&#x7684;&#x5C5E;&#x6027;&#x6709;&#x6240;&#x504F;&#x597D;</em>&#xFF08;&#x53EF;&#x4EE5;&#x60F3;&#x8C61;&#x5F53;&#x5C5E;&#x6027;&#x79CD;&#x7C7B;&#x975E;&#x5E38;&#x591A;&#x65F6;&#xFF0C;&#x6BD4;&#x5982;&#x4E0D;&#x5C0F;&#x5FC3;&#x628A;&#x7F16;&#x53F7;&#x5F53;&#x6210;&#x7684;&#x5C5E;&#x6027;&#xFF0C;&#x8FD9;&#x65F6;&#x5212;&#x5206;&#x51FA;&#x6765;&#x7684;&#x5B50;&#x96C6;&#x7EAF;&#x5EA6;&#x90FD;&#x9971;&#x548C;&#xFF0C;&#x8FD9;&#x660E;&#x663E;&#x662F;&#x4E0D;&#x5229;&#x7684;&#xFF09;</p><blockquote><blockquote><p>&#x4E8E;&#x662F;Quinlan&#x5927;&#x4F6C;&#x5728;<strong>C4.5&#x51B3;&#x7B56;&#x6811;</strong>&#x4E2D;&#x63D0;&#x51FA;&#x4E86;&#x7528;<strong>&#x4FE1;&#x606F;&#x589E;&#x76CA;&#x7387;</strong>&#x6765;&#x4F5C;&#x4E3A;&#x51C6;&#x5219;&#x5212;&#x5206;&#x5C5E;&#x6027;&#x3002;</p></blockquote></blockquote><p><strong>&#x4FE1;&#x606F;&#x589E;&#x76CA;&#x7387;&#xFF1A;</strong> $Gain\<em>ratio(D,a)=\frac{Gain(D,a)}{IV(a)}$        $IV(a)=-\sum\limits</em>{v=1}^{V}\frac{\vert D^v\vert}{\vert D\vert}\log_{2}\frac{\vert D^v\vert}{\vert D\vert}$</p><p>IV(a)&#x88AB;&#x79F0;&#x4E3A;&#x5C5E;&#x6027;a&#x7684;&#x201C;&#x56FA;&#x6709;&#x503C;(intrinsic value)&#x201D;,&#x5B9E;&#x9645;&#x4E0A;&#x5C31;&#x662F;a&#x5C5E;&#x6027;&#x7684;&#x4FE1;&#x606F;&#x71B5;&#x2026;..</p><p>&#x4F46;&#x95EE;&#x9898;&#x53C8;&#x6765;&#x4E86;&#xFF0C;&#x8FD9;&#x6837;&#x4E00;&#x5904;&#x7406;&#xFF0C;&#x53D8;&#x7684;&#x5BF9;&#x53D6;&#x503C;&#x6570;&#x76EE;&#x8F83;&#x5C11;&#x7684;&#x5C5E;&#x6027;&#x6709;&#x6240;&#x504F;&#x597D;&#x4E86;&#x2026;.</p><p>&#x4E8E;&#x662F;C4.5 &#x91C7;&#x7528;&#x4E86;<em>&#x542F;&#x53D1;&#x5F0F;</em>&#xFF1A;&#x5148;&#x4ECE;&#x5019;&#x9009;&#x5212;&#x5206;&#x5C5E;&#x6027;&#x4E2D;&#x627E;&#x51FA;&#x4FE1;&#x606F;&#x589E;&#x76CA;&#x9AD8;&#x4E8E;&#x5E73;&#x5747;&#x6C34;&#x5E73;&#x7684;&#x5C5E;&#x6027;&#xFF0C;&#x518D;&#x4ECE;&#x4E2D;&#x9009;&#x62E9;&#x589E;&#x76CA;&#x7387;&#x6700;&#x9AD8;&#x7684;&#x3002;</p><blockquote><blockquote><p><strong>CART&#x51B3;&#x7B56;&#x6811;</strong>(Breiman et al.1984)&#x5219;&#x662F;&#x76F4;&#x63A5;&#x9009;&#x62E9;&#x4E86;&#x57FA;&#x5C3C;&#x6307;&#x6570;&#x4F5C;&#x4E3A;&#x51C6;&#x5219;&#xFF0C;&#x6BCF;&#x6B21;&#x9009;&#x6307;&#x6570;&#x6700;&#x4F4E;&#x7684;&#x5C5E;&#x6027;&#x8FDB;&#x884C;&#x5212;&#x5206;&#x3002;</p></blockquote></blockquote><h2 id="3-&#x51CF;&#x679D;-pruning"><a href="#3-&#x51CF;&#x679D;-pruning" class="headerlink" title="3.&#x51CF;&#x679D; pruning"></a>3.&#x51CF;&#x679D; pruning</h2><p>&#x6709;&#x4E86;&#x5212;&#x5206;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x53EF;&#x4EE5;&#x751F;&#x6210;&#x4E00;&#x9897;&#x51B3;&#x7B56;&#x6811;&#x4E86;&#x3002;&#x4F46;&#x662F;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x95EE;&#x9898;&#x53C8;&#x6765;&#x4E86;&#xFF01;<strong>&#x8FC7;&#x62DF;&#x5408;</strong> &#xFF01;</p><p>&#x51B3;&#x7B56;&#x6811;&#x662F;&#x5341;&#x5206;&#x5BB9;&#x6613;&#x8FC7;&#x62DF;&#x5408;&#x7684;&#xFF01;&#x56E0;&#x4E3A;&#x6BCF;&#x6B21;&#x5212;&#x5206;&#xFF0C;&#x5C5E;&#x6027;&#x6709;&#x51E0;&#x7C7B;&#xFF0C;&#x5C31;&#x4F1A;&#x751F;&#x6210;&#x51E0;&#x4E2A;&#x5206;&#x652F;&#xFF0C;&#x5728;&#x5B9E;&#x9645;&#x4E2D;&#x8FD9;&#x5B8C;&#x5168;&#x6CA1;&#x6709;&#x5FC5;&#x8981;&#x3002;&#x751A;&#x81F3;&#x5728;&#x4E0D;&#x542B;&#x51B2;&#x7A81;&#x6570;&#x636E;&#x7684;&#x8BAD;&#x7EC3;&#x96C6;&#x4E2D;&#xFF0C;&#x80FD;&#x751F;&#x6210;&#x8BAD;&#x7EC3;&#x8BEF;&#x5DEE;&#x4E3A;0&#x7684;&#x51B3;&#x7B56;&#x6811;&#x3002;</p><p>&#x4E8E;&#x662F;&#x5C31;&#x6709;&#x4E86;&#x51CF;&#x679D;&#x5904;&#x7406;&#xFF0C;&#x5C06;&#x90A3;&#x4E9B;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x5206;&#x652F;&#x53BB;&#x9664;~</p><blockquote><h3 id="&#x90A3;&#x4E48;&#x600E;&#x4E48;&#x5224;&#x65AD;&#x4E00;&#x4E2A;&#x5206;&#x652F;&#x9700;&#x4E0D;&#x9700;&#x8981;&#xFF1F;"><a href="#&#x90A3;&#x4E48;&#x600E;&#x4E48;&#x5224;&#x65AD;&#x4E00;&#x4E2A;&#x5206;&#x652F;&#x9700;&#x4E0D;&#x9700;&#x8981;&#xFF1F;" class="headerlink" title="&#x90A3;&#x4E48;&#x600E;&#x4E48;&#x5224;&#x65AD;&#x4E00;&#x4E2A;&#x5206;&#x652F;&#x9700;&#x4E0D;&#x9700;&#x8981;&#xFF1F;"></a>&#x90A3;&#x4E48;&#x600E;&#x4E48;&#x5224;&#x65AD;&#x4E00;&#x4E2A;&#x5206;&#x652F;&#x9700;&#x4E0D;&#x9700;&#x8981;&#xFF1F;</h3></blockquote><p>&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x5C31;&#x9700;&#x8981;&#x7528;<em>&#x9A8C;&#x8BC1;&#x96C6;</em>&#x6765;&#x5E2E;&#x52A9;&#x8FDB;&#x884C;&#x6027;&#x80FD;&#x8BC4;&#x4F30;&#x4E86;&#x3002;</p><p>&#x902E;&#x5230;&#x4E00;&#x4E2A;&#x975E;&#x53F6;&#x8282;&#x70B9;&#xFF0C;&#x7528;&#x9A8C;&#x8BC1;&#x96C6;&#x6D4B;&#x8BD5;&#x4E00;&#x4E0B;&#xFF0C;&#x770B;&#x770B;&#x5728;&#x8FD9;&#x4E2A;&#x8282;&#x70B9;&#x5206;&#x7C7B;&#x548C;&#x4E0D;&#x5206;&#x7C7B;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6B63;&#x786E;&#x7387;&#x6709;&#x591A;&#x5C11;&#x3002;&#x5982;&#x679C;&#x53D1;&#x73B0;&#x5206;&#x7C7B;&#x540E;&#x53CD;&#x800C;&#x51C6;&#x786E;&#x7387;&#x964D;&#x4F4E;&#x4E86;&#x6216;&#x4E0D;&#x53D8;(&#x5965;&#x5361;&#x59C6;&#x5243;&#x5200;&#x51C6;&#x5219;)&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x53EF;&#x4EE5;&#x5C06;&#x8FD9;&#x4E2A;&#x8282;&#x70B9;&#x526A;&#x53BB;&#x3002;&#xFF08;&#x5728;&#x4E0D;&#x5206;&#x7C7B;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x8BE5;&#x8282;&#x70B9;&#x6570;&#x636E;&#x96C6;&#x4E2D;&#x6700;&#x591A;&#x6570;&#x91CF;&#x7684;label&#x6765;&#x66FF;&#x4EE3;&#x8BE5;&#x8282;&#x70B9;&#xFF09;</p><blockquote><h3 id="&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x51CF;&#x679D;&#x6BD4;&#x8F83;&#x597D;&#xFF1F;"><a href="#&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x51CF;&#x679D;&#x6BD4;&#x8F83;&#x597D;&#xFF1F;" class="headerlink" title="&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x51CF;&#x679D;&#x6BD4;&#x8F83;&#x597D;&#xFF1F;"></a>&#x4EC0;&#x4E48;&#x65F6;&#x5019;&#x51CF;&#x679D;&#x6BD4;&#x8F83;&#x597D;&#xFF1F;</h3></blockquote><blockquote><blockquote><p><strong>&#x9884;&#x51CF;&#x679D;&#xFF1A;</strong> &#x5728;&#x51B3;&#x7B56;&#x6811;&#x751F;&#x6210;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6BCF;&#x6B21;&#x5212;&#x5206;&#x90FD;&#x8FDB;&#x884C;&#x5224;&#x65AD;&#x3002;</p></blockquote></blockquote><p>&#x4F18;&#x70B9;&#xFF1A;&#x8D2A;&#x5FC3;&#xFF0C;&#x65E9;&#x53D1;&#x73B0;&#x65E9;&#x5904;&#x7406;&#x3002;&#x53EF;&#x4EE5;&#x663E;&#x8457;&#x51CF;&#x5C11;&#x51B3;&#x7B56;&#x6811;&#x7684;&#x8BAD;&#x7EC3;&#x65F6;&#x95F4;&#x5F00;&#x9500;&#x548C;&#x6D4B;&#x8BD5;&#x65F6;&#x95F4;&#x5F00;&#x9500;&#x3002;</p><p>&#x7F3A;&#x70B9;&#xFF1A;&#x6B20;&#x62DF;&#x5408;&#x98CE;&#x9669;&#x3002;&#x56E0;&#x4E3A;&#x6709;&#x4E9B;&#x5206;&#x652F;&#x5728;&#x5F53;&#x524D;&#x8282;&#x70B9;&#x5212;&#x5206;&#x53EF;&#x80FD;&#x4E0D;&#x5229;&#x4E8E;&#x6CDB;&#x5316;&#x6027;&#x80FD;&#xFF0C;&#x4F46;&#x5728;&#x5176;&#x57FA;&#x7840;&#x4E0A;&#x8FDB;&#x884C;&#x7684;&#x540E;&#x7EED;&#x5212;&#x5206;&#x5374;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x6027;&#x80FD;&#x7684;&#x63D0;&#x5347;&#x3002;</p><blockquote><blockquote><p><strong>&#x540E;&#x51CF;&#x679D;&#xFF1A;</strong>&#x751F;&#x6210;&#x5B8C;&#x6574;&#x4E2A;&#x6811;&#x540E;&#xFF0C;&#x81EA;&#x4E0B;&#x800C;&#x4E0A;&#x5BF9;&#x975E;&#x53F6;&#x8282;&#x70B9;&#x8FDB;&#x884C;&#x5224;&#x65AD;&#x3002;</p></blockquote></blockquote><p>&#x4F18;&#x70B9;&#xFF1A;&#x6B20;&#x62DF;&#x5408;&#x98CE;&#x9669;&#x5F88;&#x5C0F;&#xFF0C;&#x6CDB;&#x5316;&#x6027;&#x80FD;&#x4F18;&#x4E8E;&#x9884;&#x51CF;&#x679D;&#x3002;</p><p>&#x7F3A;&#x70B9;&#xFF1A;&#x8BAD;&#x7EC3;&#x65F6;&#x95F4;&#x5927;&#x5927;&#x589E;&#x52A0;&#x3002;</p><h2 id="4-&#x8FDE;&#x7EED;&#x503C;&#x4E0E;&#x7F3A;&#x5931;&#x503C;"><a href="#4-&#x8FDE;&#x7EED;&#x503C;&#x4E0E;&#x7F3A;&#x5931;&#x503C;" class="headerlink" title="4.&#x8FDE;&#x7EED;&#x503C;&#x4E0E;&#x7F3A;&#x5931;&#x503C;"></a>4.&#x8FDE;&#x7EED;&#x503C;&#x4E0E;&#x7F3A;&#x5931;&#x503C;</h2><p>&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#xFF0C;&#x6211;&#x4EEC;&#x5904;&#x7406;&#x7684;&#x90FD;&#x5F88;&#x5F00;&#x5FC3;&#x3002;&#x4F46;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x53C8;&#x6709;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x51FA;&#x73B0;&#x4E86;&#xFF01;&#x4E4B;&#x524D;&#x7684;&#x5C5E;&#x6027;&#x503C;&#x90FD;&#x662F;&#x79BB;&#x6563;&#x7684;&#x90FD;&#x662F;&#x5B8C;&#x6574;&#x7684;&#x6240;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x7684;&#x5C31;&#x8FDB;&#x884C;&#x4E86;&#x5212;&#x5206;&#xFF0C;&#x4F46;&#x5B9E;&#x9645;&#x4E2D;&#x5F80;&#x5F80;&#x5E76;&#x4E0D;&#x662F;&#x3002;</p><blockquote><h3 id="&#x8FDE;&#x7EED;&#x503C;&#x600E;&#x4E48;&#x5904;&#x7406;&#xFF1F;"><a href="#&#x8FDE;&#x7EED;&#x503C;&#x600E;&#x4E48;&#x5904;&#x7406;&#xFF1F;" class="headerlink" title="&#x8FDE;&#x7EED;&#x503C;&#x600E;&#x4E48;&#x5904;&#x7406;&#xFF1F;"></a>&#x8FDE;&#x7EED;&#x503C;&#x600E;&#x4E48;&#x5904;&#x7406;&#xFF1F;</h3></blockquote><p>&#x8FDE;&#x7EED;&#x503C;&#x5728;&#x5C5E;&#x6027;&#x4E2D;&#x5341;&#x5206;&#x5E38;&#x89C1;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x53EF;&#x80FD;&#x628A;&#x4ED6;&#x548C;&#x79BB;&#x6563;&#x503C;&#x4E00;&#x6837;&#x5904;&#x7406;&#xFF0C;&#x60F3;&#x60F3;&#x524D;&#x9762;<em>&#x4FE1;&#x606F;&#x589E;&#x76CA;</em>&#x7684;&#x906D;&#x9047;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x80FD;&#x660E;&#x767D;&#x4E00;&#x4E2A;&#x8FC7;&#x591A;&#x5206;&#x7C7B;&#x7684;&#x5C5E;&#x6027;&#x5BF9;&#x4E8E;&#x51B3;&#x7B56;&#x6811;&#x7684;&#x6CDB;&#x5316;&#x6027;&#x80FD;&#x662F;&#x4E0D;&#x5229;&#x7684;&#x3002;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x5C31;&#x9700;&#x8981;&#x8FDE;&#x7EED;&#x5C5E;&#x6027;&#x79BB;&#x6563;&#x5316;&#x6280;&#x672F;&#x4E86;&#x3002;</p><p><strong>C4.5&#x51B3;&#x7B56;&#x6811;</strong>&#x91C7;&#x53D6;&#x4E86;&#x6700;&#x7B80;&#x5355;&#x7684;&#x7B56;&#x7565;&#x2013;<strong>&#x4E8C;&#x5206;&#x6CD5;(bi-partition)</strong>:&#x8FD9;&#x79CD;&#x7B56;&#x7565;&#x7B80;&#x5355;&#x7684;&#x6765;&#x8BF4;&#x5C31;&#x662F;&#x5C06;&#x8FDE;&#x7EED;&#x503C;&#x5206;&#x4E3A;&#x5927;&#x4E8E;&#x67D0;&#x4E2A;&#x503C;&#x7684;&#x7C7B;&#x548C;&#x4E0D;&#x5927;&#x4E8E;&#x67D0;&#x4E2A;&#x503C;&#x7684;&#x7C7B;&#x3002;</p><p>&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x201C;&#x67D0;&#x4E2A;&#x503C;&#x600E;&#x4E48;&#x786E;&#x5B9A;&#x201D;&#xFF1F;</p><p>&#x5F53;&#x7136;&#x662F;&#x4E00;&#x4E2A;&#x4E2A;&#x8BD5;&#x8FC7;&#x6765;&#x5566;&#xFF01;&#x4F60;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x53D6;&#x6BCF;&#x4E2A;&#x503C;&#x8BD5;&#x4E00;&#x4E0B;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x53D6;&#x6392;&#x5E8F;&#x540E;&#x76F8;&#x90BB;&#x503C;&#x7684;&#x5E73;&#x5747;&#x503C;&#x6765;&#x8BD5;&#x4E00;&#x4E0B;&#xFF0C;&#x7136;&#x540E;&#x4ECE;&#x4E2D;&#x9009;&#x62E9;&#x90A3;&#x4E2A;&#x5BF9;&#x4FE1;&#x606F;&#x91CF;&#x6700;&#x53CB;&#x597D;&#x7684;&#x503C;&#x4F5C;&#x4E3A;&#x4E8C;&#x5206;&#x6CD5;&#x7684;&#x9608;&#x503C;&#x3002;</p><p><strong>&#x53E6;&#x5916;&#x6CE8;&#x610F;&#xFF1A;</strong> &#x8FD9;&#x4E2A;&#x5C5E;&#x6027;&#x88AB;&#x4E8C;&#x5206;&#x4E4B;&#x540E;&#xFF0C;&#x8FD8;&#x80FD;&#x4F5C;&#x4E3A;&#x540E;&#x4EE3;&#x8282;&#x70B9;&#x7684;&#x5212;&#x5206;&#x5C5E;&#x6027;&#xFF01;</p><blockquote><h3 id="&#x7F3A;&#x5931;&#x7684;&#x503C;&#x600E;&#x4E48;&#x5904;&#x7406;"><a href="#&#x7F3A;&#x5931;&#x7684;&#x503C;&#x600E;&#x4E48;&#x5904;&#x7406;" class="headerlink" title="&#x7F3A;&#x5931;&#x7684;&#x503C;&#x600E;&#x4E48;&#x5904;&#x7406;"></a>&#x7F3A;&#x5931;&#x7684;&#x503C;&#x600E;&#x4E48;&#x5904;&#x7406;</h3></blockquote><p>&#x7F3A;&#x5931;&#x503C;&#x76F8;&#x6BD4;&#x8FDE;&#x7EED;&#x503C;&#x5904;&#x7406;&#x8D77;&#x6765;&#x5C31;&#x9EBB;&#x70E6;&#x591A;&#x4E86;&#x3002;<del>&#x56E0;&#x4E3A;&#x6709;&#x603B;&#x6BD4;&#x6CA1;&#x6709;&#x597D;</del></p><p>C4.5&#x7B97;&#x6CD5;&#x4F7F;&#x7528;&#x4E86;<strong>&#x5206;&#x914D;&#x6743;&#x91CD;</strong>&#x7684;&#x65B9;&#x6CD5;&#x8FDB;&#x884C;&#x89E3;&#x51B3;&#x3002;</p><p>&#x5148;&#x5B9A;&#x4E49;&#x4E00;&#x4E9B;&#x63A5;&#x4E0B;&#x6765;&#x8981;&#x7528;&#x5230;&#x7684;&#x4E1C;&#x897F;&#xFF1A;</p><p>&#x8BAD;&#x7EC3;&#x96C6;D&#xFF0C;&#x5C5E;&#x6027;a&#xFF0C;&#x65E0;&#x7F3A;&#x5931;&#x503C;&#x7684;&#x5B50;&#x96C6;D&#x2018;&#xFF0C;&#x5C5E;&#x6027;a&#x6709;V&#x4E2A;&#x53D6;&#x503C;&#xFF0C;&#x6700;&#x540E;&#x7ED9;&#x6BCF;&#x4E2A;&#x6837;&#x672C;x&#x8D4B;&#x4E88;&#x4E00;&#x4E2A;&#x6743;&#x91CD;Wx(&#x521D;&#x59CB;&#x4E3A;1)</p><blockquote><h3 id="&#x90A3;&#x4E48;&#x5728;&#x5C5E;&#x6027;&#x7F3A;&#x5931;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x600E;&#x4E48;&#x8FDB;&#x884C;&#x5212;&#x5206;&#x5C5E;&#x6027;&#x7684;&#x9009;&#x62E9;&#xFF1F;"><a href="#&#x90A3;&#x4E48;&#x5728;&#x5C5E;&#x6027;&#x7F3A;&#x5931;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x600E;&#x4E48;&#x8FDB;&#x884C;&#x5212;&#x5206;&#x5C5E;&#x6027;&#x7684;&#x9009;&#x62E9;&#xFF1F;" class="headerlink" title="&#x90A3;&#x4E48;&#x5728;&#x5C5E;&#x6027;&#x7F3A;&#x5931;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x600E;&#x4E48;&#x8FDB;&#x884C;&#x5212;&#x5206;&#x5C5E;&#x6027;&#x7684;&#x9009;&#x62E9;&#xFF1F;"></a>&#x90A3;&#x4E48;&#x5728;&#x5C5E;&#x6027;&#x7F3A;&#x5931;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x600E;&#x4E48;&#x8FDB;&#x884C;&#x5212;&#x5206;&#x5C5E;&#x6027;&#x7684;&#x9009;&#x62E9;&#xFF1F;</h3></blockquote><p>en&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x2026;&#x9996;&#x5148;&#x5F53;&#x7136;&#x53EA;&#x80FD;&#x4ECE;&#x5B58;&#x5728;&#x7684;V&#x4E2A;&#x5C5E;&#x6027;&#x503C;&#x4E2D;&#x9009;&#x62E9;~&#x7136;&#x540E;&#x8FDB;&#x884C;&#x4FE1;&#x606F;&#x589E;&#x76CA;&#x503C;&#x7684;&#x8BA1;&#x7B97;&#x3002;</p><p>&#x7531;&#x4E8E;&#x6709;&#x7F3A;&#x5931;&#x503C;&#x6240;&#x4EE5;&#x4FE1;&#x606F;&#x589E;&#x76CA;&#x7684;&#x516C;&#x5F0F;&#x9700;&#x8981;&#x53D8;&#x5316;&#xFF1A;</p><p>$Gain(D,a)=\rho*(Ent(D&#x2019;)-\sum \limits_{k=1}^{V}r&#x2019;_vEnt(D&#x2019;^v))$</p><p>$Ent(D&#x2019;)=-\sum \limits_{k=1}^{\vert y\vert}p&#x2019;_klog_2p&#x2019;_{k}$       </p><p>$\rho=\frac{\sum_{x\in D&#x2019;} W_X}{\sum_{x\in D} W_X}$                 &#x65E0;&#x7F3A;&#x5931;&#x6837;&#x672C;&#x6240;&#x5360;&#x7684;&#x6743;&#x91CD;&#x6BD4;</p><p>$p&#x2019;<em>k=\frac{\sum</em>{x\in D&#x2019;_k} W_X}{\sum_{x\in D&#x2019;} W_X}$              &#x65E0;&#x7F3A;&#x5931;&#x6837;&#x672C;&#x4E2D;&#x6BCF;&#x7C7B;&#x6240;&#x5360;&#x7684;&#x6743;&#x91CD;&#x6BD4;</p><p>$r&#x2019;<em>v=\frac{\sum</em>{x\in D&#x2019;_v} W_X}{\sum_{x\in D&#x2019;} W_X}$              &#x65E0;&#x7F3A;&#x5931;&#x6837;&#x672C;&#x4E2D;&#xFF0C;&#x5C5E;&#x6027;&#x53D6;&#x503C;&#x4E3A;V&#x65F6;&#x6240;&#x5360;&#x7684;&#x6743;&#x91CD;&#x6BD4;</p><p>&#x5B9E;&#x9645;&#x4E0A;&#x5C31;&#x662F;&#x5148;&#x5C06;&#x6709;&#x7F3A;&#x5931;&#x6837;&#x672C;&#x65E0;&#x89C6;&#xFF0C;&#x8BA1;&#x7B97;&#x65E0;&#x7F3A;&#x5931;&#x6837;&#x672C;&#x7684;Gain,&#x6700;&#x540E;&#x5728;&#x4E58;&#x4EE5;&#x65E0;&#x7F3A;&#x5931;&#x6837;&#x672C;&#x6240;&#x5360;&#x7684;&#x6743;&#x91CD;&#x6BD4;&#xFF0C;&#x4F5C;&#x4E3A;&#x6574;&#x4F53;Gain&#x3002;</p><blockquote><h3 id="&#x90A3;&#x4E48;&#x6709;&#x4E86;&#x5212;&#x5206;&#x5C5E;&#x6027;&#xFF0C;&#x600E;&#x4E48;&#x5BF9;&#x7F3A;&#x5931;&#x6837;&#x4F8B;&#x8FDB;&#x884C;&#x5212;&#x5206;&#x5462;&#xFF1F;"><a href="#&#x90A3;&#x4E48;&#x6709;&#x4E86;&#x5212;&#x5206;&#x5C5E;&#x6027;&#xFF0C;&#x600E;&#x4E48;&#x5BF9;&#x7F3A;&#x5931;&#x6837;&#x4F8B;&#x8FDB;&#x884C;&#x5212;&#x5206;&#x5462;&#xFF1F;" class="headerlink" title="&#x90A3;&#x4E48;&#x6709;&#x4E86;&#x5212;&#x5206;&#x5C5E;&#x6027;&#xFF0C;&#x600E;&#x4E48;&#x5BF9;&#x7F3A;&#x5931;&#x6837;&#x4F8B;&#x8FDB;&#x884C;&#x5212;&#x5206;&#x5462;&#xFF1F;"></a>&#x90A3;&#x4E48;&#x6709;&#x4E86;&#x5212;&#x5206;&#x5C5E;&#x6027;&#xFF0C;&#x600E;&#x4E48;&#x5BF9;&#x7F3A;&#x5931;&#x6837;&#x4F8B;&#x8FDB;&#x884C;&#x5212;&#x5206;&#x5462;&#xFF1F;</h3></blockquote><p>&#x5F88;&#x660E;&#x663E;&#xFF0C;&#x65E2;&#x7136;&#x5DF2;&#x7ECF;&#x7ED9;&#x6BCF;&#x4E2A;&#x6837;&#x4F8B;&#x8D4B;&#x503C;&#x4E86;&#x6743;&#x91CD;&#xFF0C;&#x90A3;&#x4E48;&#x73B0;&#x5728;&#x5C31;&#x662F;&#x5206;&#x914D;&#x6743;&#x91CD;&#x7684;&#x65F6;&#x5019;&#x4E86;&#x3002;</p><p>&#x5BF9;&#x4E8E;&#x65E0;&#x7F3A;&#x5931;&#x7684;&#x6837;&#x4F8B;&#xFF0C;&#x5F53;&#x7136;&#x662F;&#x76F4;&#x63A5;&#x5F52;&#x7C7B;&#xFF0C;&#x6743;&#x91CD;&#x4E0D;&#x53D8;&#x3002;</p><p>&#x5BF9;&#x4E8E;&#x6709;&#x7F3A;&#x5931;&#x7684;&#x6837;&#x4F8B;&#xFF0C;&#x5219;&#x540C;&#x65F6;&#x5212;&#x5165;&#x6240;&#x6709;&#x7684;&#x5B50;&#x8282;&#x70B9;&#xFF0C;&#x6743;&#x91CD;&#x53D8;&#x4E3A;$r&#x2019;_v*w_x$ &#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BA9;&#x540C;&#x4E00;&#x4E2A;&#x6837;&#x672C;&#x4EE5;&#x4E0D;&#x540C;&#x7684;&#x6982;&#x7387;&#x5212;&#x5165;&#x4E0D;&#x540C;&#x7684;&#x5B50;&#x8282;&#x70B9;&#x4E2D;&#x53BB;&#x3002;</p><h2 id="5-&#x591A;&#x53D8;&#x91CF;&#x51B3;&#x7B56;&#x6811;"><a href="#5-&#x591A;&#x53D8;&#x91CF;&#x51B3;&#x7B56;&#x6811;" class="headerlink" title="5.&#x591A;&#x53D8;&#x91CF;&#x51B3;&#x7B56;&#x6811;"></a>5.&#x591A;&#x53D8;&#x91CF;&#x51B3;&#x7B56;&#x6811;</h2><p>&#x5BF9;&#x4E8E;&#x8FD9;&#x90E8;&#x5206;&#xFF0C;&#x5C31;&#x4E86;&#x89E3;&#x4E00;&#x4E0B;&#xFF0C;&#x53CD;&#x6B63;&#x5B9E;&#x73B0;&#x662F;&#x505A;&#x4E0D;&#x5230;&#x7684;&#x4E86;&#x3002;</p><blockquote><h3 id="&#x4EC0;&#x4E48;&#x662F;&#x591A;&#x53D8;&#x91CF;&#xFF1F;"><a href="#&#x4EC0;&#x4E48;&#x662F;&#x591A;&#x53D8;&#x91CF;&#xFF1F;" class="headerlink" title="&#x4EC0;&#x4E48;&#x662F;&#x591A;&#x53D8;&#x91CF;&#xFF1F;"></a>&#x4EC0;&#x4E48;&#x662F;&#x591A;&#x53D8;&#x91CF;&#xFF1F;</h3></blockquote><p>&#x591A;&#x53D8;&#x91CF;&#x6307;&#x7684;&#x5C31;&#x662F;&#x6BCF;&#x6B21;&#x51B3;&#x7B56;&#x540C;&#x65F6;&#x5BF9;&#x591A;&#x4E2A;&#x5C5E;&#x6027;&#x4E0B;&#x624B;&#xFF01;</p><p>&#x524D;&#x9762;&#x8BB2;&#x5230;&#x7684;&#x51B3;&#x7B56;&#x6811;&#x90FD;&#x662F;&#x6BCF;&#x6B21;&#x53EA;&#x5BF9;&#x4E00;&#x4E2A;&#x5C5E;&#x6027;&#x8FDB;&#x884C;&#x5212;&#x5206;&#xFF0C;&#x8FD9;&#x4F1A;&#x9020;&#x6210;&#x8FD9;&#x79CD;&#x51B3;&#x7B56;&#x6811;&#x7684;&#x5206;&#x7C7B;&#x8FB9;&#x754C;&#x4F1A;&#x6BD4;&#x8F83;&#x6B7B;&#x677F;&#xFF0C;&#x5448;&#x73B0;<em>&#x8F74;&#x5E73;&#x884C;</em>&#x7684;&#x7279;&#x5F81;&#xFF0C;&#x5C31;&#x50CF;&#x7528;&#x4E00;&#x6BB5;&#x6BB5;&#x4E0E;&#x8F74;&#x5E73;&#x884C;&#x7684;&#x7EBF;&#x6BB5;&#x53BB;&#x62DF;&#x5408;&#x8FB9;&#x754C;&#x3002;&#x5F53;&#x8FB9;&#x754C;&#x6BD4;&#x8F83;&#x590D;&#x6742;&#x65F6;&#xFF0C;&#x4F1A;&#x5BFC;&#x81F4;&#x51B3;&#x7B56;&#x6811;&#x5F88;&#x590D;&#x6742;&#xFF0C;&#x5F88;&#x5E9E;&#x5927;&#xFF0C;&#x5BFC;&#x81F4;&#x5F00;&#x9500;&#x5F88;&#x5927;&#x3002;</p><p>&#x800C;&#x5982;&#x679C;&#x591A;&#x4E2A;&#x53D8;&#x91CF;&#x540C;&#x65F6;&#x5206;&#x7C7B;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x80FD;&#x591F;&#x753B;&#x51FA;&#x659C;&#x7EBF;&#x751A;&#x81F3;&#x66F2;&#x7EBF;&#x7684;&#x5206;&#x7C7B;&#x8FB9;&#x754C;&#x4E86;&#xFF0C;&#x8FD9;&#x6837;&#x4E0D;&#x4F46;&#x62DF;&#x5408;&#x7684;&#x66F4;&#x597D;&#xFF0C;&#x8FD8;&#x80FD;&#x4F7F;&#x51B3;&#x7B56;&#x6811;&#x66F4;&#x7CBE;&#x7B80;&#x3002;</p><blockquote><h3 id="&#x600E;&#x4E48;&#x5B9E;&#x73B0;&#x591A;&#x53D8;&#x91CF;&#xFF1F;"><a href="#&#x600E;&#x4E48;&#x5B9E;&#x73B0;&#x591A;&#x53D8;&#x91CF;&#xFF1F;" class="headerlink" title="&#x600E;&#x4E48;&#x5B9E;&#x73B0;&#x591A;&#x53D8;&#x91CF;&#xFF1F;"></a>&#x600E;&#x4E48;&#x5B9E;&#x73B0;&#x591A;&#x53D8;&#x91CF;&#xFF1F;</h3></blockquote><p>&#x8FD9;&#x5C31;&#x6BD4;&#x8F83;&#x9EBB;&#x70E6;&#x4E86;&#xFF0C;&#x9700;&#x8981;&#x5728;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x90FD;&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;&#x7EBF;&#x6027;\&#x975E;&#x7EBF;&#x6027;&#x5206;&#x7C7B;&#x5668;&#x3002;&#x8BF4;&#x767D;&#x4E86;&#x5C31;&#x662F;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x90FD;&#x8981;&#x8FDB;&#x884C;&#x4E00;&#x6B21;&#x72EC;&#x7ACB;&#x7684;&#x5206;&#x7C7B;&#x3002;&#x6BD4;&#x5982;&#x5728;&#x8282;&#x70B9;&#x4E0A;&#x5D4C;&#x5165;&#x4E00;&#x4E2A;&#x7EBF;&#x6027;&#x5206;&#x7C7B;&#x5668;&#xFF0C;&#x5D4C;&#x5165;&#x4E00;&#x4E2A;&#x795E;&#x7ECF;&#x7F51;&#x7EDC;&#xFF0C;&#x6216;&#x8005;&#x5D4C;&#x5165;&#x4E00;&#x4E2A;&#x611F;&#x77E5;&#x673A;&#x4EC0;&#x4E48;&#x7684;&#x3002;&#x60F3;&#x60F3;&#x90FD;&#x6050;&#x6016;~</p><script>        document.querySelectorAll('.github-emoji')          .forEach(el => {            if (!el.dataset.src) { return; }            const img = document.createElement('img');            img.style = 'display:none !important;';            img.src = el.dataset.src;            img.addEventListener('error', () => {              img.remove();              el.style.color = 'inherit';              el.style.backgroundImage = 'none';              el.style.background = 'none';            });            img.addEventListener('load', () => {              img.remove();            });            document.body.appendChild(img);          });      </script>]]></content>
    
    <summary type="html">
    
      DecisionTree算法学习笔记
    
    </summary>
    
      <category term="机器学习" scheme="https://cenleiding.github.io/categories/%E6%9C%BA%E5%99%A8%E5%AD%A6%E4%B9%A0/"/>
    
    
      <category term="机器学习" scheme="https://cenleiding.github.io/tags/%E6%9C%BA%E5%99%A8%E5%AD%A6%E4%B9%A0/"/>
    
  </entry>
  
  <entry>
    <title>KNN(K-Nearest Neighbor)&amp;K-近邻学习</title>
    <link href="https://cenleiding.github.io/KNN.html"/>
    <id>https://cenleiding.github.io/KNN.html</id>
    <published>2018-10-07T06:20:55.000Z</published>
    <updated>2018-10-09T11:48:22.431Z</updated>
    
    <content type="html"><![CDATA[<blockquote><p> &#x672C;&#x6587;&#x53EA;&#x5BF9;KNN&#x8FDB;&#x884C;&#x4E00;&#x4E9B;&#x6982;&#x5FF5;&#x4ECB;&#x7ECD;&#x3002; </p></blockquote><p><strong>&#x76D1;&#x7763;&#x5B66;&#x4E60;</strong>&#xFF1A;&#x9700;&#x8981;&#x5DF2;&#x7ECF;&#x6807;&#x6CE8;&#x597D;&#x7684;&#x8BAD;&#x7EC3;&#x96C6;&#x3002;</p><p><strong>&#x61D2;&#x60F0;&#x5B66;&#x4E60;</strong>&#xFF1A;&#x6CA1;&#x6709;&#x663E;&#x793A;&#x7684;&#x8BAD;&#x7EC3;&#x8FC7;&#x7A0B;&#xFF0C;&#x8BAD;&#x7EC3;&#x65F6;&#x95F4;&#x5F00;&#x9500;&#x4E3A;0&#xFF0C;&#x5F85;&#x6536;&#x5230;&#x6D4B;&#x8BD5;&#x6837;&#x672C;&#x4E4B;&#x540E;&#x518D;&#x8FDB;&#x884C;&#x5904;&#x7406;&#x3002;</p><p><strong>&#x590D;&#x6742;&#x5EA6;</strong>&#xFF1A;&#x7531;&#x4E8E;&#x662F;&#x61D2;&#x60F0;&#x5B66;&#x4E60;&#xFF0C;&#x56E0;&#x6B64;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;&#x6D4B;&#x8BD5;&#x503C;&#x90FD;&#x9700;&#x8981;&#x904D;&#x5386;&#x8BAD;&#x7EC3;&#x6837;&#x672C;&#xFF0C;&#x9700;&#x8981;&#x4FDD;&#x5B58;&#x6240;&#x6709;&#x7684;&#x8BAD;&#x7EC3;&#x6837;&#x672C;&#x3002;&#x65F6;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x548C;&#x7A7A;&#x95F4;&#x590D;&#x6742;&#x5EA6;&#x90FD;&#x5F88;&#x9AD8;&#x3002; </p><p><strong>&#x9519;&#x8BEF;&#x7387;</strong>&#xFF1A;&#x5F53;&#x6570;&#x636E;&#x8DB3;&#x591F;&#x5927;&#xFF0C;&#x7B97;&#x6CD5;&#x4FDD;&#x8BC1;&#x9519;&#x8BEF;&#x7387;&#x4E0D;&#x4F1A;&#x8D85;&#x8FC7;&#x8D1D;&#x53F6;&#x65AF;&#x7B97;&#x6CD5;&#x9519;&#x8BEF;&#x7387;&#x7684;&#x4E24;&#x500D;</p><p><strong>&#x673A;&#x5236;</strong>&#xFF1A;&#x7ED9;&#x5B9A;&#x6D4B;&#x8BD5;&#x6837;&#x672C;&#xFF0C;&#x57FA;&#x4E8E;&#x67D0;&#x79CD;&#x8DDD;&#x79BB;&#x5EA6;&#x91CF;    &#x627E;&#x51FA;&#x8BAD;&#x7EC3;&#x96C6;&#x4E2D;&#x4E0E;&#x5176;&#x6700;&#x9760;&#x8FD1;&#x7684;K&#x4E2A;&#x8BAD;&#x7EC3;&#x6837;&#x672C;&#xFF0C;&#x7136;&#x540E;&#x57FA;&#x4E8E;&#x8FD9;K&#x4E2A;&#x201C;&#x90BB;&#x5C45;&#x201D;&#x7684;&#x4FE1;&#x606F;&#x8FDB;&#x884C;&#x9884;&#x6D4B;&#xFF08;&#x5BF9;&#x4E8E;<em>&#x5206;&#x7C7B;&#x4EFB;&#x52A1;</em>&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x6295;&#x7968;&#x6CD5;&#xFF0C;&#x5BF9;&#x4E8E;<em>&#x56DE;&#x5F52;&#x4EFB;&#x52A1;</em>&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x5E73;&#x5747;&#x6CD5;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x8DDD;&#x79BB;&#x8FDC;&#x8FD1;&#x8FDB;&#x884C;&#x52A0;&#x6743;&#xFF09;&#x3002;<img src="/KNN/KNN_1.png" alt="image"></p><p><strong>&#x8DDD;&#x79BB;&#x5EA6;&#x91CF;</strong>&#xFF1A;</p><p>&#x66FC;&#x54C8;&#x987F;&#x8DDD;&#x79BB;&#xFF1A;<img src="http://latex.codecogs.com/gif.latex?d(x,y)=\sum\limits_{i=1}^{n}|x_{i}-y_{i}|"></p><p><em>&#x6B27;&#x6C0F;&#x8DDD;&#x79BB;</em>&#xFF1A;<img src="http://latex.codecogs.com/gif.latex?d(x,y)=\sqrt{\sum\limits_{i=1}^{n}(x_{i}-y_{i})^2}">&#x7528;&#x4E8E;&#x6570;&#x503C;&#x578B;&#x6570;&#x636E;</p><p>&#x6D77;&#x660E;&#x8DDD;&#x79BB;&#xFF1A;Hamming distance             &#x7528;&#x4E8E;&#x5B57;&#x7B26;&#x4E32;&#x578B;&#x6570;&#x636E;</p><p><strong>&#x53C2;&#x6570;&#x9009;&#x62E9; </strong>&#xFF1A;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5728;&#x5206;&#x7C7B;&#x65F6;&#x8F83;&#x5927;&#x7684;K&#x503C;&#x80FD;&#x591F;&#x51CF;&#x5C0F;&#x566A;&#x58F0;&#x7684;&#x5F71;&#x54CD;&#xFF0C;&#x4F46;&#x4F1A;&#x4F7F;&#x7C7B;&#x522B;&#x4E4B;&#x95F4;&#x7684;&#x754C;&#x9650;&#x53D8;&#x5F97;&#x6A21;&#x7CCA;&#x3002;&#x4E00;&#x4E2A;&#x8F83;&#x597D;&#x7684;K&#x503C;&#x80FD;&#x901A;&#x8FC7;&#x5404;&#x79CD;&#x542F;&#x53D1;&#x5F0F;&#x6280;&#x672F;&#x6765;&#x83B7;&#x53D6;&#x3002;</p><p><a href="https://github.com/cenleiding/learning-Machine-Learning/tree/master/KNN" target="_blank" rel="noopener"><strong>&#x4EE3;&#x7801;&#x5B9E;&#x73B0; </strong></a></p><script>        document.querySelectorAll('.github-emoji')          .forEach(el => {            if (!el.dataset.src) { return; }            const img = document.createElement('img');            img.style = 'display:none !important;';            img.src = el.dataset.src;            img.addEventListener('error', () => {              img.remove();              el.style.color = 'inherit';              el.style.backgroundImage = 'none';              el.style.background = 'none';            });            img.addEventListener('load', () => {              img.remove();            });            document.body.appendChild(img);          });      </script>]]></content>
    
    <summary type="html">
    
      KNN算法学习笔记
    
    </summary>
    
      <category term="机器学习" scheme="https://cenleiding.github.io/categories/%E6%9C%BA%E5%99%A8%E5%AD%A6%E4%B9%A0/"/>
    
    
      <category term="机器学习" scheme="https://cenleiding.github.io/tags/%E6%9C%BA%E5%99%A8%E5%AD%A6%E4%B9%A0/"/>
    
  </entry>
  
</feed>
